[
  {
    "restaurantName": "Room Cafe",
    "restaurantAddress": "190b Prince Ade Odedina Street, Victoria Island ",
    "restaurantPhoneNumber": " 0908 285 1609",
    "review": " This review is going to start off a bit weird because I initially went out to eat at Smalliez Diner. Luckily, I was able to get a seat, which is a big deal because the restaurant was full to the brim. Unfortunately though, when I asked for the menu, the server told me the food would take about 90 minutes to get to me, and I wasn’t down for that. I immediately got up to find somewhere else close by and saw The Room Cafe was just a few buildings away. So, that’s the story of how I ended up there and how this post was born. There’s something about this space that reminds me of a typical restaurant in Dubai — airy, small and clean. The decor is very simple, it has nice greenery and a nice display of candles (which I believe were for sale). They also have a space for events upstairs with a 25-guest capacity — perfect for baby showers, bridal showers, birthdays, etc. On their Instagram, it also says they sell flowers, but I didn’t see any of that; would have been lovely to get a peek at those. The laminated paper menu the server offered me was about to start souring the experience (when we’re not in Spur), but fortunately, the restaurant had a range of meals and drinks to help compensate for the slight lack of finesse. I ordered the Grilled Prawns and Mashed Potatoes and a Chicken Burger to start. It’s as if these people knew I wasn’t in the mood for games, because both meals took about 15 minutes to get to the table and that was really impressive for Lagos. The prawns and mashed potatoes came first and it immediately smelt quite yum, just right off the bat. The mashed potatoes were really creamy, buttery and lump-free — a solid 10/10. The portion of prawns was also decent — I felt like I got my money’s worth — and it was very satisfying. Have to say I really enjoyed eating this. Things started to go downhill from here though. When the chicken burger came, the patty was a piece of battered chicken, which would have been fine if it was stated on the menu. Unfortunately, the batter was so thick that I had to send it back to the kitchen. Thankfully, I didn’t have to deal with any moody staff; the servers were really helpful and the manager was very hands-on. They even offered us the chance to order an entirely different meal on the house. For dessert, I went for a piece of Lotus Cheesecake. Where I really began to worry was when I saw pancakes coming towards me, with crushed Lotus biscuits sprinkled around the short stack and a biscuit on top, instead of the cheesecake I ordered. To be honest, I was starving, so I humoured them and gobbled the whole thing down. It was really good — the pancakes were fluffy, and the syrup and Lotus crumble combo is a real match made in heaven. I did let the manager know, though, and they figured out it was an error and apologised deeply — which is cool, but, you know… do better, kitchen crew. Let’s talk about the drinks! I think The Room Cafe does a good job of making their cocktails look fun. The choice of glasses was quirky and I loved it. I ordered the Cinderella and Passion Pearl cocktails, and both drinks were as delicious as they were fun to look at. It’s worth noting that I think their prices are fair for both meals and drinks. This restaurant would be a lovely spot for a first date; it’s nice and cosy and there’s a good background music situation going on. If you’re in the mood for a lengthy tea-drinking sesh with a friend, they also have a cute sunroom. ",
    "spendDetails": {
      "itemsBought": [
        {
          "itemName": "Grilled Prawns & Mashed Potatoes",
          "itemPrice": "10000"
        },
        { "itemName": "Chicken burger", "itemPrice": "8000" },
        { "itemName": "Passion Pearl", "itemPrice": "6000" },
        { "itemName": "Cinderella", "itemPrice": "5000" },
        { "itemName": "Lotus Cheesecake", "itemPrice": "4500" }
      ],
      "totalSpend": 33500
    },
    "link": "https://www.eatdrinklagos.com/review/2023/3/22/review-room-cafe-victoria-island"
  },
  {
    "restaurantName": "Smalliez Diner ",
    "restaurantAddress": "181b Moshood Olugbani, Victoria Island ",
    "restaurantPhoneNumber": " 0705 123 9999",
    "review": " Ed Note: Smalliez Diner recently decided to announce a dress code policy for guests (P.S. it’s “SMART CASUAL”), because it’s apparently that deep. You’ve been warned sha. At 1 pm on a random day, a friend shared an Instagram post about Smalliez Diner, an all-day brunch restaurant. As a lover of cute spaces and a bona fide smallie, I knew I had to visit. Moreover, the diner had just opened on February 17th, so it was new and exciting. When I checked their Instagram page, the bio stated that reservations were required. So, I made one for two people via DM. However, I later noticed that the requirement was no longer stated, so walk-ins may be acceptable now. I went on a Sunday, and boy, was the place packed! I had to go to the top floor to find a good seat (there were three floors). I really thought I was part of an exclusive club of the few people who knew about this new spot, but nope. Lagos babes had found it out, dears. To be honest, I shouldn't have been that surprised by the crowd, considering they had that many followers on social; plus, who doesn't love Sunday brunch? There were also a number of children there, so it definitely comes across as a kid-friendly spot. Aside from the crowd, what stood out to me was their exceptional customer service. The security guard opened my Uber door, and the waiter politely directed me to my preferred seating. They even pulled out a chair and tucked it back in. Other Lagos restaurants should learn from them. The top floor had an old-school RnB music situation that I loved. Within ten minutes of ordering, I was served a complimentary scone, which was unexpected. The scone tasted good but was hard on the outside and soft on the inside, so it didn't crumble entirely when my fork went through it. A little disappointing, but nothing to cry about. Shebi it was even free? 20 minutes later, I was served my meal and drink, while my waiter sincerely apologized for the late delivery. To be honest, it hadn't even occurred to me to complain because a 30-minute turnaround time in Lagos is not at all bad. I had the Chicken Toast, which is basically deep-fried chicken and French toast with a maple sauce. The menu description said it came with microgreens and edible flowers, but the microgreens were nowhere to be found, and the edible flowers didn't look as exciting as they sounded. Guys, the French toast was YUM though chef's kiss. The bread was so soft, and the cinnamon flavouring and sweetness were sublime. The toast didn't even need the maple syrup to taste good, but it was a very welcome addition. The chicken, on the other hand, paled in comparison. The flavour was almost completely missing; it was like they took all their time to snap with the toast and said \"oya let's just rush and do this chicken\". It even came slightly burnt. I sha appreciated the contrast in texture between the crunchy skin and succulent exterior. For my drink, I had a Pink Bubble Gum Mojito, which was sweet, tangy, and had a bubble gum flavour. My guest had a Blackout Brownie and an Orange and Passionfruit Iced Tea. She didn't get a complimentary scone though, but I think it was an oversight. She joined me later, so I ordered ahead for her, and by the time she got there, her food and drink were served within 20 minutes. The meal took about 40 minutes altogether to be ready.  The brownie had Belgian waffles, fudge brownies, meringue kisses, and vanilla ice cream with chocolate and salted caramel drizzles. It was sweet and scrumptious, while the ice cream was creamy and rich. It was so creamy and rich that I had to ask the waiter if it was made in-house. Turns out it was, so big BONUS points. When I first saw that they charged N3800 per scoop, I thought it was ludicrous, but I was less appalled when I tasted it. Still side-eyeing them a bit though. If you're not a sweet tooth, steer ⚠️ clear ⚠️ There were also edible flowers on it, but once again, they didn't really add anything to the meal. The waffles, which were meant to be the main character of the meal, they were quite a letdown. It tasted okay, but the texture wasn't right at all. They were a bit crusty and had more of a biscuity texture.  The iced tea was another letdown. It was basically overpriced juice and definitely not worth the 6k. We couldn't even detect the Jasmine tea, if there was any, and the orange flavour overpowered the drink. Once again, I'll applaud their customer service. Even though the restaurant was packed, the waiter came over to ask for feedback at multiple points, graciously took my friend's comments about the waffles, and offered genuine-sounding apologies. Another thing: I liked that they had both sweet and savoury versions of their brunch options. Their menu range was impressive. I imagine during the week, when it's much less crowded, this is a good spot for remote work. They were very intentional about putting charging points at the wall seats, and the ambiance just makes sense for that sorta thing. P.S.: There's no extra VAT or service charge, so what you see on the menu is what you get on your bill. POSTSCRIPT I will definitely be going back to Smalliez, but I now know what to steer clear of. VERDICT  SUBSCRIBE Sign up with your email address to receive news and updates. SIGN UP We respect your privacy.",
    "spendDetails": { "itemsBought": [], "totalSpend": 0 },
    "link": "https://www.eatdrinklagos.com/review/2023/3/10/review-smalliez-diner-victoria-island"
  },
  {
    "restaurantName": "Safron Restaurant ",
    "restaurantAddress": "57 Joel Ogunnaike Street, Ikeja GRA ",
    "restaurantPhoneNumber": " 0817 296 9360",
    "review": " Saffron Rooftop had been on my mind for a while. Rooftop restaurants on the mainland are a bit more of a rarity, a bejeweled prize, compared to those on the island, so this was a fairly big deal for me. I made a reservation for two on their website the day before, so I was all set to go. Although reservations aren't mandatory, I wasn't taking any chances, especially since it was a Saturday night. Ed note: We were ready to tease Oyinda to infinity at “for two”, based on say love is in the air, but turns out this was an innocent girls’ night out 😏 Saffron Rooftop is located on the top floor of The Saffron Hotel. To my surprise, the space was smaller than I had imagined, or perhaps it was just the crowd that made it seem that way. Nonetheless, I was grateful that I had made a reservation in advance. The atmosphere was more of a party vibe, rather than the sophisticated energy I was expecting, but it was not a problem. On the other hand, the space was as pretty as I had imagined it to be. Once we were seated, it took quite a while for us to be attended to. The waiter did not even bring us a menu. When we finally received a physical menu from the waiter, it only had drinks listed, and I was puzzled by the situation. Did they not serve food? There was a buffet set up in one corner, but I had thought that Saffron Rooftop served a la carte meals, based on the menu I saw on their Instagram. To make a long story short, it turned out that the a la carte menu was only available at the restaurant on the ground floor. The buffet cost 15,000 per person, but the options were not very appealing, so we decided to go to the restaurant instead. The restaurant was in an open space just a stone's throw from the lobby and thankfully 😮‍💨, it had a more sophisticated ambiance, mostly due to the piano being played in the background – a touch of sophistication. Although it was a little crowded with two small parties, it was not as overwhelming as the rooftop restaurant. We were attended to promptly, which showed that the servers in this restaurant had customer service down pat, compared to those at the rooftop restaurant. I ordered the Golden Chicken Wings to share as a starter, Cordon Bleu as my main dish, and a Saffron Strawpple mocktail. My guest ordered a Strawberry Daiquiri and a Shish Tawook sandwich, which excited me because it reminded me of Dubai, but unfortunately, the waiter returned to tell us it was not available. She then settled for a chicken club sandwich with a side of fries. For my Cordon Bleu, I asked for a side of mashed potatoes, but again, that was not available, which was strange because potato wedges and fries were available. Are they not the same potato? This made me question whether they were using store-bought frozen fries and wedges, but I could be mistaken. P.S. they also serve the cocktail versions of our drinks, but we just felt like giving it a rest on alcohol that night.  The waiter asked if we wanted our drinks immediately, a question that I always appreciate because it ensures that you don't finish your drinks before the food arrives. But we asked for our drinks to come with the meal. It took nearly 40 minutes for the wings to be served, which is an unnecessarily long time for deep-fried chicken, in my opinion. The worst part? They were not fully cooked. I mean, we weren't eating raw chicken, but the flesh inside was still slightly pink, especially for the larger wings. They were also a bit dry, so we had to ask for a dipping sauce, which the waiter brought without any additional charge. It went down a lot better with the sweet chilli sauce, but really, a sauce should be an added bonus, not something you need to make the food edible. Note to restaurants in Lagos: If an item is listed as a starter or appetizer on your menu, it should not take more than 20 minutes to reach the customer. Please and thank you 🙏🏽. Thankfully, the wait time for the main courses was much more acceptable at Safron. They were served along with our drinks in less than 20 minutes. The Cordon Bleu was decent, but it did not provide the classic \"melt in your mouth\" experience. The cheese was not fully melted, which is crucial ⚠️⚠️, and as a result, it did not add enough moisture to the other ingredients. I felt that the chicken could have used a little more flavor. However, overall, it was still decent. The potato wedges that came with it were golden-brown, fried to perfection, and delicious. Safron redeemed itself with the Safron Strawpple mocktail, which was both delicious and healthy-tasting. The combination of lemon juice, fresh strawberries, fresh pineapples, soda, and simple syrup was perfect, with the pineapples being the most prominent ingredient. I was also impressed with the generous portion size of the drink. My guest's chicken club sandwich was decent, but the chicken could have been a bit softer. They seemed to have omitted the bacon, which is a staple in club sandwiches. My guest jokingly asked if they were afraid of fully toasting the bread 😂. However, I appreciated the addition of fried eggs, the fresh vegetables, and the perfectly fried side of fries. The virgin daiquiri was quite sweet, which wasn’t a bad thing for me, but could definitely be a bit of an overload for some people — so beware. Unfortunately, there was no dessert on the menu. (*pause for dramatic effect*)  However, when we asked the server, he informed us that they could offer us cake slices from the hotel bakery. We ended up with a marble cake that tasted great. The moral of the story is: If you ask, you shall receive At some point, my guest and I were fed up with the cold, so we went to the outdoor poolside area, just beside the restaurant, despite being warned of potential mosquitoes. Thankfully, we didn't encounter any mosquitoes, and the warmth was greatly appreciated. Additionally, the view was stunning. Chilling there was a great way to end the night. By the way, I really appreciated the excellent customer service provided by our waiter, Kenneth, downstairs. Also, it's worth noting that there was no extra VAT or service charge added, so the prices listed on the menu are all that you'll pay. 👍🏾  SUBSCRIBE Sign up with your email address to receive news and updates. SIGN UP We respect your privacy.",
    "spendDetails": {
      "itemsBought": [
        { "itemName": "Golden Chicken Wings", "itemPrice": "5500" },
        { "itemName": "Cordon Bleu", "itemPrice": "9000" },
        { "itemName": "Chicken Club Sandwich", "itemPrice": "6000" },
        { "itemName": "Safron Strawpple", "itemPrice": "3500" },
        { "itemName": "Virgin Daiquiri", "itemPrice": "3500" },
        { "itemName": "Marble Cake", "itemPrice": "2500" }
      ],
      "totalSpend": 30000
    },
    "link": "https://www.eatdrinklagos.com/review/2023/2/10/review-safron-reestaurant-ikeja"
  },
  {
    "restaurantName": "Taj Restaurant | Bar",
    "restaurantAddress": "1064 Alagbon Close, Victoria Island, Lagos ",
    "restaurantPhoneNumber": " 0704 744 9000",
    "review": " NOSA: Well, it's been a minute since we've had a night out to review some new place. We had our sights set on Mako, but alas, we weren't popping enough to get in, so we settled for Taj Restaurant on Alagbon Close in Victoria Island. We thought it was an Indian restaurant from the name and branding, but boy were we wrong. This place had sushi, pasta, tacos, and steak on one menu, but no trace of India was found.  Our first red flag should have been the small bottled water. Restaurants that serve only small bottles of water are always up to something. FOLLY: We hadn’t done this in a minute, so I decided to get on a cocktail, even though they were pricier than I'm willing to pay for drinks in Lagos. (This new cocktail pricing regime in Lagos does not bode well with me). I went with the lavender gin and tonic, but unfortunately, it was nothing special. Just gin, tonic, and lavender syrup. In retrospect, I should have listened to Nosa and saved my 8,500. NOSA: Also, I know the economy is tough, but 8,500 Naira for a gin and tonic that I could've whipped up at home? Criminal. To start, we ordered the Pulled Hoisin Beef Brisket Bao, Crispy Fish Tacos, and Chicken Pops. The Brisket Bao sounded promising on paper, with 24-hour slow-braised hoisin beef, fresh veggies, and sesame seeds. But in reality, it was a mess. The bao was structurally sound, which is already a win in Lagos, but it had a sour taste that left a bad taste in my mouth. And don't even get me started on the Crispy Fish Tacos. I opted for the hard-shell variety, big mistake. FOLLY: As soon as Nosa ordered them, I made a face, prompting him to ask the waiter to switch to soft shells. But Nosa being Nosa, he decided to stick with the hard shells, even after I warned him about their potential cardboard-like taste. NOSA:  I swear these guys used stale old El Paso brand shells that tasted like plastic. The fresh fish inside sharply contrasted and made me long for my local taco joint, El Padrino. On the other hand, the fish was incredibly fresh, making the taco's staleness even more disappointing. FOLLY: I ended up scooping out the filling and eating it alone, leaving the shell in the taco tray thing. NOSA: El Padrino has nothing to worry about.  The Chicken Pops were an attempt to recreate the dish at another Lagos restaurant, RSVP. But Taj's version was a far cry from the original.  FOLLY: I was really looking forward to trying this, but the sweet and sour sauce tasted like cheap ketchup with too much vinegar. The management contacted me via Instagram DM to say that the sauces are house made and fresh, but I'm still sceptical. NOSA: The \"signature sweet and sour sauce\" tasted like straight-up ketchup, and the chicken tempura had all the excitement of a bland festival snack. Nahi and Maya at RSVP, too, have nothing to worry about. For the main, we got the Puree Bell Pepper Surf And Turf - penne pasta in a red bell pepper puree sauce with shrimp, calamari, beef chunks, and boneless chicken fillet. But, surprise, surprise, ours came with linguine instead, with no explanation. And it was broken, to boot!  FOLLY: I chose the pasta, not imagining that  Puree Bell Pepper Pasta was code for Jollof pasta. It was definitely spicy but pretty tasty, but not what I expected. Despite all that, it was the best thing we had all night. NOSA: All in all, we probably made the wrong call on everything we ordered. The space looked too nice for the food to taste, so second-rate. FOLLY: Not what I wanted for my triumphant return to blogging. NOSA: We had to go to Jay's Diner to cleanse our palates. But, shoutout to Taj for using Patronize and letting us pay with bank transfer, at least. FOLLY: I wanted to go to RSVP oh, but no parking. ",
    "spendDetails": {
      "itemsBought": [
        { "itemName": "Lavender Gin & Tonic", "itemPrice": "8500" },
        { "itemName": "Chicken Pops", "itemPrice": "8000" },
        { "itemName": "Pulled Hoisin Beef Brisket Bao", "itemPrice": "7500" },
        { "itemName": "Crispy Fish Tacos", "itemPrice": "8000" },
        { "itemName": "Puree Bell Pepper Surf & Turf", "itemPrice": "16000" }
      ],
      "totalSpend": 48000
    },
    "link": "https://www.eatdrinklagos.com/review/2023/2/4/review-taj-restaurant-amp-bar-victoria-island",
    "single": false
  },
  {
    "restaurantName": "Placebo Restaurant & Bar",
    "restaurantAddress": "51 Basheer Shittu Avenue, Magodo GRA Phase 2 ",
    "restaurantPhoneNumber": " 0904 169 5561",
    "review": " A little backstory: For months, I had been planning on trying out Placebo for a few reasons: It was close to me and I was always excited to find nice-looking restaurants close by. I didn't want to always have to spend a lot on Uber to enjoy a good meal at a nice restaurant. I had seen good reviews from people whose opinions I trusted. Their Instagram was impressive and I thought their menu looked interesting. I finally made my way there and to sum up the experience in two words: huge flop. It was a disaster that got progressively worse. I couldn't believe how bad my experience was. However, I decided to give them the benefit of the doubt and went a second time to give them a chance to redeem themselves. Spoiler alert: They actually did much better the second time around, but let’s take you through the disastrous visit first. On my first visit, I was a bit confused because Placebo shares a building with a men's hair salon, and I had to find my way to the restaurant. I walked past the outdoor seating by the bar but I wanted to sit inside. Unfortunately, the restaurant was too full, as there were two separate parties going on. On one end, there was a long row of Gen Zs playing board games (which the restaurant provided) and on the other end, there was a long row of parents, everyone doing their own thing. Again, there was no host/server to direct me, so I had to find a seat for myself. It took a while for my guest to arrive, but when she did, I finally got some customer service. One of two waiters, who seemed to be the only ones serving both indoors and outdoors, came to take our order. We asked for the \"Lamp” (I think they meant Lamb) Roll and Spicy Puff Puff for the starter, but they were unavailable. We then asked for the Trio of Sliders, but that was also unavailable. The server offered prawn crackers, spring rolls and gizzard, but we weren't interested in that, so we settled for chicken wings. We also ordered two of their signature cocktails, \"Ball Pasta\" and \"Oko Oju Omi,\" and a Tiramisu for dessert. A few minutes later, the bartender came over to get our drink order, which our waiter had never passed on 🙇🏽‍♀️. When we repeated the order, we were told that all nine of their signature cocktails were unavailable, and even classic cocktails were not on the menu. We ended up ordering a \"Sex on the Beach\" and a \"Mojito.\" My \"Sex on the Beach\" was an utter disappointment and tasted like vodka mixed with Chivita orange juice, with no cranberry or peach flavors detected. It paineddd me, because that’s my drink! 😭 The Mojito, at least, tasted like it was supposed to. For nearly an hour, our waiter was nowhere in sight. When she finally appeared, we complained about the wait time, and she commented \"I know, I know,\" without apologies or explanation. Finally, 10 minutes later, my \"Oko Oju Omi\" arrived.  It was supposed to be a grilled plantain boat stuffed with asun, but what was served was a plantain raft with some \"asun\" in the center that had no flavor. The “asun” is in quotes because it did not asun at all 🚫. PLUS I have no idea why they grilled overripe plantain, as it was way too soft. That’s probably why they couldn’t construct a boat with it? Or maybe in their minds, that’s what a plantain boat looked like. My guest's \"Ball Pasta,\" which was supposed to be spaghetti and meatballs, came shortly after. The dish had chunks of goat meat, but they called it meatballs, and the spaghetti tasted like basic jollof spaghetti. Somehow, my guest and I still had hope for the chicken wings, which were supposed to come as our starter. When we asked for an update well into the meal, the wings had not even been started. Why would you put an item on your starter menu if you know it’s going to take forever to make?  I was baffled. Oh, the Tiramisu was a no-show as well. At that point, we just asked for the bill so we could be on our very un-merry way out of there. I was hoping we just caught them on a really bad day and they’re not usually like that, but honestly, it was terrible! The, I assume, manager apologised to some other guests for their slow delivery and explained that they were grossly understaffed and had only two people running the kitchen, but even though, upon still...  This was a Sunday evening, it was definitely not the best time for them not to have their act together. The only highlight of the night was the music situation. It almost distracted me from how bad everything else was. Plus points for ambience, I guess. I tried to go in with an open mind, but I was still scarred from the first visit. This time, however, things were looking up from the start, as the same server who attended to us on the previous visit was all smiles and warmly directed me to an empty table. Finally, some customer service. The better service was probably due to the restaurant not being too crowded and the server not being overworked. Once again, there was no Tiramisu (or any other dessert) available, and the starter options were still scarce. I ordered the same Oko Oju Omi and Ball Pasta for my guest and myself. This time, it took about 40 minutes for both of our orders to arrive—a slight improvement, but still not ideal. No one should have to wait that long for plantain, meat, and tomato pasta. Surprisingly, the Ball Pasta was legitimate this time, and they had replaced spaghetti with penne. I was left wondering if they misheard my order the first time or if they simply failed to mention that Ball Pasta wasn't available, because what we were served the first time was unacceptable. The tomato sauce that came with the pasta was delicious! I couldn't get enough of it. It was slightly spicy and full of flavor. The Ball Pasta was quite similar to Penne Arrabbiata, but without the cheese toppings. The meatballs were also juicy and well-immersed in the sauce. The Oko Oju Omi was still a plantain raft, but this time, unripe plantains were used for the roast, resulting in the correct texture. The gizzard replaced the asun since it wasn't available, and the gizzard bits and pepper sauce were impressive. It was disappointing to realize that this was the chef's idea of a plantain boat. POSTSCRIPT I’m completely confused by the turnaround, but based on the second visit, I guess Placebo will be seeing me again VERDICT ",
    "spendDetails": {
      "itemsBought": [
        { "itemName": "Sex on the Beach", "itemPrice": "4000" },
        { "itemName": "Mojito", "itemPrice": "4000" },
        { "itemName": "Ball Pasta", "itemPrice": "6000" },
        { "itemName": "Oko Oju Omi", "itemPrice": "4000" }
      ],
      "totalSpend": 18000
    },
    "link": "https://www.eatdrinklagos.com/review/2023/1/31/review-placebo-magodo",
    "single": true
  },
  {
    "restaurantName": "Gusto",
    "restaurantAddress": "---",
    "review": " Upon arrival, I could see that most people preferred to dine outside, and I understood why. The outdoor area of the restaurant had a great atmosphere, with pleasant background music, the aroma of the open grill, and a clear view of the indoor aesthetic through the glass partition. Not shabby at all. My guests and I were fortunate to get a table, even though we hadn't made a reservation in advance and it was a busy night. However, I highly recommend making a reservation ahead of time. After being seated, we were presented with the menus which I found to be quite extensive and borderline confusing. Who doesn't dislike a menu that's as long as a book when you're starving? 🤦🏾‍♀️  After a headache-inducing search, I decided to start with the Crab Sensation Sushi because it sounded appealing. It was an 8-piece platter, each piece topped with a delicious crab meat sauce, and finished with a sprinkle of sea salt. I thoroughly enjoyed it and it was delicious, but it may not be the best option if you're new to trying sushi. I don't mean to boast on my high horse. 💅🏾 For my main course, I ordered the Veggie Yaki Ramen with chicken, and the Lamb Chops with Mashed Potatoes. Unfortunately, the ramen was giving mid; it was more of a stir-fry noodle situation and the flavors didn't stand out. However, I have to say that they were quite generous with the chicken pieces in the ramen and the portions were decent for the average eater The mashed potatoes were also disappointing - they weren't creamy and had lumps, which  is the no-no of no-nos if you’re going to serve mashed potatoes in a restaurant. I mean, this is basic. At this point, my experience at Gusto had been subpar and I was unsure of how the rest of the meal would turn out. The lamb chops were well-seasoned and cooked to my liking but were not particularly noteworthy. it was well seasoned and I got the medium-well done I asked for, but you know… wasn’t the highlight of the meal.  However, the drinks were a highlight - the Virgin Mojito and Aloha Breeze were simple but expertly made.  Classic, but premium 👌🏾 Overall, while the drinks were a positive, the food did not live up to expectations. ",
    "spendDetails": {
      "itemsBought": [
        { "itemName": "Veggie Yaki Ramen", "itemPrice": "12000" },
        { "itemName": "Lamb Chops", "itemPrice": "30000" },
        { "itemName": "Crab Sensation Sushi", "itemPrice": "12000" },
        { "itemName": "Aloha Breeze", "itemPrice": "6500" },
        { "itemName": "Virgin Mojito", "itemPrice": "6500" },
        { "itemName": "(Additional) Chicken", "itemPrice": "2000" }
      ],
      "totalSpend": 69000
    },
    "link": "https://www.eatdrinklagos.com/review/2023/1/27/review-gusto-victoria-island",
    "single": false
  },
  {
    "restaurantName": "Ci Gusta",
    "restaurantAddress": "Ibyinka Olorunbe Close, off Amodu Ojikutu Street, Victoria Island ",
    "restaurantPhoneNumber": " 0915 150 0000",
    "review": " Happy New Year, folks!  It's still holiday season in my head and I want to keep it that way 🥺. Anyway, I had been quite keen on checking out Ci Gusta with a couple of friends, because good pasta and a fake trip to Italy is always a good idea in my book. Finally, we picked a date and made it happen - in one of the rare-ish events where the plan actually makes it out of the group chat. My first impressions were that the interior was really clean, open, and 'soft'. It had a smooth layout and the kind of open-plan vibe that I love to see. You could watch the chefs making your meals, and the smell of the fresh pastry, and how nicely everything was displayed, got me in a pretty good mood. An important thing they also had was a kids' section, which I thought was super because most Lagos restaurants aren't kid-friendly. I don't know if this is generally deliberate or just an oversight, but it's a thing I've definitely noticed. Onto the food: Our meals took about 25 minutes to get to us. We all knew we wanted to try out pasta of some kind, in addition to starters and dessert. I got the Salmon Gnocchi, while the others had the Penne Arrabiata, Linguine Marinara, and a Salmon Salad. I have to give credit to Ci Gusta for their Salmon Salad, as it is now on my list of the best salads in Lagos. It was good - fresh, everything was crunchy, and overall, very satisfying. The focaccia it came with was also really tasty and fresh, and the cream cheese with the hint of lemon really made this whole dish stand out. (Ed Note: Aint no way that’s focaccia. Somebody is lying) However, something that stood out for the wrong reasons was my pasta dish. It wasn't what I was expecting. My gnocchi, which came in a cream base, was quite meh, even though the salmon bits were a good size and you could tell the pasta itself was made fresh (I found out later on that all their pasta is made from scratch). It just wasn't fantastic in terms of flavor, but it's not the worst thing I've ever eaten. The Penne Arrabiata was everyone's least favorite though. It was sort of dry, not up to par when it came to the taste, and overall, just didn't live up to its potential. We chose a tomato base for it, maybe we should have opted for something else? It also didn't come with any meat, so that might have contributed to it as well. Everyone agreed to rate it a 3/10. The Linguine Marinara, on the other hand, was YUM. Once again, because it was freshly made pasta, the texture was different from the regular linguine we're used to, but in a great way. This dish came with grilled salmon and it hit the spot. A solid choice. Oh, and we also ordered a batch of chicken wings, which we all kind of agreed we could have done without. They were just mid. As for the drinks, I ordered the Mighty Fruit Shake - a mix of various fruits (to be honest, I couldn't quite tell you which ones 👀) but it was good, a proper 10/10. It was, naturally, everyone's favorite. Then we got the Vanilla Frappe, which was very average, but quite pretty to look at if you're into \"Instagrammable drinks\". The syrup even had glitter in it! The last drink was the La Vie en Rose and I really liked this. It had sparkling water and strawberries, and went down really well with the table. How could I forget the best thing we had there? The smell of fresh pastry tormented us pretty much throughout our visit, especially before the meals came, and so we finally gave in and got their plain croissant and pain au chocolat. When it comes to pastry, Ci Gusta knows their stuff - or should we say dough? 😏 The croissant and pain au chocolat were flaky on the outside and perfectly fluffy and buttery on the inside. POSTSCRIPT The whole experience at Ci Gusta wasn’t super memorable, so I’d go again, but only to grab some pastry maybe.  VERDICT ",
    "spendDetails": {
      "itemsBought": [
        { "itemName": "Salmon Gnocchi", "itemPrice": "11000" },
        { "itemName": "Penne Arrabiata", "itemPrice": "9000" },
        { "itemName": "Linguine Marinara", "itemPrice": "11000" },
        { "itemName": "Salmon Salad", "itemPrice": "10000" },
        { "itemName": "Crispy Chicken Wings", "itemPrice": "5000" },
        { "itemName": "Vanilla Frappe", "itemPrice": "5000" },
        { "itemName": "La Vie en Rose", "itemPrice": "4000" },
        { "itemName": "Mighty Fruit Shake", "itemPrice": "4000" },
        { "itemName": "Pain au Chocolat", "itemPrice": "1800" },
        { "itemName": "Plain Croissant", "itemPrice": "1500" }
      ],
      "totalSpend": 62300
    },
    "link": "https://www.eatdrinklagos.com/review/2023/1/12/review-ci-gusta-lagos",
    "single": false
  },
  {
    "restaurantName": "Kaanubaru",
    "restaurantAddress": "20 Fola Jinadu Crescent, Gbagada Phase I ",
    "restaurantPhoneNumber": "  0814 969 2257",
    "review": " The way I can describe Kaanubaru is… it’s where you go to eat art — literally — without having to break the bank. Kaanubaru is a Mainland treasure that serves artfully presented and delicious dishes at modest prices, a refreshing departure from the overpriced and pretentious restaurants on the Island. At Kaanubaru, not only does the food look good -- and it really does -- it also delivers on taste.  On my first visit, I had a long day of meetings and needed to grab something to eat before heading back to my hotel. This was my first time in Gbagada, and I was determined to find some good restaurants. It didn't take me long to find Kaanubaru; maybe I was tired and just jumped at the first good option I saw, but either way, I'm glad I found this place.  The outside has everything I like in an outdoor restaurant space: lots of greenery, a breezy atmosphere, and a relaxed vibe. Inside, I immediately liked the vintage artwork on the walls, the tastefully arranged tables and seats, and the plants and flowers scattered around the space. Although I would have preferred the outdoor experience at Kaanubaru, the indoor area was also neat. Even though it was my first time at this restaurant, the ambiance made me feel like a regular. I sat at the bar, drank a glass of Watermelon Bling (which is just watermelon and lime juice), and ordered a bowl of the appetizer that caught my eye on the menu: Spicy Drunken Rice Noodles with fresh veggies and aromatic basil in a garlic chili sauce. I know what you're thinking: is that a starter? But yes, it was.  It was perfect. The bowl of drunken noodles was neither too light nor soggy, and it had a good balance of flavors. It couldn't have been better prepared, and the presentation was great, except that it was a little too spicy for me (I'm not a fan of pepper). Overall, it was a good value for the money. For my main, I had the Fisherman's Brunch (didn't get a photo 😭) and a bottle of wine. The dish was a delightful medley of Jollof rice, fish fillets, calamari, corn on the cob, fried plantains, jumbo prawns, and seasonal greens, all expertly crafted and bursting with flavor. From the complementary flavors to the little details in the presentation, Kaanubaru handled this one artfully. The wine, served in a decanter rather than simply brought over in the bottle, added a touch of elegance to the occasion. However, there are a few areas in which the restaurant could improve. The service was somewhat slow, leading to a longer than desirable wait time. Also, in my opinion, the servers here need some retraining on how to relate well with customers -- they could have been a lot more pleasant. Overall, though, these are minor quibbles in an otherwise excellent dining experience at Kaanubaru. When Israel isn’t at a desk w̶r̶i̶t̶i̶n̶g̶ having fun, he’s outside having some more fun. He loves Lagos, simply because it’s Lagos and the buzz never stops, and he could never turn down an opportunity to write about the city’s wonders. POSTSCRIPT Overall, I would rate Kaanubaru a 7.5/10. The atmosphere of the restaurant, menu and presentation worked 👌🏾 VERDICT ",
    "spendDetails": {
      "itemsBought": [
        { "itemName": "Watermelon Bling", "itemPrice": "3000" },
        { "itemName": "Spicy Drunken Noodles", "itemPrice": "5400" },
        { "itemName": "The Fisherman’s Brunch", "itemPrice": "9000" },
        { "itemName": "Wine", "itemPrice": "9500" }
      ],
      "totalSpend": 26900
    },
    "link": "https://www.eatdrinklagos.com/review/2023/1/3/review-kaanubaru-gbagada",
    "single": true
  },
  {
    "restaurantName": "Turaka",
    "restaurantAddress": "1637, Adetokunbo Ademola, Victoria Island ",
    "restaurantPhoneNumber": " 0906 800 0025",
    "review": " A certain Restaurant Week event was on almost throughout the month of November and I love me a good discount, so I had to hop on that! I didn’t even have the particular kind of bank card I needed to participate and I wasn’t ready to go through the stress of getting one, so I went knocking on the doors of all my friends’ DMs until I found my plug. I literally went on the last day of the event — the struggle was real 😂 There were a bunch of restaurant options, but Turaka was the prime choice because it was famed to have one of the best views in Lagos, so for that alone, I had to check it out. I also thought its name was a sort of challenge — “Turaka” means “unwind” or “loosen up” in Yoruba, so I wanted to see if the experience really embodied its name. Turaka is one of the many things EbonyLife Place has to offer; there’s also a hotel, a cinema and another restaurant in the same building. We were greeted with warm smiles right from the lobby and directed to the top floor where Turaka is located. We’d made a reservation beforehand, so things were pretty smooth from the entrance thereon out and the restaurant was basically empty. P.S. — reservations aren’t mandatory. They accept walk-ins or reservations for groups of 2-5 people, and recommend reservations for groups of 6 or more. I made my reservation via Instagram because I thought there were going to be 5 of us, but 3 of them cancelled last minute (still side-eyeing them), so it was all good.  We were led to their indoor sitting area because we went in the afternoon and the sun was out to destroy. Next time I go there, though, I’ll definitely target evening time so I can sit outdoors. Back to the inside though, the music situation was popping and the view was indeed actually something to behold. The rooftop overlooks a bit of the ocean, (what will be) Eko Atlantic, Eko Hotels and a stretch of Victoria Island’s high-rise buildings — definitely an ideal spot to unwind (oh, and propose!). Because of the glass walls, we were still able to enjoy the view, which was lovely, just as the décor is — simple and contemporary. To the food: I was there specifically for a set lunch menu that had been advertised (for N12000), so I had 2-3 options each to pick from for the starter, main and dessert. I ordered Spicy Chicken Wings (to share), Beer Battered Fish for my main and the Warm Chocolate Brownie to polish it off. As the menu didn’t cover drinks, so I ordered their signature “Toll Gate” cocktail separately. My guest ordered Pepper Chicken for her main, Vanilla Cheesecake for dessert and a Pina Colada. The wings and drinks got to us in about 15 minutes, which was a very reasonable wait time, if you ask me; it’s just a shame the wings were not at all spicy like the name suggested, at least not by Nigerian standards. I also definitely expected more flavour-wise, so they were pretty meh. The main course came in good time too — less than 20 minutes after our starters were served. The Beer Battered Fish was definitely my highlight of the meal; it was YUM. It came with yam fries, pepper sauce and “spicy” tartar sauce (seriously, they should probably just remove the spicy tag everywhere on their menu). The yam fries were crispy enough, delicious and went very well with the pepper sauce, though. The fish was perfectly crunchy on the outside, soft on the inside and didn’t taste like it was drenched in oil, and the (not) spicy tartar sauce was a perfect accompaniment for the fish.  As for the cocktails… y’all, I regretted my drink choice so much. I admit I got carried away by the name of the drink and the first few lines of the description on the menu, so I didn’t actually read the ingredient list. I missed the part where they said “a dash of bitter kola” 😭. I *really* don’t think it had any business being in a cocktail, but whatever floats their boat. It was basically very bitter Zobo with a good amount of vodka. My guest’s Pina Colada, on the other hand, was delicious. It was the right amount of everything: Milkiness, flavour and just a hint of alcohol.  Ps, if you’re worried about the “Beer” in the name, you can’t actually taste the alcohol since it’s cooked off in the oil and they probably used a very light beer, because it was completely undetectable. My guest’s Pepper Chicken came with Smokey Jollof Rice and Dodo Strips. The chicken melted in my mouth and was really tasty — had me wondering what went wrong with their wings. The Jollof rice tasted much like standard Party Jollof, but I didn’t like that it was made with Basmati rice; that’s what our Ghanaian brothers and sisters use please, not us. The Basmati rice adds a slightly different flavour from our regular rice. Also, they definitely added rooftop tax and then some to that meal, because N8,500 for standard Jollof, 3 mid-sized chicken pieces and dodo? Anyway, Turaka charges 5k for ordinary Chapman, so where’s the surprise? The desserts came about 7 minutes (the precision, I know 🤣) after we confirmed we were ready. The chocolate brownie tasted divine, but it would have slapped harder with the ice cream if it was actually warm, AS THE NAME SUGGESTED. Plus points for the white chocolate chips in the brownie and the delicious cookie crumbs. I’m getting pretty tired of having brownies for dessert at Lagos restaurants at this point, but this was really good.  Also, the only other dessert option on the specific menu was cheesecake and I’m not a fan. Feedback from my guest (who actually loves cheesecake) was that the one at Turaka was mid and too small for its price. Something I really enjoyed at Turaka was their customer service. Our server was very warm and well-paced and at some point, he even came around to ask us if we needed any changes to be made to the food or any other thing. They could have paid more attention to clean up between customers though, because there was a little leftover food littered around the table they led us to. ",
    "spendDetails": { "itemsBought": [], "totalSpend": 47300 },
    "link": "https://www.eatdrinklagos.com/review/2022/12/29/review-turaka-victoria-island",
    "single": false
  },
  {
    "restaurantName": "Crust Cafe",
    "restaurantAddress": "5 Fola Osibo Road, Lekki Phase I ",
    "restaurantPhoneNumber": " 0901 313 3300",
    "review": " First review of December and I’m excited because this is a spot I 👏🏾 LIKE 👏🏾 y’all 👏🏾 I found out about Crust Cafe from my Explore page on Instagram and immediately quite liked the look of it. Even better, I found out it’s literally a stone’s throw from my office. So I picked a day and carried myself there. I’ve been there twice now and although I had different things, my experience was pretty similar. Let’s start with the look and feel. Interior-wise, I honestly love how fresh and clean the space is — the open bar, coffee machines in view and very large windows (fab for photos) all just give it a very ‘soft’ vibe that I really like. On my first visit, I ordered the Bacon-ish - crepes, Nutella, syrup, fresh berries, a side of eggs and bacon - and a blueberry milkshake.  The meal took about 15-20 minutes to get to me and it was, indeed, a whole meal; the portion  was quite generous, in my opinion. The crepes (as well as all the trimmings) were really nice — not too thick and not too thin — and I enjoyed the crispy bacon and eggs. It was overall a very decent meal.  But, believe it or not, the star of this show really was the blueberry milkshake; it was so, so GOOD. I’m tempted to say it’s the best I've had but I keep giving this title away! 🙈 Yeah, it was that good. My second visit was Sunday brunch with the girls.  Same as the first time, our group order took about 20 minutes to come out, which isn’t bad. We all got milkshakes (Oreo Overload, Biscoff and Blueberry — I’m sure you can guess which one I ordered), and for our meals, I had the Bacon Butter Burger, while my friends got the Sally’s Chicken Sandwich and Bacon-ish.  We all rated our milkshakes 9/10, super filling, creamy and delicious; my burger, on the other hand, was fair. I appreciated that fresh produce was clearly used and the bun was super soft too, but it just didn’t fully deliver on taste, for me. The Sally’s Sandwich, we all agreed, was absolutely divine. It was a mix of this beautiful shredded chicken and a great sauce, with just the right amount of spice. It came with a side of French fries, which they got just right 👌🏾👌🏾  The customer service here is also pretty decent. The staff were super aware of their menu and everyone was well-behaved. Nothing ruins a good meal/vibe faster than a nasty or lukewarm server, so phew 😅 POSTSCRIPT Crust Cafe has found a friend in me. I’d definitely go back, this time with my laptop. VERDICT ",
    "spendDetails": {
      "itemsBought": [
        { "itemName": "Oreo Overload Milkshake", "itemPrice": "4500" },
        { "itemName": "Blueberry Milkshake", "itemPrice": "5000" },
        { "itemName": "Lotus Biscoff Freakshake", "itemPrice": "5000" },
        { "itemName": "Bacon Butter Burger", "itemPrice": "6800" },
        { "itemName": "Sally’s Chicken Sandwich", "itemPrice": "6000" },
        { "itemName": "Water", "itemPrice": "700" }
      ],
      "totalSpend": 28000
    },
    "link": "https://www.eatdrinklagos.com/review/2022/12/8/review-crust-cafe-lekki",
    "single": true
  },
  {
    "restaurantName": "Maple",
    "restaurantAddress": "9 Otunba Adedoyin Ogungbe Crescent, Lekki Phase I ",
    "restaurantPhoneNumber": " 0913 500 0462",
    "review": " I must admit, this is one review I’ve been holding back on because it was important to me to get it right — so much so that I went to Maple twice.  First things first, you might want to call ahead to book a reservation because both times I visited, it was full to the brim. I went to Maple the first time for breakfast and, in terms of the vibe, it’s a check. The decor is simple, fresh and clean, and I quite like the greenery around the restaurant as well — that always ups the look and feel of a space. After a good look at the menu, I settled on the Creamy Lemon Pancakes and Lychee and Pineapple Smoothie (by the way, what’s with the sudden lychee craze? It’s all over my feed). The pancakes were standard and it could have done with a bit more on the flavour front, but that lemon cream sauce drizzle on it took it to another level. It was the *perfect* balance of sweetness and tanginess; fresh and, to be honest, just the kind of feel-good meal you need at the start of the day or for brunch. I had just that and left very, very happy. I even forgot it came with a side of bacon — that’s how distracted I was with that pancake-drizzle combo. The smoothie, on the other hand, wasn’t as exciting and I still can’t identify why. Maybe another flavour might have worked better, but I’m not crying too hard over that. Now, let’s talk about my follow-up visit for lunch 🔥🔥 Oh boy! The food was so good that I didn’t even get mad at the long 40+ minutes wait time it took to get to me. P.S I don’t know if Maple was just having a slow day, but my feeling is that if you’re not that patient, you might want to try ordering something else. I got the Prawn Pesto Pasta and asked for a sprinkle of chilli flakes, and this meal was *BUSSIN*. The pesto was creamy and tasty, the pasta was well-cooked, and the fresh parmesan on top was the cherry on top. I did that little dance you do when you eat something really top-notch. My guest ordered the Creamy Hot Wings with Maple-Style Fried Rice, which came with a side of corn on the cob and French fries. The wings were so tasty, well done as well. The fries were actually not soggy, which is KEY and tasted good, but the corn on the cob, for me, was the star of the meal. It was buttery and I could taste every single spice they put on it. So delicious. Unfortunately, the Maple fried rice fell a bit flat. The rice was a little bit overcooked and that’s a no-no for fried rice.  For dessert, I went with the Smith’s Vanilla Cake, which confused me a bit because when it came out, it was quite a large chunk of cake. We struggled to finish it because we were so full at this point, but on an emptier stomach, I could have done better justice to this bad boy. It was so good — the cake was moist, I loved the cream around it and the strawberry sauce drizzled over it; truly the perfect way to end our date. Also worthy of note: For a Lagos restaurant, the portions were really fair for the price point.  For cocktails — both of which we enjoyed 👌🏾 — I got the Monalisa and my guest had the X, which came with full senrere and at least, entertained us for a bit. ",
    "spendDetails": {
      "itemsBought": [
        { "itemName": "Creamy Lemon Pancakes", "itemPrice": "7000" },
        { "itemName": "Creamy Hot Wings", "itemPrice": "7000" },
        { "itemName": "Prawn Pesto Pasta", "itemPrice": "12000" },
        { "itemName": "Maple Fried Rice", "itemPrice": "3500" },
        { "itemName": "Lychee and Pineapple Smoothie", "itemPrice": "5000" },
        { "itemName": "Monalisa Cocktail", "itemPrice": "7000" },
        { "itemName": "Bacon & Maple Cocktail", "itemPrice": "7000" },
        { "itemName": "Smith’s Vanilla Cake", "itemPrice": "7000" }
      ],
      "totalSpend": 55500
    },
    "link": "https://www.eatdrinklagos.com/review/2022/11/9/review-maple-restaurant-lekki",
    "single": false
  },
  {
    "restaurantName": "Ohuru by HSE",
    "restaurantAddress": "7 Prince Samuel Adedoyin Street, Lekki ",
    "restaurantPhoneNumber": " 08161410578",
    "review": " In the quest for a Lagos rooftop experience, Ohuru by HSE was one place that stood out to me. OR maybe I just liked that it sounded like ‘Uhuru’, the South African music group we all really used to dig (cue in Khona 🎵). Whatever the case, my friend and I were headed there for a chance to experience the real Afro-fusion cuisine experience.  I have to say: Getting to Ohuru is a bit confusing. We thought our Uber was carrying us go where we no know, because he drove us into what seemed like a residential block in a gated estate. From there, we were directed to the fourth floor of a building that turned out to be a luxury hotel called Boardroom Apartments. It’s not that unusual to have a restaurant located inside a hotel, but I guess it was just a little confusing because there was no mention of it on their Instagram or Google Maps profile. Of course, the ‘luxury hotel’ location meant that we were in for something boujee. It especially felt that way when we got to the top floor and the elevator door revealed Ohuru’s neon lights in the dark, cold hallway. Isn’t it giving?? We stepped into the restaurant which was thankfully warmer; I was getting worried I would regret not wearing thicker clothes. The restaurant’s outdoor sitting had a rustic theme, while the indoor sitting had a more contemporary theme, with the murals adding a pop of colour. Plus, kudos to whoever curated the playlist going in the background because the song choices were a certified vibe; old school jams mixed with new school bangers and a very good amount of Amapiano — perhaps a nod off to their South African-sounding name, or am I just reaching? 😂 The restaurant wasn’t at all full when we got there, so we just picked our table ourselves. The server waited for us to settle in before letting us know it was a QR code-menu situation. Orders in, and it took about 10 minutes to get our cocktails, alongside a plate of complimentary groundnuts and cashew nuts.  My On the Beat cocktail came looking much more plain than its name, while my friend’s Passion Daze came in a ‘screaming’ cup (wondering what I mean? Lol all will be revealed soon). I wonder why they didn’t just stick with the over-the-top presentation for my cocktail too — I know my envy is showing, but I have a point.  The On the Beat was a rum-based cocktail with strawberry, guava syrup and cranberry juice, and I could taste every single ingredient, which was delightful. It was flavourful and the alcohol was HITTING (unlike that cocktail-cosplaying mocktail I had at Indigo). Ironically, I usually like my cocktails with just a tinge of alcohol — and the alcohol content in this was no ‘tinge’ — but it worked regardless. I was very pleased and it was a good distraction from how long the food was taking to get served. Do restaurants maybe do this intentionally? 👀 The Passion Daze was a tequila-based cocktail with passionfruit and lime with fizz, but really it was more alcohol than anything else. I barely tasted the passionfruit, but there was a hint of lime in it. My friend could only really down it when the ice was melted and it was more diluted, so this would definitely not be a good choice for people who like light cocktails. Another 10 minutes later, our starter — smoked chicken croquettes — arrived. They were simply divine; totally melted in my mouth. The chilli mayo and potato blended so well together that they tasted like a single ingredient, and the crunchy exterior gave a very nice contrast to the creamy texture of the interior. The chicken bits were also a delicious addition. It took an hour in total and 30 minutes after we finished our starter for the main courses to be served — which I just found unthinkable. I had the Smoked Goat Asun Fried Rice, while my friend had the Braised Tozo Steak. What did they do — leave to buy the goat and cow from Ogun State just after we placed our order? In my opinion, these are simple enough meals that shouldn’t have taken that long to get to us. It gets a little worse. The texture of my fried rice was nowhere near what fried rice was supposed to be; it was quite soggy. The ‘Asun’ part of the name also seemed like a mere suggestion because the little goat meat pieces did not taste like Asun at all. They were way too soft, so it didn’t even feel like I was eating meat; maybe some people like their meat like that, but I was not a fan in the slightest. I did appreciate the taste and spiciness of the meal though; it was spicy, but not Yoruba-mother level, so that was a good touch. If we’re looking for a silver lining, I guess… The Braised Tozo Steak came with yaji gravy, pickled carrots and a side of mashed potatoes with butternut squash. The steak was medium-well and tasted really good. The butternut squash-infused mashed potatoes came looking like well moulded yellow eba, I’m not going to lie 😂 Although the butternut squash definitely added colour to the mash, the intended sweetness just didn’t come through; it just tasted like plain old mashed potatoes. Plus, the pickled carrots were painfully salty.  As for the yaji gravy, I couldn’t pinpoint why exactly it didn’t work, but I just felt it wasn’t a good fit for the mashed potatoes. My friend felt the same way and ended up taking the rest of her meal home without the gravy. Once the server confirmed I was ready, it didn’t take long at all for the dessert to arrive. I had ordered the Kuli Kuli Fudgy Brownie, which was one of the only two dessert options. The other was strawberry cheesecake and I’m not a fan of cheesecake, so it was an easy pass. P.S. I know some of you are ready to crucify me for this, but I think you should actually look inwards and ask yourself why you like that wannabe cake. This dessert was exquisite. The brownie was sweet and perfectly moist, while the melting ice cream gave a great balance to the warmth of the brownie. I also loved the subtle but delicious touch of the kuli kuli sprinkles and the caramel drizzle.  How YUM. POSTSCRIPT It had its serious low points but Ohuru will be seeing me again. I just won’t be having the Asun Fried Rice. VERDICT  Oyinda is a writer and lover of knowledge. When she's not reading random stuff on the internet, or putting finger to keyboard, you'll find her chopping the life of her head.",
    "spendDetails": { "itemsBought": [], "totalSpend": 33900 },
    "link": "https://www.eatdrinklagos.com/review/2022/11/3/review-ohuru"
  },
  {
    "restaurantName": "Norma ",
    "restaurantAddress": "6 Kafi Street, Alausa, Ikeja ",
    "restaurantPhoneNumber": " 0808 025 9059",
    "review": " As soon as I stumbled on Norma’s Instagram, I knew this was a place for me. A variety of suya options in a proper dine-in type setting, without lowkey dreading the conditions the suya was made in? Sign me up, boo. Before Norma, I had tried suya from higher-end restaurants but it never met up to expectations was absolute trash; a clear warning that street food is meant to come from the street. But Norma’s price range was moderate and suya was their main thing, not just a lone item on the menu, so my hopes were high. A friend and I popped into their spot at Magodo because it was closest to us, after which we realised all the sitting space they had was a bench across the grill setup, which was literally by the road. Cars honking as they drove by. Exhuast fumes mixing with beef suya was definitely not what we had in mind, so we headed to their Ikeja branch.  The Ikeja branch looked just as beautiful “in person”. It was empty when we got there, so we picked our seats ourselves. The tables had Jenga blocks, which innovatively doubled as decoration and entertainment. There was a bar right behind us, so their old-school music and rather interesting karaoke renditions provided a good ambience for most of our stay. We got settled, ordered drinks — Zobo and Kunu Aya — fairly quickly (as we had the whole ride from Magodo to Ikeja to study the menu) and within about 30 minutes, the food started rolling in. We ordered bacon, yam fries, sweet potato fries, masa, their Suya Cheese Melt, Jumbo Shrimp Suya (got pretty excited about this) and beef suya. A loaded table for a couple of hungry gals. I’ll start with the Jumbo Shrimp Suya, because your curiosity may have piqued there.  Two words: Delicious, yet overpriced.  That’s three words, but whatever.  I ordered the 2-piece serving even though the price put me off a bit, but at least, I’m thinking this shrimp must be as big as fish at least abi? That was not the case. The Jumbo did not jumbo at all. I was literally shocked when she served it on the table. Like esscuse ma, more is coming abi? I managed to put my shock aside and took a bite — which is literally all it takes for one shrimp to go. Like I said, it was delicious. The spices really went *in*; it was so juicy and the texture was just perfect. I would’ve ordered more, but I needed to respect my pocket and myself, because that price? Yeah, I’m not letting it go. Another interesting thing on the menu was the Suya Cheese Melt - a toasted sandwich with suya and cheese. It tasted really good, but my friend made a comment that it could have used some more cheese. I, on the other hand, was very okay with the amount of cheese because I get tired of cheesy food quickly. So, let’s leave room for a little subjectivity here. To the masa, I got pretty excited about this because it reminded me of growing up in Abuja. Masa being sold alongside suya was pretty much a fixture, but I had never even seen masa in Lagos. (Note: I’m aware suya guys sell masa in Lagos, I’d just never had any, before you people come for me 😂)  At just N300 per serving, it was cheaper than I thought and even though the server had already taken our order, I almost chased her down to add the masa to our spread. Unfortunately, my excitement was a bit tanked because I thought the masa was over-fried. It was too crunchy on the outside, but, in all fairness, the texture on the inside was perfect and it did taste like it was supposed to. A little less time spent in hot oil would have been the icing on the cake. Meanwhile, the beef suya tasted as good as it could, considering it had two key ingredients missing: newspaper wrap and moonlight.  Side note: When we left, we bought beef suya from a suya guy who was ironically right in front of Norma and it was perfect and also three times less expensive. The yam and sweet potato fries were perfectly crispy, and the yaji (suya pepper) added a nice kick to the taste. I also appreciated that they didn’t taste like they were drenched in oil. They were served with a tasty pepper sauce. The bacon, on the flip side, was a sore mistake. Immediately I picked one piece up, I knew they got it wrong because it was so hard that I could stone someone with it. It was heavy on the chewy and not ‘giving’ on taste. The Kunu Aya (tiger nut milk) was fresh and tasty (wouldn’t have minded a bit more sugar though), bu the Zobo was too sharp and not sweet enough. It could have used a little less ginger to cut down on the sharpness. For the price, as well, I was definitely expecting more flavour than I got. I ordered chicken wings as an afterthought and boy, was I glad I did because they were good 👏🏾 Norma really snapped with it. All the spices were hitting and it was so succulent. The sauce that came alongside wasn’t overdone and the sprinkle of yaji on top perfectly tied up all the spices. The wings ended up dethroning the Jumbo Shrimp Suya as my favourite item on the menu — well, favourite thing from what we had ordered. Oyinda is a writer and lover of knowledge. When she's not reading random stuff on the internet, or putting finger to keyboard, you'll find her chopping the life of her head. POSTSCRIPT Mixed feelings, but I’d definitely go back for the wings and shrimp suya. I’m better off getting my beef suya by the roadside.  VERDICT ",
    "spendDetails": { "itemsBought": [], "totalSpend": 17200 },
    "link": "https://www.eatdrinklagos.com/review/2022/11/2/review-norma-ikeja"
  },
  {
    "restaurantName": "Indigo Bar Restaurant & Suite",
    "restaurantAddress": "242B Muri Okunola Street, Victoria Island ",
    "restaurantPhoneNumber": " 01-2701880",
    "review": " My birthday was coming up and my best friend decided the best way to celebrate it was a dinner date with good food and good vibes. No argument was welcome or even necessary, for that matter. Also, I thought this would be the best time to satisfy my Indian food craving, so we decided on Indigo, an Indian/Chinese/Nigerian restaurant and bar in VI. The thing is my Indian food tolerance wasn’t the widest. I spent 3 years of my life in Dubai — a city with a very prominent Indian presence and culture — so I have tried enough food to know I have a bit of a half-half appreciation for this cuisine. Choosing Indigo was really just me chasing nostalgia and hoping my expectations would not be tanked. PRO TIP:  Do your best food experimentation when someone else is paying. Why? You can easily let go of any disappointment because it’s not on your own tab 👍🏾 The exterior of the restaurant had a lot going on, but in a good way. It was sort of jungle/garden-themed, which doesn’t necessarily have anything to do with Indian food, but made for good pictures – especially the angel wings mural. I wasn’t complaining. Despite the decor, the ambience outside wasn’t great; there was no music, just white noise in the background. It’s a weird vibe, if you ask me; outdoor dining *demands* something nice playing in the backgroud. I ordered Aloo Paratha for my starter – it’s actually a side, but it works as a starter too. It took about 10 minutes to get served, which is not too long a wait. Unfortunately, I was disappointed by the taste of the stuffing and the crunchiness of the bread, and ended up not eating most of it.  I later learnt that this was actually not the paratha I knew and loved. What I was used to in Dubai was Malabar Paratha, which is a bit chewy texture and has no stuffing. I ordered Butter Naan, which took another 15 minutes to get to me, to compensate. This one was definitely more to my taste than the Aloo Paratha, it’s only a shame it was just a bit bland-tasting. Nonetheless, it was good and the texture was perfect. You can never really go wrong with naan. My friend told the waiter it was my birthday and asked if they had any birthday specials. He said it depended on how much our total bill was, which I thought was rather interesting 👀 After he confirmed our bill was high enough, he invited us inside because apparently the birthday setup could not be done outside. The interior of the restaurant was simpler, with a family-style dining theme and a bit more Indian culture represented in the décor. Also, there was music! (FINALLY) So, a plus for the ambience.  Our cocktails and main courses came shortly after we settled in. In total, it took about 30 minutes for the main courses to be served. The server had asked us earlier on if we wanted our drinks to start or to accompany our meals. I particularly thought that was a thoughtful ask because it’s annoying when my drink is finished long before the food is ready. In the absence of my go-to cocktail, Sex on the Beach, I had a Kiss Me Quick which was delicious but rather low on alcohol. That might be a plus for some people, but I like to taste the tinge of alcohol in my cocktails (I was literally trying to figure out if I mistakenly ordered a mocktail). My friend ordered a coconut martini, which was also delicious with low alcohol content. Are they trying to cut costs or something, or was the bartender trying to make cocktails that weren’t too strong because we seemed like we couldn’t handle it? Me, I don’t know o but I needed more! Now, to the main! I had Butter Chicken as my curry, Jeera Rice and Chicken Lollipops, and it was all excellently done 👌🏾 It definitely took me back to Dubai — sweet memories of enjoying Indian food with my Indian friends during my uni days. The butter chicken was the right level of buttery, and the chicken pieces melted in my mouth. The chicken lollipops were succulent and well-spiced.  The butter chicken was enough for my friend and I, and then some, so we had to have the rest bagged up (we also shared the chicken lollipops). I did think the jeera rice was a bit overpriced though. N2800 for a moderate-sized portion of just cumin-infused basmati rice? Don’t play with me. After we had our meals, the waiter brought in my birthday brownie (on the house, by the way), accompanied by a Happy Birthday song playing from the speakers and bubbles blowing at me. To be honest, it was all really cute but when the bubbles started landing on my brownie, I knew I’d had enough 😆 Also, the birthday song was playing for almost 2 minutes and there was an awkward moment where it was like: Okayyy… can I blow my candle and eat now?  Thankfully, the waiter caught on before it got too awkward. The brownie was scrumptious, with the perfect texture — a bit crunchy on the outside, but fudgy on the inside. I also ordered chocolate ice cream that, thankfully, didn’t taste like Fan Ice (unlike what befell me at Alice Garden). My friend ordered fried ice cream, which was basically fried coconut dough wrapped around a ball of vanilla ice cream. I think this should be an 8th wonder of the world because I have no idea how they pulled that off 😂 I’m not the biggest fan of coconut-flavoured things, so I didn’t dig it but my friend loved it. The bill came with a short review survey, which I thought was great for quality control purposes. The only downside (which was a real 👎🏾👎🏾) to that was that the — I suspect — owner came to meet me outside to ask me to elaborate on my comment about my disappointment with the naan and paratha. He was a bit pushy about it, which is a big no-no; I just wanted to drop the review and dip, and I should have been allowed that grace.  P.S. It’s not like he chased after me o, I just happened to be outside taking photos as we were getting set to leave. But seriously, it could have been avoided or he could have been more gentle?  All-in-all, I had a good time and free delicious food, so nothing spoil. I also liked the customer service.  Oyinda is a writer and lover of knowledge. When she's not reading random stuff on the internet, or putting finger to keyboard, you'll find her chopping the life of her head.",
    "spendDetails": { "itemsBought": [], "totalSpend": 18000 },
    "link": "https://www.eatdrinklagos.com/review/2022/10/18/review-indigo-victoria-island",
    "single": true
  },
  {
    "restaurantName": "Orile",
    "restaurantAddress": "2 Ichie Chris Street, off Abeke Animashaun, Lekki Phase I ",
    "restaurantPhoneNumber": " 0913 680 0000",
    "review": " This particular restaurant has been on my list because so many of y’all have asked for a review, and also I had heard a few decent things about Orile. When the timing was right, I finally did what needed to be done. From the entrance, I felt quite welcomed — everyone from the parking assistant to the security was super helpful. Was it for a tip at the end of the night or just a result of proper staff training? No idea, but I sha had a pleasant experience with Orile’s staff, which is, unfortunately, something that’s *super* worth mentioning in Lagos. For a change, I visited here at noon and chose to sit indoors, but I couldn’t help but notice their nice outdoor setup with full bar service. It was giving an evening chills with soft music vibe. The first thing I noticed about the indoor space is it looks like a modernised buka to me (maybe that’s not the look they were going for and zero shade intended, but that’s the general feeling I got 😄). It’s a very clean space, nothing too dramatic in terms of decor and aesthetic. They have photos of Nigerian icons, like Onyeka Onwenu and Chinua Achebe, hanging on the walls and some simple plants around the space, for look and feel, and I thought it all came together really nicely.  A simple but important thing: I love how their menu is really explanatory and easy to understand. The menu items are written in Yoruba, but everything that makes up the meal is laid out for anyone to easily understand, whether or not you speak the language — which I think is very important. I was offered peanuts while I waited on my main order of Alata Sue Sue and Ram Rolls & Puff Puff. On the side, I had an easy chapman and a bottle of water because me and expensive cocktails are on break, but you guys, wait… when did we start paying anything more than N2k for chapman?  (See damage below)  What is actually going on? Mocktails should not cost more than 2k. Anything over is absurd for a Chapman variant. — Eat.Drink.Lagos (@EatDrinkLagos) September 25, 2022 My meal came out in 30 minutes. The Alata Sue Sue was made up of Jollof rice, peppered guinea fowl and plantain, and just about 5 minutes later, the Ram Roll & Puff Puff came with a pepper sauce on the side.  This is where disappointment started. I tasted my Jollof and unfortunately, it didn’t at all meet up to expectations. My mind was already prepared for perfect party Jollof, and although it was smoky, the flavours just weren’t hitting. HOWEVER, the guinea fowl was a hittt 👏🏾👏🏾  Seasoned so well and didn’t knock my teeth out as well when I bit into it, which is keyyyy (side-eyeing the chefs at Avant Garde by Soul Chow right now). Props to Orile for this. The meal portion was also noticeably generous. I eventually had to have the rest of my food packed up and I’m currently chopping life, typing with one hand and caressing proper guinea fowl in the other. It’s weird that I talk about a starter after the main meal, but in my opinion, these rolls and puff puff were a whole meal on their own — another generous portion! The puff puff was super fluffy and yum, hitting all the right notes, but the real star of this day were the ram rolls. You might be a little confused about what this actually is, understandably so. So instead of spring rolls, it’s little rolls of ram meat.  It’s literally one of the most delicious things I’ve eaten lately. The pastry was crispy and crunchy, but the filling was even better — well-seasoned ram meat with a hint of spice as well. I really enjoyed it.  Seeing as I was pretty stuffed and the only dessert option was more puff puff and apparently homemade vanilla ice cream, I decided to skip the sweet finish. On another visit though, I would consider trying it and would also want to try some other speciality drinks from the menu, like Sweet Sensation or Love Position. If only for the names alone.  ",
    "spendDetails": {
      "itemsBought": [
        { "itemName": "Alata Sue Sue & Guinea Fowl", "itemPrice": "8500" },
        { "itemName": "Ram Roll & Puff Puff", "itemPrice": "6000" },
        { "itemName": "Chapman", "itemPrice": "4500" },
        { "itemName": "Water", "itemPrice": "1000" },
        { "itemName": "Takeaway Container", "itemPrice": "2000 (for 2 packs)" }
      ],
      "totalSpend": 20000
    },
    "link": "https://www.eatdrinklagos.com/review/2022/10/11/review-orile-lekki",
    "single": true
  },
  {
    "restaurantName": "Kaly Restaurant & Bar Lounge",
    "restaurantAddress": "7th Floor, 1235B Akin Adesola off Ahmadu Bello Way, Victoria Island ",
    "restaurantPhoneNumber": " 0809 205 5555",
    "review": " Kaly told my friends that if they want to reserve a table for 10, they need to commit to spending 50k per person. Also, they were expected to make full payment or half payment upfront.  Lagos restaurants are going mental and I don’t plan to entertain them. — La Donna Ricca (@Jenn_nikolas) March 11, 2022 You people will go to Kaly and Slice Lagos fully aware of their ridiculous menu price only to come and cry on Twitter. Carry go mummy. Our lobster spaghetti must sell biko🥰. — chisom• (@chisomagbodike) May 16, 2022 Lagos restaurants kill me. Made a reservation at Kaly and they sent confirmation. The last sentence says “entry is at the management discretion”. 😂😂😂 pic.twitter.com/01RikYuHQr — Bos (@_bosman) March 25, 2022 But, naturally, we still had to do check out Kaly and do our due diligence because you never know, right? A few nights ago, I decided it was finally time to see what the hullaballoo was all about and made a reservation. Expectations were naturally a bit hmmm, but I was prepared to give the restaurant a fair trial. First impressions: This is niceeeee. I paused at the entrance to take photos, first off, because na my money, and I needed to get full value for it. Plus, I believe every vain person in Lagos who has dined here has a pic under that their signage. It’s what you do 😌 My guest and I got settled in and a very pleasant waiter came over to attend to us, took off to get us the menu and during that short period, a complimentary starter of warm bread and tomato sauce was served. The bread was hot, I was hungry, I polished it off, and as far as complimentary bread goes, it understood the assignment. It took about 15 minutes for our starters to come. I got the Fritto Misto and my guest had the Chicken Salad, and we LOVED both. I appreciated that their Fritto Misto didn’t just have calamari alone, but shrimps and prawns as well. The dip for the Fritto was also tangy in the right way and complemented the seafood quite beautifully. As for the chicken salad, the microgreens in it were fresh – which should be a given, but, guy, this is Lagos, make I no talk – but the dressing was really the star of the show. I loved how creamy and flavourful it was, and I kept wondering whether it was made in-house or gotten off a shelf, cos I need me somma that. The chicken was really tasty, as well; you can tell it was marinated properly, with the right spices, because every mouthful was really good. A weird little thing: The salad had dates in it, which I had never experienced, but loved and now, I'm considering adding dates to all my salads 🙈 Let me tell you, we cleared every single thing on the plate 😂 The starters at Kaly are quality. We waited another 15 minutes and our mains came. I got the Spicy Sea Bass, with a side of mashed potatoes and South African Rib Eye Steak, with the Kaly Fried Rice with Shrimp.  As nice as the names sound is as nice as the meals were. The steak was medium well-done, and it was so juicy and tender. I appreciated them putting pink Himalayan salt on the side for me to jazz up the meat; it definitely elevated the meal. The peppercorn sauce for the steak was GOOD and that is KEY. Nothing worse than a wack peppercorn sauce!  As for the Spicy Sea Bass, it came nice and deboned, which made me feel like I really got my money’s worth because I didn’t need to do it myself. Now, when it comes to spiciness, I can handle a little heat but I don’t like when it’s overwhelming. This fish was done perfectly, and had just the right balance of flavours. I got potato mash as a side for the sea bass, and it was the creamiest, fluffiest mash, although, I enjoyed it better with the steak.  The only thing I wasn't a fan of was the Kaly Fried Rice. Fact is it was pretty standard stir-fried rice with shrimp on it. It didn't particularly stand out or have any identifiable flavours, which was a bit of a shame. But considering how well the rest of the main (and starters too) had gone, I had to give them a free pass here.  Shout out to the drinks as well – they were really good and the bartender definitely knows what they’re doing. The servers recommended the Temptation cocktail for me, which was worth every sip (I even got another!). We also got the Kaly’s Kiss and Original Sin (Camera Shy) – again, both top-notch cocktails 👌🏾 At this point, I was too full to even try out dessert, but I lowkey had my eye on the Mascarpone Cheesecake. You know now, normal 😉 POSTSCRIPT Bottom line: I get it, Kaly is an expensive place to eat, but do they serve great food? Absolutely. I’ll definitely be back. VERDICT ",
    "spendDetails": {
      "itemsBought": [
        { "itemName": "Chicken Salad", "itemPrice": "9500" },
        { "itemName": "Fritto Misto", "itemPrice": "12000" },
        { "itemName": "Spicy Sea Bass", "itemPrice": "21000" },
        { "itemName": "South African Rib Eye Steak", "itemPrice": "31500" },
        { "itemName": "Kaly Fried Rice with Shrimp", "itemPrice": "4000" },
        { "itemName": "Temptation", "itemPrice": "7500" },
        { "itemName": "Kaly’s Kiss", "itemPrice": "7500" },
        { "itemName": "Original Sin (Camera Shy)", "itemPrice": "6000" }
      ],
      "totalSpend": 99000
    },
    "link": "https://www.eatdrinklagos.com/review/2022/9/13/review-kaly-victoria-island",
    "single": false
  },
  {
    "restaurantName": "Avant Garde by Soul Chow",
    "restaurantAddress": "1 Polo Road, Ikoyi ",
    "restaurantPhoneNumber": " 0809 041 5471",
    "review": " This space makes me think of the club set for a Nollywood movie. I half expected Genevieve and Omotola to come out of a corner with flipped spiky bobs, black liner on their lips and start grooving to Plantashun Boyz. Don’t ask me questions, just go there and see for yourself 😂 I understand that Avant Garde by Soul Chow was going for a super Nigerian vibe and honestly they hit it. It was very Nigerian, from the golden “bronze” mask on the walls. to the somehow new but already chipped furniture. They also had lyrics from the National Anthem cemented in gold letters on the wall, which I thought was a cool touch. Ngl, I did not have the greatest hopes for this spot. Maybe it had a little something to do with the fact that as I tried to enter the restaurant, the security asked me “What are you looking for here?”  Sir?! I’m here looking for crack. Are you not a restaurant??? 🤦🏽‍♀️🤦🏽‍♀️ Having convinced him that I was indeed here to eat and not procure human remains, he allowed me in and fortunately, the rest of the staff were delightful.  As soon as I walked in they were super attentive, possibly because I was the only person in the restaurant, but still. I got the New London to start, basically a gin and tonic with grapefruit and elderflower syrup. If you know me, that’s my go-to drink and, to their credit, it was delightful! The gin came through, just enough tartness from the grapefruit and a perfect amount of elderflower, enough to be noticed but not enough to be sickly sweet.  My guest arrived and got a Porn Star martini, which was also fantastic and well-balanced. I’ve found that when Lagos bartenders make Porn Star martinis, they are usually way too heavy-handed with the passionfruit syrup, but whoever the bartender at Avant Garde is knows how to balance a cocktail. Someone should steal him, *cough* *cough* Atmosphere *cough* 👀 Our server was super knowledgeable about the menu (a big PLUS) and managed to upsell us on the Lemon Coriander Mixed Root Medley. She insisted that we would love it. We told her if we didn’t, she would have to give us her hoop earrings and ladies, gentlemen and all others, this lady still has her earrings.  It was essentially sweet and Irish potatoes and I believe yam, boiled and fried to perfection. There was nary a lemon flavour to be tasted but damn were these some perfectly cooked root vegetables. They were very more-ish. I would serve these as bar snacks and just add small pepper, so people keep ordering drinks. If you go here, get these. We got the Gidi Green Chili Prawns. They were prawns. I really tried to write something about them but, honestly, they were just cooked prawns; nothing stood out about the seasoning or preparation. Although, worthy of note: They weren’t overcooked, so that’s a plus. We actually chose this spot because they posted a Soul Chow Whole Smoked Guinea Fowl on their Instagram and we were like “GIVE IT TO ME!!” So, obviously, it was the first thing we ordered. *INSERT HOT BITTER TEARS* It was so tough, it was inedible. I managed to get a bite of the breast in my mouth and spent five minutes chewing and damn near died swallowing it. I gave up and graciously let my guest take the rest home for her cook to boil again. I cannot speak to the flavour, because it genuinely had none. Maybe a vague peppered quality? But I was too busy trying not to choke to take note. Off the success of her root medley, we let the server suggest one more item and she offered the Spicy Beef Meatballs. BELOVED!!! I mean meatballs are meatballs, right? No one ever craves meatballs, aside from blond-haired white boys in American feem right? When I tell you I have thought about these meatballs once a week since I had them, I tell zero lies! They were soft, perfectly seasoned and spicy enough to make the Yoruba babe in me sing for joy… and did I mention they were soft? Like biting into spicy meat clouds.  Of course, we let the servers pick our last drinks. My guest got Between the Soul Sheets and I got The Pager. Like I said earlier, someone needs to steal this bartender cause both drinks were so good! It was when the bill came that I realised their cocktails are N7000 - N8500. How won’t they be good?! At N8500 for a cocktail, I would have fought somebody if they were bad. But they were so good, I didn’t even cry (on the outside anyway, I drank garri for the rest of the week). P.S. I don’t like the name of the place sha (do you??). Just thought I’d mention it in case they care to change it 🤷🏾‍♀️ POSTSCRIPT All in all, would I go back? For drinks, those meatballs and that root medley? Hell yes! VERDICT  Cordon Bleu trained chef, Chef Imoteda is the founder of Heels in the Kitchen and co-owner of Eko Street Eat, a company that specialises in bringing innovative twists to Nigerian street food. She is currently the head chef at SK COOKKS, a Nigerian restaurant in downtown Toronto",
    "spendDetails": {
      "itemsBought": [
        {
          "itemName": "Soul Chow Whole Smoked Guinea Fowl",
          "itemPrice": "14000"
        },
        { "itemName": "Spicy Beef Meatballs", "itemPrice": "9000" },
        { "itemName": "Gidi Green Chili Prawns", "itemPrice": "14000" },
        {
          "itemName": "Lemon Coriander Mixed Root Medley",
          "itemPrice": "2500"
        },
        { "itemName": "Between the Soul Sheets", "itemPrice": "7000" },
        { "itemName": "Porn Star Martini", "itemPrice": "8500" },
        { "itemName": "New London", "itemPrice": "8500" },
        { "itemName": "The Pager", "itemPrice": "8500" }
      ],
      "totalSpend": 72000
    },
    "link": "https://www.eatdrinklagos.com/review/2022/9/8/review-avant-garde-by-soul-chow-ikoyi",
    "single": false
  },
  {
    "restaurantName": "Afefeyeye Restaurant",
    "restaurantAddress": "41 Ogundana Street, Allen Avenue, Ikeja ",
    "restaurantPhoneNumber": " 0908 755 5504",
    "review": " A friend of mine shared a Twitter thread on the most affordable restaurants on the Mainland on one of my many WhatsApp groups — a list of about seven restaurants or so — and, for some reason, Afefeyeye Restaurant and Bar caught my attention. Maybe it’s because it’s the first name on the list? Was it the name of the restaurant that stood out? Or was I just curious about what kind of restaurant in Lagos goes all out with the interior and doesn’t try to rob you blind? In hindsight, it was probably a combination of all three reasons (a big fourth also being that it’s owned by Nollywood icon, Kunle Afolayan, just in case you somehow don’t know this 🥴). The following week, my friend and I made a ‘work-and-relax’ (we should all do this more often, btw) visit to Afefeyeye, and naturally, it’s an experience I think is worth sharing. Here’s what I believe this spot really has going for it. First thing is the atmosphere. Have you ever heard the term, ‘sense of place’? It means both the specific details in a place that make it what it is, and the exact feeling you get from being in such a place. Is that confusing? Lol let me explain. As we stepped into the KAP Hub, the space that houses Afefeyeye, I immediately felt a bond with the setting. It felt comforting and familiar. Somewhere I would naturally be. But let’s not over-deep it, you get the gist. The African theme of the restaurant was giving and overall, I loved the art, music (yay, a live band), the colours and energy of the space. To the food and drinks: My friend and I were quite keen to try out their platters, but for some reason, they weren’t available on the day. A little annoying, I must add. Instead, we started with the Sisi Eko appetiser, which is essentially a plate of spicy boli with pepper sauce, groundnuts and fried fish.  To go with it, we got virgin mojitos and although they came out pretty quickly, it took *a while* for the platter to get to us. It took so long that our drinks were nearly all gone by the time it came. For its price (deets below), I felt the boli was small, and it could have been better cooked. The pepper sauce, on the other hand, was well-seasoned and the perfect match for the plantain; my only issue is it was a bit too spicy. I mean, spiciness is usually quite subjective, but I’d suggest not going for this if you don’t like spicy food.  Now, the fried fish was the thing 🔥 Flaky, tasty and had a nice balance of flavours. It’s what all Naija-style fried fish should try and aspire towards. Afterwards, we moved to the bar upstairs, where we had our main meal — a plate of Babami’s Signature Jollof Rice, an Afefeyeye special. With the fried plantain, asun, dried fish and carrots, the Jollof had just the right amount of heat and slapped at every angle. I was a very happy guy. I wasn’t going to leave without tasting the sexy-looking goat meat I had seen online, so I ordered a bowl of asun with a Sex on the Beach. This is another spicy meal you should avoid if you don’t like ‘hot’ food, but I enjoyed every bit of it. It was a solid 10 and N2200 well spent. There’s also attention to detail when it comes to presentation, service and delivery. During our time at Afefeyeye, I noticed how staff were dressed to match with the theme of the place. In the lounge (the Enkunle Bar), the restaurant and other areas, the servers wore kembe, which I loved and felt added authenticity to the whole experience. Aside from having to wait a little longer than usual for our meals, the servers here were informed and professional. You could see how well they understood the menu (most likely helps that it’s indigenous food, if we’re being honest) and what Afefeyeye stands for. They were also generally quite attentive to our needs 👌🏾 Also, I got the chance to take pictures with Kunle Afolayan, which is a nice little plus to top things off. POSTSCRIPT I’d definitely go to Afefeyeye again, but maybe next time, with more friends and hopefully, have less wait time. VERDICT  When Israel isn’t at a desk w̶r̶i̶t̶i̶n̶g̶ having fun, he’s outside having some more fun. He loves Lagos, simply because it’s Lagos and the buzz never stops, and he could never turn down an opportunity to write about the city’s wonders.",
    "spendDetails": {
      "itemsBought": [
        { "itemName": "Sisi Eko", "itemPrice": "3500" },
        { "itemName": "Babami Signature Jollof Rice", "itemPrice": "3500" },
        { "itemName": "Asun", "itemPrice": "2200" },
        { "itemName": "Virgin Mojito", "itemPrice": "2500" },
        { "itemName": "Sex on the Beach", "itemPrice": "3000 " },
        { "itemName": "Water", "itemPrice": "500 " }
      ],
      "totalSpend": 15200
    },
    "link": "https://www.eatdrinklagos.com/review/2022/9/6/review-afefeyeye-ikeja",
    "single": false
  },
  {
    "restaurantName": "The Shed",
    "restaurantAddress": "1 Wole Olateju Crescent, off Admiralty Way, Lekki Phase 1",
    "restaurantPhoneNumber": "0904 004 4436",
    "review": "I recommend calling to reserve before showing up(Very important). Ambience-wise, The Shed understood the assignment. The space is bursting with colour, there’s lovely art hanging on the walls and the music wasn’t overpowering like it is at some restaurants. I could actually hear myself speak and that is always nice. To the food: We got complimentary starters 🎉. It was these two tiny pies with minced meat filling and a tomato-based dipping sauce on the side. It was so good, I forgot myself and didn’t even get a photo 😭😭. I was halfway done before I even realised, but I loved it and it got me excited about the mains. I ordered the Crusted Salmon served with linguine in a cream base. First, let me acknowledge that the plating was hitting hard, so I was already quite keen on the food. As for the meal itself, the pasta was the right texture and full of flavour; I was tasting all the herbs used and it proper made me feel jiggy.  The salmon was very well done, with crispy skin (the way it should always be done, don’t argue with me) and as a whole meal, it came together. The portion size was also good value for my coins. I proceeded to get the Duck Breast with Crunchy Potato Purée. I love duck, but I always say how easy it is to mess up, like the one I had here 👀.  Again, the presentation was beautiful and thankfully, what was on the actual plate didn’t disappoint. The duck was beautifully tender and tasted great. I also loved how easy it was to cut it into mouthful sizes.  The orange sauce on the side gave it that nice citrus burst and elevated the taste of the meat. Even if you’re not a meat-with-fruit kind of person, I recommend at least trying it; it was delicious. I wasn’t quite a fan of the crunchy potato purée, though; I’d have loved to stick to regular mashed potatoes, which everyone knows I love. For drinks, I had the Berry Watermelon Crush and Passion Fruit Delight, both of which were not bad, but not memorable at the same time. Anyway, it did its job, I was hydrated and had something to help the meal go down.  I was a little too stuffed to try any of the desserts, but if the quality is anything like that of their mains, I’m dying to try it next time. Yes… there will be a next time 💯  SUBSCRIBE Sign up with your email address to receive news and updates. SIGN UP We respect your privacy.",
    "spendDetails": {
      "itemsBought": [
        { "itemName": "Crusted Salmon", "itemPrice": "17500" },
        { "itemName": "Duck Breast", "itemPrice": "20900" },
        { "itemName": "Berry Watermelon Crush", "itemPrice": "8500" },
        { "itemName": "Passion Fruit Delight", "itemPrice": "6500" }
      ],
      "totalSpend": 53400
    },
    "single": false,
    "link": "https://www.eatdrinklagos.com/review/2022/8/26/review-the-shed-lekki"
  },
  {
    "restaurantName": "Thai Thai",
    "restaurantAddress": "Flat 3, 16 Kofo Abayomi Street, Victoria Island ",
    "restaurantPhoneNumber": "0909 117 2906",
    "review": " Hopes were had and hopes were high for my Thai Thai experience. The day I visited, I had planned a full solo date day — from getting my nails done, to going to the movies (P.S. I saw Thor: Love and Thunder, and despite what the haters say, I highly recommend it if you love Marvel). Naturally, I wanted to end my day with food, and although I hadn’t made a reservation, which is a requirement here, they were kind enough to let me in any way and find me a spot.That being said, I do recommend you make a reservation because it’s a small space and you don’t want to get there just to be turned away. Fortunately, when I got it in, the waiters were very helpful and kind. In terms of the restaurant space, it was giving the vibe of going to visit a relative or a close friend — it felt very homey. It feels like you never really left your dining room. I liked that I was surrounded by plants and the lights were dim, which maybe doesn’t work great for taking photos, but it was nice in its own way. I had already been through their menu on Instagram (who doesn’t do that, these days?) and had a pretty good idea of what I wanted. For my starter, I ordered the Bao Buns with BBQ pork ribs because that’s always a delicious combo, and this took about 25 minutes to get to me.  The outcome was a little disappointing though and I didn’t enjoy it as much as I thought I would. Even though the bun itself was fresh and quite well done, the BBQ pork filling didn’t taste up to scratch, and I was left wanting more flavour. I felt chicken or prawn might have been a better option in the long run. To drink, I got the OG Goji, which is made out of fresh pineapple juice, Goji berries, cane juice and lemongrass, with honey and lime. It reminded me of the fruit punch a lot of us had as kids — this was really good.  For my main, I had asked the waiter what their best-selling noodles were and he recommended the Drunken Noodels. It’s basically flat rice noodles in a sweet soy and hot basil-based sauce, with veggies. I’ve had this before and I knew what to expect, but again, expectations fell short. It’s time for my signature line 🤣: It just didn’t spark joy in me.  For me, the meal was about a 6/10, and that bothered me because if that’s their best seller, then hmmm 👀 In my opinion, the chefs overdid it on the soy sauce and that affected the dish as a whole. It would have been really nice to see what it tasted like with a bit less of it. Something that did get me excited, though, was what I had for dessert — Thai Thai’s deep fried ice cream. Yup, it’s a thing.  I’d had it once in London, but I’ve been on the lookout for it in Lagos. When it came, it didn’t exactly look like what I was expecting, but it was good 👌🏾 The ice cream tasted homemade and was super creamy, with the sprinkle of cashew nuts on top, just to give it that extra crunch/bite. This was, by far, the best thing I had. Safe to say my overall experience at Thai Thai wasn’t the best. Their prices are very fair and their portions are decent, but I wasn’t close to being blown away by the food. Aside from that deep fried ice cream though 🔥 ",
    "spendDetails": {
      "itemsBought": [
        { "itemName": "OG Goji", "itemPrice": "5500" },
        { "itemName": "Bao Buns with BBQ Pork Ribs", "itemPrice": "6000" },
        { "itemName": "Drunken Noodles", "itemPrice": "6500" },
        { "itemName": "Deep Fried Ice Cream", "itemPrice": "4500" }
      ],
      "totalSpend": 22500
    },
    "link": "https://www.eatdrinklagos.com/review/2022/8/2/review-thai-thai-victoria-island",
    "single": true
  },
  {
    "restaurantName": "Slice",
    "restaurantAddress": "19 Ologun Agbaje Street, Victoria Island ",
    "restaurantPhoneNumber": " 0915 555 4646",
    "review": " Ed Note: We know you’ve been waiting for this. Folks, I’m *in pains* as I write about this experience 😩 It was date night and despite our collective better judgement, I decided it was time to finally give Slice a try, because:  I needed to experience whatever’s actually going on there for myself, and   An official review of this restaurant was long overdue. Slice was slightly empty that evening, but that wasn’t a problem for me. I’ll admit I liked the vibe of the space a lot. There’s this thing where they let you adjust the lighting to your preference — something I’ve never experienced before and a winning idea, in my opinion. The servers were also super attentive and very informed about the menu.  Speaking of the menu,  I already knew what to expect with those prices 👀 . I wanted to give them the benefit of doubt and focus on if the food was any good or if I had to wait a year to get my food.  It took around 35 minutes for the starters we ordered to arrive — the Smoked Escargot and Clams, which is really a fancy title for snails in the most delicious sauce.  A solid 10/10, y’all.  The plating was superb as well.  Ed Note: Please, ignore Tolani’s ugly picture here.  On to the mains, which is where I just began to sweat. I ordered the Duck à l’Orange and Grilled Salmon.  The salmon was a bit meh. It wasn’t bad, but it didn’t stand out either. It leaned more to the bland side than anything else. The sauce that came with it didn’t stand out either.  If you aren’t paying attention, salmon is easy to mess up so I guess I should give them credit for not messing it up. That said, I would have loved to have a lot more flavour. There’s definitely room for improvement. The duck à l’orange took my night from so-so to disappointing. The first thing you’ll notice is that the portion screams child-size; it’s really small for the price, and without even tasting it, I was already furious.  I was hoping for some big flavours here as well because, you know, duck 💘 but it really fell short of expectations.  See ehn, if you’re going to even attempt to include duck on your menu, it needs to be the right combination of tender, moist and a bit fatty. I’m not sure Slice is there yet, with this one. It came with a plantain mash that I loved, but I think the disappointment of the duck tainted the rest of it. I felt like the whole meal just wasn’t coming together. I have to shout out their drinks, though — let’s give credit where credit is due.  I ordered the Mai Tai and Martini Pornstar and they were both yuuum. Maybe we should have skipped the mains and gone straight to the booze? Yeah, that might have been a good plan.  SUBSCRIBE Sign up with your email address to receive news and updates. SIGN UP We respect your privacy.",
    "spendDetails": {
      "itemsBought": [
        { "itemName": "Smoked Escargot & Clams", "itemPrice": "14000" },
        { "itemName": "Duck à L’orange", "itemPrice": "23000" },
        { "itemName": "Grilled Salmon", "itemPrice": "23000" },
        { "itemName": "Mai Tai (1)", "itemPrice": "6000" },
        { "itemName": "Martini Pornstar (1)", "itemPrice": "7000" }
      ],
      "totalSpend": 73000
    },
    "link": "https://www.eatdrinklagos.com/review/2022/7/18/review-slice-victoria-island",
    "single": false
  },
  {
    "restaurantName": "Alice Garden Restaurant",
    "restaurantAddress": "57 Oduduwa Way, Ikeja GRA ",
    "restaurantPhoneNumber": " 0909 709 9999",
    "review": " It was a random Friday; my best friend and I were looking for a non-bank-breaking restaurant to celebrate her birthday. The occasion itself was weeks away, but I don’t like Lagos to catch my pocket off-guard – or “gbe mi l’handicap” – so I like to stay prepared. My friend shared Alice Garden’s (a Chinese/Korean restaurant) profile with me on Instagram. I was immediately a bit sceptical because the account name sounded like some random Lagos mummy called Alice — ‘Alice_Lagos57’. See what I’m saying? Plus, there were so many pictures of people with the restaurant’s (admittedly) gorgeous décor; I could barely find any pictures of food and there was no menu on the page. After some skilled detective work — if I do say so myself — I found some parts of the menu on Google Maps and the pricing seemed decent, like we wanted. Alice Garden was a go 👍🏾 Walking into the restaurant, I was in awe of how beautiful it was; every corner of the space had picturesque décor. I had stepped out of struggle-ridden Lagos into some kind of Eden. The staff were very polite and even helped us take some fire pictures, correct with the angles and everything. The music was great too; they played old-school bops that literally had me karaoke-ing and dancing. BUT no be atmosphere we go chop, abi? I was hoping the food would be equally as enjoyable, if not more. First up, I have to point out that the wait for our meals was quite long – long enough for us to have almost finished our cocktails by the time the food was served. The standard price for their cocktails was about N4000, a bit pricier than cocktails at more casual dine-in restaurants, but not so much that you’d say, “Ahan! What is inside the cocktail sef?” I had a Long Island Iced Tea, while my friend had a Caribbean Punch. The Caribbean Punch was flavourful with just the right tinge of alcohol — made me regret ordering my Long Island, which was just okay*.  (*To be honest, I had never had a Long Island Ice Tea before then, so I didn’t have anything to compare it to. My go-to cocktail is Sex on the Beach, but they didn’t have that so I just picked anything on the menu.) About the menu… something weird happened. The servers said I wasn’t allowed to take pictures of it, which made me realise that they intentionally didn’t share their menu online. Why though? 💀 Like, they don’t want people to know what they’re getting into? Anyway, the food finally arrived and thankfully, they were big portions. I had the Shanghai-Style Fried Noodles, which I found a bit underwhelming. The spices weren’t hitting right and I could taste more veggies than noodles. My friend’s Fried Rice with Shrimps tasted exactly like it was supposed to. They weren’t stingy with the shrimps and the meal tasted like standard Chinese fried rice. Again, I slightly regretted my choice, but such is life. We decided to satisfy our sweet tooths with a little ice cream for dessert and boy, was it disappointing! They served us two small scoops of — what I think was — Fan Ice cream and charged us N1k 😳 The lack of options was also disappointing; they had just vanilla and strawberry flavours. But, true to the Alice Garden Restaurant theme, the presentation was cute. That counts for something? I’m not sure. Now, it would basically be a crime to visit a Chinese restaurant without having some Bubble Tea, and we’re not criminals, so we indulged. Their Galaxy Milk Tea with black bubble came in the CUTEST bottle. The tea was, again, decent but not enough to warrant the price. I’ve had better Bubble Tea, as well, but I did appreciate how well-cooked the Boba was.  Oyinda is a writer and lover of knowledge. When she's not reading random stuff on the internet, or putting finger to keyboard, you'll find her chopping the life of her head. SUBSCRIBE Sign up with your email address to receive news and updates. SIGN UP We respect your privacy.",
    "spendDetails": {
      "itemsBought": [
        {
          "itemName": "Long Island Ice Tea / Caribbean Punch",
          "itemPrice": "4000"
        },
        {
          "itemName": "Galaxy Milk Tea with Black Bubbles (Medium)",
          "itemPrice": "3500"
        }
      ],
      "totalSpend": 7500
    },
    "link": "https://www.eatdrinklagos.com/review/2022/6/29/review-alice-garden",
    "single": true
  },
  {
    "restaurantName": "OX Restaurant & Lounge",
    "restaurantAddress": "31 Kofo Abayomi Street, Victoria Island ",
    "restaurantPhoneNumber": " 0904 444 4454",
    "review": " Last Sunday, I was having one of those days where I really wanted to go out, but I wasn’t in the mood for the Sunday outside crowd. I don’t know if you get? 😆 Anyway, I decided to go on Monday instead, when I’d have fewer people to deal with, and I’m glad I did.  It wasn’t my first time at OX, but it was my first time really experiencing it. I usually just go to meet up with friends for drinks, but, that day, I was in the mood for the whole shebang — good food/drinks/ambience. And that’s what I got. At OX, there are different outdoor sitting areas, which are nice and airy, and well designed. They also have beautiful waterfall walls outside, which is cool. I chose to sit outside, and it’s worthy of note that it was a bit too dark for good pictures, so if you’re looking for lighting, I suggest you sit inside. The indoor dining area has lovely artwork you can take photos next to, and it’s a great spot for group hangouts, as well as private dining. There are more secluded areas of the restaurant where you can have private parties and events. Basically, it’s really a gorgeous space. As for the service, I was quite happy with it. The staff were welcoming, warm, and were literally at my beck and call. When I asked for my drink to be made stronger, they took it back with all smiles and truly, it came back better and stronger 😜 On to the most important bit: The food. Like my fave, Baddo said, “every single was a hit back to back!” and I’m not even exaggerating. I ordered their chicken quesadillas for my starter, which came with THE BEST GUAC I’ve had in a restaurant y’all, alongside sour cream and French fries. It was supposed to come with pico de gallo dips, but everything was so delicious, that I actually forgot to ask. I was eating like a thief, you guys. Then, for the mains, I ordered the lamb chops and a portion of the half-roasted chicken. The chicken was so flavourful and legit melted in my mouth. It came with steamed veggies, Jolly rice that, although wasn’t smokey, was definitely bussin 🔥 The lamb chops, marinated and grilled, tasted really fresh, like actual good quality lamb; I was really pleased. This also came with the steamed vegetables and that bomb Jollof. Also, both mains came with a side of corn. That’s it. It tasted like corn, the end. For dessert, I ordered a strawberry cheesecake (surprise, surprise!) and I loved it. The cheesecake, strawberry syrup and the strawberry on it all tasted fresh, but I think they went a little too heavy on the crust. It took over the taste of the cheesecake which I didn’t care much for. Like I said earlier, I ordered a Long Island and I think they were joking with me the first time around, because I had it sent back to be remade, and it came back perfect. Which made me realise a second one was in order. Nothing tops off a great meal, for me, than a fire cocktail.  SUBSCRIBE Sign up with your email address to receive news and updates. SIGN UP We respect your privacy.",
    "spendDetails": {
      "itemsBought": [
        { "itemName": "Lamb Chops", "itemPrice": "22500" },
        { "itemName": "Half-roasted Chicken", "itemPrice": "12500" },
        { "itemName": "Strawberry Cheesecake", "itemPrice": "5700" },
        { "itemName": "Chicken Quesadilla", "itemPrice": "9000" },
        { "itemName": "Long Island Reloaded (2)", "itemPrice": "16000" },
        { "itemName": "Water", "itemPrice": "1500" }
      ],
      "totalSpend": 67200
    },
    "link": "https://www.eatdrinklagos.com/review/2022/6/27/review-ox",
    "single": false
  },
  {
    "restaurantName": "Vendome",
    "restaurantAddress": "5 Adetokunbo Ademola Street, Victoria Island",
    "restaurantPhoneNumber": "0702 500 8520",
    "review": " For starters, I ordered the flame-kissed octopus (disclaimer loading) and chicken tenders. Now, if you’re not very experimental with food, I’d advise you to steer clear of the octopus or anything like it. When it comes to how it actually tasted, the best way to describe it is: daunting. The sauce it was served with also had a weird taste. The whole thing basically just didn’t work. On the other hand, the chicken tenders were a hit. Imagine a group of adults fighting to get more than one each. For my main, I got the Cacio e Pepe — which literally translates to “cheese and pepper” — and paid extra for the meal to be made in front of us, where we would watch the pasta being ‘sauced up’ inside a massive parmesan wheel. The live show was cool tbh, but the meal itself was hmmm. When you have to ask yourself if you really enjoyed eating something, you probably didn’t. It was average and the shrimps used as toppings could have been spiced way better.  My friends got the African grilled chicken, which came with plantain and Singapore rice, and this meal was the definition of a banger 🔥 We all feasted on it. And let’s take a moment to honour the plantain, WHICH WAS SALTED. Don’t argue with me, this is how plantain should be eaten always. The chicken nicely fell off the bone and the rice, although a bit soggy, somehow worked? I dunno, it was weird.  After this, we moved on to the rib eye steak we all ordered, which wasn’t fantastic but tasted okay.  One thing we all agreed on was just how generous Vendome’s portions were. The food might have fallen hand in some areas, but you can’t fault the size of the meals. If you’re going to eat here, make sure to go with an empty stomach; you’re going to need it, dear. Can’t forget the drinks! One of the highlights of my evening was my Pinky’s Smoothie — just. delicious. 😍 ",
    "spendDetails": {
      "itemsBought": [
        { "itemName": "Flame-kissed Octopus", "itemPrice": "7100" },
        { "itemName": "Chicken Tenders", "itemPrice": "6000" },
        { "itemName": "Cacio e Pepe", "itemPrice": "12000" },
        { "itemName": "Live Cooking", "itemPrice": "3500" },
        { "itemName": "African Grilled Chicken", "itemPrice": "9600" },
        { "itemName": "Rib Eye Steak", "itemPrice": "18000" },
        { "itemName": "Pinky’s Smoothie", "itemPrice": "4500" }
      ],
      "totalSpend": 60700
    },
    "link": "https://www.eatdrinklagos.com/review/2022/6/21/review-vendome",
    "single": false
  },
  {
    "restaurantName": "SEE",
    "restaurantAddress": "36B Wole Ariyo Street, Lekki Phase I ",
    "restaurantPhoneNumber": "0815 332 4888",
    "review": " I asked to go around because I wanted to see what more the space had to offer. Their stairwell had typewriters hanging on the walls, which I found cute and quaint, and up the stairs, it gave homey vibes, with a couch and dim lights. It immediately made me think SEE is a nice place for a romantic-type date. At this point, I was pretty impressed and really hoping the food would match my already high expectations. To kick off, I got complimentary bread rolls, which were *freshhhh*, and delicious butter. Sometimes, it can feel like a restaurant is just ‘dashing’ you bread, so that you won’t say they didn’t try, but SEE put thought into it. 25 minutes after I settled in, the food came — Jerk chicken with creamy mashed potatoes and a little sauce on the side. The plating was fair (I’ve seen better, really) but what was more important to me right then was digging in.  First bite and I’m like: This Jerk might be jerking ooo 💃🏾💃🏾 The second bite was the real defining moment — I realised the chicken was actually meh; it was the garnish of spring and fresh onions that somehow upgraded it. Every bite was like a burst of freshness in my mouth.  The chicken was tender and fell from the bone, which is my kind of meat (nobody wants to be struggling with chicken in public, this is Lagos LMAO), but the mashed potatoes really stole the show. You could tell time, effort and a little love went into making it, and for that, I was grateful… so grateful, I cleared it in 4 minutes. I also got a mocktail, The Mint Lover and it tied in quite well with my meal — fresh, tangy and tasty.  If I were to rate my overall experience at SEE, this is how it would go: Aesthetics — 10/10 Ambience — 10/10 Service — 10/10 Meal — 7/10  SUBSCRIBE Sign up with your email address to receive news and updates. SIGN UP We respect your privacy.",
    "spendDetails": {
      "itemsBought": [
        { "itemName": "Jerk Chicken & Mashed Potatoes", "itemPrice": "8500" },
        { "itemName": "The Mint Lover Mocktail", "itemPrice": "5000" }
      ],
      "totalSpend": 13500
    },
    "link": "https://www.eatdrinklagos.com/review/2022/6/13/review-see",
    "single": true
  },
  {
    "restaurantName": "No5",
    "restaurantAddress": "5 Ayinde Akinmade Road, Lekki Phase I ",
    "restaurantPhoneNumber": "0915 324 5827",
    "review": "I visited No5 on a chilled afternoon, where self-care was the only thing on the agenda. My immediate reaction was that it’s a really nice space and the energy was good, although you could tell they were still adding finishing touches to the restaurant. As I got settled into a table, the servers literally swarmed me, and I immediately genuinely felt relaxed and taken kiaruf.If you know me, you know I lurrrve lasagne, so immediately I spotted plantain lasagne on the menu (don’t knock it till you try it, folks), I went for it. It took roughly about 20 minutes until my food was in front of me, and compared to what I’ve experienced, this timing is super impressive. I give them props.  Digging right into it, ladies and gentlemen, I found generous layers of cheese that melted my heart. I took my first bite and LISTEN 🔥🔥 To put it simply: This plantain lasagne was all kinds of yum. The flavour was on point, the beef and plantain filling was really nice, it had diced carrots in it as well (which gave it a bit of crunch), and it was served with bread toasted in garlic butter — an all-round perfectly balanced meal.  This restaurant also has to be the first place in Lagos where I’ve gotten a whole jar of orange juice for N3,000. You know that annoying thing restaurants do where you order juice off their menu and they show up with just one glass for some ridiculous price? There was none of that here, and I almost started slow clapping. I had to ask the server twice, just to be sure there would be no off-ing of shirt and fighting. Getting value for my money is key. For dessert, I ordered the salted apple crumble with ice cream, but TBVH I was quite sceptical after my last bad experience at Plantaine. Nonetheless, I decided to have a little faith, especially as No5 had treated me well so far.  The very first thing that impressed me was that it was a deconstructed crumble, which I thought was nice and imaginative. As for how it tasted — heavenly 🥰 Not too sweet; just the right balance between sweet and savoury, which I love. I could taste the cinnamon, the base was really crunchy and the ice cream with mint gave it cool freshness. This dessert was a total win, in my book. ",
    "spendDetails": {
      "itemsBought": [
        { "itemName": "Plantain Lasagne", "itemPrice": "7900" },
        { "itemName": "Salted Apple Crumble", "itemPrice": "5000" },
        { "itemName": "Orange Juice", "itemPrice": "3000" }
      ],
      "totalSpend": 15900
    },
    "link": "https://www.eatdrinklagos.com/review/2022/6/1/review-no5",
    "single": true
  },
  {
    "restaurantName": "The Shark Express",
    "restaurantAddress": "Aaron Mall, 12 Olubunmi Owa Street, Lekki Phase I ",
    "restaurantPhoneNumber": " 0809 306 5555",
    "review": " I’ve been craving a really good seafood boil for a while now, so I knew the stars were aligning when I came across The Shark Express on Instagram. Their entire page is a seafood lover’s dream, so I was so ready to try them out. The Shark Express is a rooftop restaurant, so it’s pretty breezy and chill. The vibe is sort of raffia meets flowery, meets bukka, meets underwater (this is literally the only way I can explain it 😆), with a decorative aquarium and a pool table, which I think is always a good idea. To keep things airy and comfortable, there are cooling fans strategically placed around the space, which I was very grateful for because 🥵🥵 The downside to that is: Because it’s an open space, you’ll end up having one too many flies to deal with… but hey. From the moment we walked in, the servers were pretty much chasing my guest and I down with the menus, so points for enthusiasm, and every time I had a request or concern, someone was always there to attend to me with a smile. We kicked off with beer, which didn’t get to us on time, and meant they were more or less room temp. In my opinion — and this should really be a universal standard — if you’re serving beer, it has to be ‘mortuary cold’ (unless stated otherwise); there’s no actual in between. So, I definitely didn’t care for them. When it came to the food, I felt like I probably should have had eba before leaving the house, because little did I know our meals would take so long to come out. The hope was that it would be worth the wait — but unfortunately, that wasn’t the case. I ordered the seafood boil I’d been dreaming of, which was supposed to come with prawns, crawfish, clams, mussels, crab, corn and potatoes (I also ordered an extra side of potatoes, sausages and eggs to add to the boil). Lo and behold, I got zero prawns, a sh*t ton of crawfish, some crabs, potatoes and 2 mussels, one of which had an empty shell. The servers brought only the side of corn I ordered, none in the boil and none of my extras.  By this time, I was so tired and hungry that I didn’t even have time to complain, I just dug in. On the plus side, the Cajun butter sauce was really nice, but none of it seeped into the seafood, which was really a shame and made it quite underwhelming. The corn was really soft and buttery, and I got to dip it in the Cajun sauce, which tasted mucho delicioso. The potatoes, as well, were soft and very yum, but the absolute star of the show, for me, was the garlic bread. I expected it to be a bit crunchy, but it was all soft and light, which turned out great. Perfect garlic-butter-bread ratio — delicious! On the side (yes, another side!), I ordered their shrimp fried rice and fish, and the disappointment only continued. I got a bowl of cold fried rice, garnished with plantains and a single shrimp on top. Basically, the message was: Mix the rice and the one shrimp and it’ll turn to shrimp fried rice in your mouth, abi? 🤷🏾‍♀️  And this review would not be complete without pointing out that for a seafood restaurant, the actual seafood at The Shark Express was not quite fresh. That’s just a no-no, friends — a big no-no. POSTSCRIPT I really hope they were just having an off day. Try it out, they might surprise you. VERDICT ",
    "spendDetails": { "itemsBought": [], "totalSpend": 19200 },
    "link": "https://www.eatdrinklagos.com/review/2022/5/27/review-the-shark-express",
    "single": true
  },
  {
    "restaurantName": "Ziya Delicacy Boutique",
    "restaurantAddress": "26B Oju Olobun Close, Victoria Island ",
    "restaurantPhoneNumber": " 0814 122 2222",
    "review": " I was randomly going through Instagram recently and bumped into Ziya’s page. There was hardly anything on the page; I could only tell it was a new restaurant in VI and that they serve breakfast. So I did what I do best — planned a visit there to determine if it was worth recommending. If you’re looking for some kind of signage to help you identify this restaurant, don’t bother 😆 But weirdly, I quite like the fact that it’s a bit coded. Immediately I opened the door, I was fairly wowed; I felt like I was in a really quality bakeshop in London somewhere. The smell of freshly baked pastry hits you right off the bat (and we all know there are very few smells in the world better than this one), the decor is clean and fresh, and the servers are nicely professional. I got seated and proceeded to order. My first impression of the menu is that it’s quite fancy — not your typical eggs-bacon-and-pancakes kind of business. Either way, I was not about to order something I wouldn’t enjoy, so I got a turkey and cheese sandwich with butter, and what’s interesting here is that you get to choose from a variety of bread options. They had typical soft butter bread, ciabatta, focaccia, etc. and I ended up asking them to make the choice for me.  I also got a breakfast wrap with scrambled eggs and guacamole, and a caramel cappuccino because, in my opinion, it’s the equivalent of a cardinal sin to be sat in a cafe and not have a cup of coffee. The sandwich tasted like every other turkey and cheese sandwich I’ve had, if I’m being honest (which I always am), but the breakfast wrap was really *really* good. I asked for pink Himalayan salt to sprinkle a bit on my wrap and it made all the difference — a full fiesta in my mouth 🎉 As for the cappuccino, it was meh, nothing particularly memorable. My hot take is that restaurants in Lagos need to step it up when it comes to making a truly good cup of coffee — everything is not about presentation. Both the sandwich and wrap came with a side salad and crisps, which just made me so full, I nearly had to roll out of there. It’s worthy of note that the portions at Ziya are decent and everything was super fresh.  The cherry on the cake at this restaurant is their macarons. In all fairness, the manager warned me that they’re addictive, and he was so right; it was blissss in my mouth and I nearly blew the budget but self-control kicked at the very last minute. I’m never too full for a good dessert! POSTSCRIPT Will I visit Ziya again? Yeah, but maybe just to get myself a treat from the bakery.  VERDICT  SUBSCRIBE Sign up with your email address to receive news and updates. SIGN UP We respect your privacy.",
    "spendDetails": { "itemsBought": [], "totalSpend": 17745 },
    "link": "https://www.eatdrinklagos.com/review/2022/5/19/review-ziya-delicacy-boutique",
    "single": true
  },
  {
    "restaurantName": "Bamboo Lounge and Guest House",
    "restaurantAddress": "38 Oduduwa Way, Ikeja GRA ",
    "restaurantPhoneNumber": " 0812 993 7001",
    "review": " Note: This is not an ‘official’ review, as we did not have what we consider ‘a fuller experience’ of Bamboo Lounge’s menu.  I’m currently very into the outdoor eating/lounging/enjoying drinks vibe on the Mainland these days, as an escape from my everyday reality of typing all day, failed attempts at potty training and watching endless episodes of Cocomelon (iykyk). On recommendation from a good friend and in a bid to spice things up a bit and break the chokehold Cubana’s grilled catfish has on me, I dragged my S.O. to Bamboo Lounge for a night out. One of the first things I noticed is how it gives off a Londoner’s vibe, something you’re likely to understand if you’re on the millennial spectrum and familiar with the Mainland. It’s not exactly a pub, and its decor is considerably different, but Bamboo Lounge is clearly a place for after-work beers, a plate of asun or peppered gizzard with a mound of onions by the side, with loud music playing in the background. They have a pool that doesn’t look like it gets a lot of swimmers, rather serving as something nice to look at while you decide on what to order, long palm trees decorated with lights all the way to the top, like it’s Christmas, and an indoor and outdoor space, both of which are decent. Naturally, the first thing you want to know is if the food is any good. For drinks, we got a can of Coke and a bottle of Smirnoff Ice, keeping it super simple because although their cocktail list was standard, I’ve been too disappointed lately with drink orders and I didn’t feel like wasting N6500 that night. For starters, we had a shared a plate of chicken suya, which is probably one of the best I’ve had. It was tender, juicy, glistening with oil and really flavourful. Safe to say expectations were high at this point. The anticlimax came when the mains arrived. I ordered a margherita pizza (I thought I had seen something that looked like a proper pizza oven in the corner, so I felt safe), while my husband had grilled croaker fish coated in pepper sauce with chips. The fish looked good and was presented well, but unfortunately, wasn’t seasoned well enough, and the chips were lacking the all-important final sprinkle of salt while it’s still piping hot (why home cooks know to do this and restaurants think its optional is way beyond me). The pizza… was not a pizza; it was a doughy bread with lots of cheese on top. I can never be mad at “too much cheese” — as far as I’m concerned, such a thing doesn’t even exist — but common guys, if you can’t get a pizza base right, don’t offer a range of pizzas on the menu. It’s simple.  The actual flavour of it wasn’t bad, but that’s because cheese and tomato sauce were made for each other; in my opinion, it’s a lot harder to mess up. I struggled through two slices and had the rest bagged up. We thought about having dessert (the menu had a lot of attractive options), but I was too full on the main that wasn’t mine (seeing as mine was a bust), so we decided to hit the road. But not before a fire shot for the ’Gram though, because the aesthetics were aesthetic-ing and please, if I go out after 7pm, my fans on Insta Stories must hear about it. Update: I had a slice of the margherita pizza two days later, and the freezer really does wonders for leftover pizza. It tasted way better!  SUBSCRIBE Sign up with your email address to receive news and updates. SIGN UP We respect your privacy.",
    "spendDetails": { "itemsBought": [], "totalSpend": 14850 },
    "link": "https://www.eatdrinklagos.com/review/2022/5/10/bamboo-lounge-is-vibes-but-the-food-needs-work-",
    "single": false
  },
  {
    "restaurantName": "Sketch Restaurant & Cafe",
    "restaurantAddress": "5 Adeola Hopewell Street, Victoria Island ",
    "restaurantPhoneNumber": " 0908 845 1909",
    "review": " Immediately I heard Sketch now had a branch in Lagos, I knew it was only a matter of days until my wallet and I would make an appearance. I also knew they had Egyptian cuisine on their menu and I’d been looking forward to trying it for the first time, so it was fairly exciting to visit here.   I’ll touch on aesthetics first. What I’ll say is walking into Sketch feels like walking into a storybook, literally. The restaurant is designed (top to bottom) with 2D/3D elements, so it feels a little surreal but also incredibly interesting. And overall, it adds to the experience – which you’re always looking for when you eat out. After I settled down and was offered the menu, I was ready for a good meal, but unfortunately, none of the food I wanted was available. Slightly annoying, but I eventually had to settle for the kebab and kofta, with barbecue chicken wings and fries. My meal took about 25 minutes and when it came, at first sight, the portions made me very uncomfortable, as it was really small in comparison to the prices. But I thought maybe the taste will not make me complain. The chicken wings were alright, nothing exciting and within the safe zone, however, the fries were really good; I could tell they were made with fresh potatoes, which is awesome. There's a clear difference between fresh potato fries and the frozen ones from a plastic bag, iykyk 😏 To the kebab and kofta: When I saw kebab, I was excited because I truly believe North-Eastern parts of Africa know how to make meat that bangs. Sketch’s kebab was not kebab-ing *at all* (I almost prefer not to even talk about it), but the naan that came with it was really nice and fresh. Unfortunately, the naan, fries and drinks (I had the Mooly and Arnold Palmer cocktails) have to be the only thing I truly enjoyed at this restaurant, which is a real bummer. Essentially, if you're going to eat here, go with a heavy budget as it’s not cheap and the portions just don’t correspond. I also wouldn’t recommend this spot for a date because it’s really loud, but for lunch with friends or a night out, it works.",
    "spendDetails": { "itemsBought": [], "totalSpend": 32800 },
    "link": "https://www.eatdrinklagos.com/review/2022/4/25/review-sketch",
    "single": true
  },
  {
    "restaurantName": "HSE Gourmet",
    "restaurantAddress": "25 Babatope Bejide Crescent, Lekki Phase I ",
    "restaurantPhoneNumber": " 0810 745 3157",
    "review": " Kindly note: This is an updated review. We first reviewed HSE Gourmet (then: Cafe) in September 2016. *** It’s a big deal for me to say a place is my *favourite spot* lol. But, as far as I’m concerned, HSE Gourmet can do no wrong! I've visited at least six times and it’s been a hit every single time. So cheers to me for being super nice and sharing this with you all 😉🥂 Let’s start off with the ambience and decor at HSE — it’s nothing too exciting, but it’s a very neat and cool space. When it comes to customer service, I’ve, no doubt, experienced one of the best in Lagos here. Now, to why we’re all here — the FOOD. Like I said, I’ve been here several times, but my two hands-down favourite meals are what I’ll be reviewing. First on the list is the seafood linguine, which comes with the option of mussels, if that’s what tickles your fancy. I initially went for a tomato base but the waiter advised I tried the creamy base instead, and I’m so glad I listened to him because it was *heavenly*. This was a proper seafood pasta! It had calamari, shrimps and bits of chilli flakes peeking out and the creamy sauce was truly well seasoned. The first time I tried mussels, I was like where has this been all my life?! It was definitely the icing on the cake for me; elevated the whole meal.  This is a solid 9/10, for me. The next meal I love is the lamb chops with mashed potatoes. Now, I’m not a huge fan of meat, but when it’s well done, you’ll find me there. When I’m asked how I want my meat, it’s always “medium well done” because that’s how you should enjoy your meat, don't argue, just simple facts ✌🏾 Anyway, when the servers brought out my meal, the drooling had already started because it smelled amazing and was looking really good. Long story short? I cleared my plate so fast! The lamb chops were super yum, tender and juicy and the mash was rightly done, with no lumps, just creamy deliciousness. The veggies by the side were also well seasoned and still crunchy (say NO to soggy veggies). Another thing I loved was how they served this meal with peppercorn sauce and chilli sauce, so you find what works best for your tastebuds that day.  Overall, this meal is a 10/10, for me. I can't believe I finally found a meal that got full marks, but it was so worth it.    When it comes to drinks at HSE, I always just go for fresh juice, and it’s hard to slander fresh juice lol. I almost forgot to include that for starters, make sure to try their chicken sliders — absolutely divine!  ",
    "spendDetails": { "itemsBought": [], "totalSpend": 36100 },
    "link": "https://www.eatdrinklagos.com/review/2022/4/18/review-hse-gourmet",
    "single": "true"
  },
  {
    "restaurantName": "Zen2go",
    "restaurantAddress": "6C Adeleke Adedoyin St., Victoria Island",
    "restaurantPhoneNumber": "0904 442 4442",
    "review": " Now, onto the business of the day: The food. After the drinks fiasco, I tried to order one of their local meals, but they said it was served only on weekends, so essentially, I had to order from the regular menu. We ordered the half-roasted chicken with a side of Jollof rice, the volcano chicken strips and fries. The roasted chicken is actually the best marinated chicken I’ve ever had in a restaurant! Every corner you bit into was juicy and flavorful, and just melted in your mouth. The Jollof was also good Naija Jollof, even though I wished they made it with a bit of their local spices so it could be a little different, but still, I was pleased.  The volcano chicken strips were the highlight of my day. I like crunch, but not tasteless crunch, and tasteless, it was not 👏🏾 This juicy chicken came drizzled in their barbecue sauce and the fries were crispy and soft at the same time. My meal came with a delicious sweet chili sauce as well. Long story short: The meal was pure magic ✨ and I was a happy gal. Oh, and I have to talk about the portions: We could barely eat up to half of our meals and had lots of leftovers! As per the service, the servers were enthusiastic about making sure we had everything we wanted, they smiled all through, and it was noticably not the “I’m just doing my job” smile; they seemed genuinely pleasant.  Will I be eating at Zen2go again soon? For sure.  SUBSCRIBE Sign up with your email address to receive news and updates. SIGN UP We respect your privacy.",
    "spendDetails": { "itemsBought": [], "totalSpend": 22500 },
    "link": "https://www.eatdrinklagos.com/review/2022/4/12/review-zen2go",
    "single": "true"
  },
  {
    "restaurantName": "Ki Bar & Kitchen",
    "restaurantAddress": "31A Oju Ologbun Close, Victoria Island ",
    "review": " So, backstory: Two friends of mine checked out Ki and told me I needed to go there and experience it for myself, and who am I to say no to eating more food? Immediately I walked in, I got the VIP treatment from the staff, which made me feel really comfortable instantly. The head chef, who came out to introduce himself to my friend and I, taught us how to use chopsticks and helped in selecting the meals we ordered because they have a super long menu (warning LOL). But there are worse things in life and in Lagos than a restaurant having too much food to choose from. They did the usual — gave us some peanuts while we waited. I used this opportunity to walk around and get a feel of the place. Ki doesn’t have the best aesthetic I’ve seen but it’s a very decent space. I ordered a strawberry lemonade and my friend got the raspberry bramble. Both drinks were pretty good and they also came really fast, which is always great. I played safe with my starter and went for barbecue wings, and I do not in any way have any regrets because the wings were bussin!!! If you visit Ki, you MUST order this; they were that good. Sometimes, playing safe wins 🙌🏾 On to the main meals! We got the katsudon chicken and kai sen udon chicken. When both came, my friend and I had the same expression because it was such a large serving. I wasn’t surprised because Asian restaurants will have you super full. The kai sen udon is definitely different from what I'm used to; it was a mixture of Jasmine rice, crispy chicken and fried eggs. Weird in the mouth but I kept going. Even more weirdly, I really really enjoyed it! Meanwhile, the katsudon is a simple noodle stir fry and didn’t blow my mind, but it was a fairly nice meal.  Overall, the staff was really welcoming and good at their job. The food was good and the drinks, even better. You should absolutely stop by Ki and get one of the best barbecue chicken wings you'll find in Lagos 👏🏾  SUBSCRIBE Sign up with your email address to receive news and updates. SIGN UP We respect your privacy.",
    "spendDetails": { "itemsBought": [], "totalSpend": 15500 },
    "link": "https://www.eatdrinklagos.com/review/2022/4/11/review-ki-lagos",
    "single": "true"
  },
  {
    "restaurantName": "Kuramo Sports Cafe",
    "restaurantAddress": "Plot 1415, Adetokunbo Ademola Street, Victoria Island ",
    "restaurantPhoneNumber": " +234 277 2700-25",
    "review": " Over the years, we’ve reviewed a handful of restaurants at Eko Hotel, sharing our thoughts on what the establishment has to offer — from steakhouses, to rooftop bars. But if you want to enjoy a good buffet on Saturday afternoon with family, is Eko Hotel the spot? The Kuramo Sports Cafe, one of the hotel’s many restaurants, is known for putting out a buffet with continental and local Nigerian food, from 7pm daily. We recently checked it out on a Friday night. The ambience is spacious and inviting enough, and ideal for a large group of friends/family. It’s also right next to the poolside, so you can enjoy a great view while having dinner.  I started off with a pretty inviting mojito (it’s worthy of note here that they had a nice selection of cocktails), which I would usually enjoy, but unfortunately, this one had a bit too much ice and quickly watered down the drink. This is where my other glass of good ol’ cold water came to the rescue. When it comes to appetisers, I have to say Kuramo Sports Cafe’s selection is a bit dreary. Pretty much all that was on offer was a few vegetable/carb salads, fruit salad and bread and butter. I had a combo of an egg & potato and seafood salad, which wasn’t terrible but didn’t really stand out either, however the potatoes were tasty and the calamari in the seafood salad was particularly nice. I was a bit more excited about the mains. The buffet served up a variety of rice dishes, curry pasta, couscous, Edikang Ikong and eba, buttered chicken and different kinds of braised meat (just to name a few). I settled on the white rice, alongside the most tender-looking braised pork and huge chunks of plantain that had been calling my name from the jump. I can report that the pork was *actually* tender and the sauce that it has been sitting in was really yummy — altogether beautiful. The white rice was perfect and fluffy (doesn’t get better than that with white rice, I guess) and the plantain was sweet and sturdy, the way ALL fried plantain should be (happy to take this argument to Twitter 😈). The mostly-decorative red bell pepper on it was also a nice touch. I stan bell peppers hard. This was my favourite part of the meal. It was simple but tasty, which is always a win. Moving on to dessert, I had a selection of sweets — a chocolate cake with ganache, red velvet cake and a really, really beautiful strawberry eclair with actual sliced strawberries in it. I’m not a fan of strawberries because there’s nothing to them lol, but it made this dessert look extra pretty, and the lovely cream inside had a great texture. This is where I confess that although you’ll only see one eclair in the photo below, I had 3 — they were that nice. Both cakes, on the other hand, were quite stale and didn’t deliver on flavour. It was a little obvious they either hadn’t been baked that day or they were made by someone who’s not very good at baking. Overall, I have to say Kuramo Sports Cafe’s buffet is very (very) average and they need to do quite a bit to step it up, so diners can get good value for their money. The country is too tough right now for this — or any — kind of meh-ness. SUBSCRIBE Sign up with your email address to receive news and updates. SIGN UP We respect your privacy.",
    "spendDetails": { "itemsBought": [], "totalSpend": 13500 },
    "link": "https://www.eatdrinklagos.com/review/2022/4/4/review-kuramo-sports-cafe-eko-hotel",
    "single": true
  },
  {
    "restaurantName": "So Fresh",
    "restaurantAddress": "310, Oworoshoki Expressway, Gbagada ",
    "restaurantPhoneNumber": " 0906 254 7666",
    "review": " I’m a huge fan of the salad and smoothie wave we’ve been experiencing in Lagos over the past few years, with more and more businesses offering fast, lower-calorie, all-in-one meals that come straight to your door. When I’m in the mood for fruit and veg (that I had no business slicing and dicing), I order the odd banana granola parfait or any salad with chicken in it, and I’m usually pretty content. My last voyage into the fresh salad world wasn’t such a great one, though. I recently ordered the Avo Spicy Chicken Salad from So Fresh, which contains spicy chicken (obvs), cubed avocados, boiled eggs, diced cabbage and carrots, and shredded lettuce. A winning recipe in my opinion, but unfortunately, this salad just didn’t cut it. To give the most fair review possible, I ordered this salad twice, two weeks apart, and tried it with and without the dressing, but my views were the same. Spicy chicken is pretty difficult to mess up and thankfully, I got to enjoy that, alongside the avocado chunks — they were fresh and creamy — and sliced boiled eggs. But then everything else got weird. The carrots tasted quite dry and chalky, and the cabbage and lettuce had an unpleasant acidic taste I couldn’t get my head around. This is where salad dressing comes in, right? To give the salad much-needed moisture and bring all the elements together. Sadly, this was probably my least favourite bit of the meal. The creamy (house?) dressing had no real identifiable taste — I couldn’t make out if it was classic, French, something else? All in all, didn’t give this salad the lift I was hoping for and there was very little harmony between all the different parts. The flavours just didn’t work together. For its price (see below), the Avo Spicy Chicken Salad is not a bad deal at all — if it actually tasted nice. Safe to say I most likely won’t be ordering this again, however I’m very open to trying other things from So Fresh, like their parfaits, which are quite yum.",
    "spendDetails": { "itemsBought": [], "totalSpend": 3100 },
    "link": "https://www.eatdrinklagos.com/review/2022/3/16/edl-bites-does-so-freshs-avo-creamy-chicken-salad-offer-the-best-bang-for-the-buck",
    "single": "true"
  },
  {
    "restaurantName": "Godaïf Village",
    "restaurantAddress": "Casa Asmarina, 26B Turnbull Rd, Ikoyi ",
    "restaurantPhoneNumber": "Casa Asmarina, 26B Turnbull Rd, Ikoyi ",
    "review": " I came across this page on Instagram and I was really into their aesthetic, so I decided to pay them a visit and BOY, did I love it! Godaif Village is a café/bar/pizzeria; it’s such a cute and cosy space. Immediately I walked in, I was welcomed with the smell of coffee brewing, which I love. I got seated and placed my order - a bagel, turkey and cheese croissant, waffles and the English breakfast. Before you judge me about having this alone, LOL I had company. The meals took approximately 20 minutes to get to us. First thing I munched on was the turkey croissant and YUP, they got it right! The croissant was flaky and the cheese was just the right amount. Then the bagel… let me just say I had a terrible experience with a bagel I ordered somewhere else, so I was hesitant but when it came, everything smelt so fresh. The inside was super soft and the outside had a nice crunch to it. The waffle was nice as well; they get extra points for serving homemade strawberry sauce because it uplifted the whole meal.  And for the star of the day, it had to be the English breakfast. I’ve had the typical toast, eggs, sausages over and over but this tasted different. It was *literal* perfection. The bacon was nice and crispy, the omelette was yum, the sausages were just right — this was my favourite meal.  And I have to give it up for the drinks as well — they were amazing. I had hazelnut frappucino and my friend got fresh pineapple juice.  If you’re really keen on good service, you’ll definitely love this spot. The attention to detail and customer satisfaction is top-notch. The pricing is also fair, nothing extravagant. If you visit here, also make sure to grab a blueberry muffin to go. Thank me later! xoxo ",
    "spendDetails": { "itemsBought": [], "totalSpend": 24800 },
    "link": "https://www.eatdrinklagos.com/review/2022/3/14/review-godaf-village",
    "single": "true"
  },
  {
    "restaurantName": "La Chaumiere ",
    "restaurantAddress": "1384 Tiamiyu Savage, Victoria Island, Lagos",
    "restaurantPhoneNumber": "08187937339",
    "review": " Located in the heart of Victoria island is this cute little spot. From the decor to the smell of coffee and pastry, you almost feel like you’re home immediately you walk in.  I checked out La Chaumiere with a friend and I had him order a starter to kill time because I was running late. As soon as I got in, the Chicken Tenders came in and we both had the same look on your face when the waiter set it down. We literally blurted out “this batter is way too thick” at the same time.  We decided to give it a chance but there was no saving this. We were right, the batter was just too much and we had to get the attention of the manager. They apologised but not the best start. Not to be disheartened, we ordered another starter - the Taco Platter.  I know it says “platter”, but in my head I still expected a tiny starter portion. Imagine my shock when the waiter came in with a whole tray of tacos. The tacos were delicious though, even the vegetarian taco. If anything, I’ll return just for this.  After the tacos, I was already super full but we came here on a mission and I wasn’t going to let anything stop me. We ordered the Stir Fry Noodles and the Beef & Broccoli as our mains.  You could literally smell the stir fry from the kitchen when the waiter picked up the order. Each forkful was a solid 9/10. Down to the very last one.  I’m very particular about my broccoli and I’m happy La Chaumiere passed the test. Crunchy and well seasoned. The beef was thin cut and very tender. Another positive. On the negative end, the rice it came with wasn’t the best so let’s pretend it wasn’t there.  On the whole, I liked La Chaumiere. The drinks were pretty decent, but the waiters not so much. On a professional level, they just weren’t quite there yet but I can let it slide. I’ll definitely come back here for a cute girls night out or something.   ",
    "spendDetails": { "itemsBought": [], "totalSpend": 29800 },
    "link": "https://www.eatdrinklagos.com/review/2022/3/4/review-la-chaumiere",
    "single": false
  },
  {
    "restaurantName": "Plan.taine",
    "restaurantAddress": "10a Adetokunbo Ademola street, Victoria Island, Lagos",
    "restaurantPhoneNumber": "+234 908 111 1189 ",
    "review": "The other day, I was felt like trying something different and stumbled on Plant Taine. Plant Taine is a new “casual upscale” Caribbean restaurant in Victoria Island. I visited  without a reservation and they made room for me so, yeah, shout out to them for that. The interior is absolutely lovely and the background music gives all the vibes of Jamaica. In their words, “… the concept is to create an exceptional space where the service, ambience, meal, and drink offering transports every visitor on an indulgent trip to the Caribbean.” They definitely nailed the vibe.Anyway, let's get to the food shall we! My starters took about 35 minutes to come out, which made me a bit irritable. I ordered the Plant Taine Corn Fritters with Ackee and Saltfish. Given they promise to transport you to the Caribbean,  I came in with the mindset of being blown away by the flavors. So, my first bite into the corn fritters, I was like bleh. It wasn't great but was not bad either. The ackee and saltfish was good though, it was spicy yet mild and the bread was super fresh. For my main, I ordered the Jerk Chicken because I want it to feel like in Jamaica in my mouth. Duh! Unfortunately, I was not impressed at all. I've had Jerk Chicken from other places and it's always a feast for my tastebuds. But it wasn't the same here. Their jerk chicken just tasted like regular roast chicken and jerk spice sprinkled over it. Imagine the disappointment on my face, but we move.  The sweet potato fries that came with it on the side was pretty good so it’s not all bad.  I decided to give Plant Taine one more chance in this visit and ordered the Curry Goat with Rice & Peas. This is the only meal I had here that I was somewhat happy with. It was nice, tasty and the portion is perfect for one person. The goat  was super tender and literally melts in your mouth. The curry was not overwhelming thankfully. It had such a good balance and I enjoyed it.  The Plant Taine bar wasn’t untouched. I ordered two drinks - a mocktail, Sunrise on the Beach, and a cocktail, Rum Punch. The mocktail was not spectacular and tasted super diluted, but the rum punch was okay.  The rum was really punching LOL. Where I lost it, though, was the dessert. Not all restaurants get it right with dessert but they usually try. At Plant Taine, this was not the case. I ordered an Apple Crumble and what I got was not an Apple Crumble. It tasted like wet granola with apples and some sauce.  It was terrible.  I did make sure to let them know and they really did not have anything to say or do so I got it up and called it a day. Will I be visiting Plant Taine again? I doubt it.  ",
    "spendDetails": { "itemsBought": [], "totalSpend": 32700 },
    "link": "https://www.eatdrinklagos.com/review/2022/1/13/review-plantaine-victoria-island-lagos",
    "single": true
  },
  {
    "restaurantName": "Pearl",
    "restaurantAddress": "Eko Pearl, Eko Atlantic City, Victoria Island, Lagos ",
    "restaurantPhoneNumber": " Instagram ",
    "review": " The plan wasn’t to go to Pearl, or to go with even the person I eventually went with, but everything turned out perfectly. So after ditching the first restaurant because I wasn’t feeling the vibe, we decided to go to Pearl in Eko Atlantic. (Ed. Note: We checked out Pearl a while ago before this revamp) When we arrived at the Eko Pearl, because we had never been there, we were lost for a minute before we were saved by a gorgeous host who asked the right questions and took us to a table.  As usual, we ordered a Long Island to assess the place before they do to us what they did to us at you know where 🤭. The waitress, Mercy, tried to encourage us to get one each because she swears by it. To avoid stories that touch, we insisted on the one, and that’s how one turned to 4 or 5?? I kid you not, Mercy wasn’t lying, their Long  Island is the absolute best I’ve had in Lagos. And I know my Long Island. The beef was slow cooked, it had avocados and salsa in it. It was super juicy and flavorful! I absolutely loved it.  For the mains, we originally wanted to order separate meals, but once again, Mercy very seriously encouraged us to order the beef tomahawk, and it was the best decision.  It was a 1kg Angus Beef Tomahawk, so it was large enough to feed two people and then some. I still have leftovers in my fridge. We asked for it to be well done and well done it was. It was perfection!!   “1kg Angus Beef Tomahawk, Sautéed Vegetables, Grilled Potatoes, Served with Fresh Mushroom or Black Pepper Sauce” — PEARL RESTAURANT Delicious and juicy, it had some sautéed veggies, mushrooms and grilled potatoes. We got the mashed potatoes and jollof rice as sides. The mashed potatoes were creamy and just divine. Everything blended well together and every bite was a feast in my mouth. The jollof rice was jollofing and that’s the only way to describe it. For dessert, because I’m not a cake person, I mostly order cheesecake since it’s not very “cakey” 😂 The Strawberry Cheesecake, like the rest of the meal, did not disappoint. Crust.. great, cheesecake.. excellent, and the right amount of strawberry sauce.  Oh, did I mention they have a mobile bar where you can be your own mixologist? Because yeah they do, mix your drink to your taste, how cool is that? The service at Pearl was great, from when we stepped in till we left, everyone had a smile on their faces. Like, they were happy to serve and we had a great waitress. Her recommendations were spot on, she was really polite and she kept checking to see if we were alright or needed anything. The food came out on time and it was just a great experience.  ",
    "spendDetails": { "itemsBought": [], "totalSpend": 38200 },
    "link": "https://www.eatdrinklagos.com/review/2022/1/8/pearl-restaurant-eko-atlantic",
    "single": false
  },
  {
    "restaurantName": "HOV Lounge",
    "restaurantAddress": "8 Wole Olateju Cres, Lekki Phase I, Lagos ",
    "review": " For my birthday this year, my only objective was to turn it into a week-long party. To kick off, I’m decided to check out a new spot in Lekki - HOV Lounge. Word on the street is that the food is pretty bomb so I dusted my shoes and dragged myself there. HOV Lounge is still pretty new so everything feels super fresh. The interior is very modern and it has the most charming waterfront view. Immediately I walked in, my mind was like “Yes! I’m going to love it here”. The waiters are also very pleasant.  I kicked off with some drinks. Their drink menu is pretty straight to the point. I had the Safe Sex on the Beach, while my date got the Honolulu. Both very quality picks on our part. For starters, I ordered the Lamb Croquette. Now, I know what a croquette is but I was really hoping it would be a “more than a starter” portion because I went in on an empty stomach.  When the croquette came, it was a starter STARTER. It was literally just two balls. Sure, the plating was exquisite and the croquette was very flavourful, but I pretty much cleaned it in seconds. Please, don’t judge a hungry woman. The texture stands out a bit so if you’re not in mood for what tastes like mashed plantain and slow cooked lamb, you should avoid.  For my main, I got the Duck L’Orange with Dirty Jollof. It was a 25 minute wait and wasn’t what I expected, but I was hungry so it didn’t matter. The duck was packed with flavour, but the “dirty” jollof, not so much. It wasn’t the worst thing I’ve eaten in Lagos, but it was nowhere near the best. Very forgettable. ",
    "spendDetails": { "itemsBought": [], "totalSpend": 29500 },
    "link": "https://www.eatdrinklagos.com/review/2020/12/7/review-hov-lounge-lekki-lagos",
    "single": true
  },
  {
    "restaurantName": "Moonshine Cafe",
    "restaurantAddress": "7A Admiralty Rd, Lekki Phase I, Lagos",
    "restaurantPhoneNumber": "NA",
    "review": " The Banga was a hit for me. I honestly cannot believe I’ve made it this far in life without trying Banga and none of my friends thought to change that. Pairing it with the lemongrass rice was an absolute masterstroke by Moonshine.   I absolutely loved Moonshine. it’s definitely getting a revisit from me.  ",
    "spendDetails": { "itemsBought": [], "totalSpend": 18100 },
    "link": "https://www.eatdrinklagos.com/review/review-moonshine-lekki-lagos",
    "single": true
  },
  {
    "restaurantName": "PIT STOP LAGOS  ",
    "restaurantAddress": " 92A Younis Bashorun Street, Victoria Island, Lagos  ",
    "restaurantPhoneNumber": "   0802 334 7887",
    "review": " Picking my first restaurant to review was a bit a challenge because I didn’t want to “mess it up”, but my friends helped me and we decided on Pitstop. My sister, on the other hand, wasn’t too excited because of her own experience, but I decided to go anyway and have my own objective experience.  The first thing you notice about Pitstop is all the bikes and fitness paraphernalia in the space. They have those really cool bikes where your smoothie blends while you cycle! The space is somewhere between homey and “maybe I should have thrown on some heels”.  I absolutely hate when waitstaff try to size you up before taking your order, especially when you’re a woman in Lagos. We, i.e. my friends and I, ordered two Long Islands and a classic mojito and told the waitress to tell the bartender to make them extra strong. I wanted the Long Island without the Coke because the Coke is what makes it less potent and SPECIFICALLY asked that the Coke be left out.  Do you know what happened? Pitstop followed instructions when bring my male friend’s Long Island, but the other Long Island was super weak. Don’t even get me started on the mojito. I know you guys might think it was a coincidence, but it wasn’t. The waitress confirmed that she thought “because we’re ladies” we wouldn’t want it strong.  🤦🏾‍♀️ To start, I ordered the Chicken Noodle soup. This was my absolute favorite thing of the evening. Sure, it wasn’t spicy like I asked for it to be, the noodles were thankfully not overcooked. It was so comforting that my friends had to beg when they saw how much I loved it and not because their order took 25 years to come out.  The slow cooked lamb shank was going to be main, but unfortunately, I went with the beef and mushroom pie instead. I’d heard great things about the lamb but I saw “slow cooked” with the beef and I got carried away. The pie was basically two pieces of beef with a couple dollops of mushroom sauce in a dry and hard crusted pie. It reminded me of lunch time meat pie in secondary school with just air and potatoes. The mash that it came with was okay and not overwhelming, but the stir fry vegetables were very bland. That said, I liked the red wine gravy so good for them. My guest ordered the peppered chicken wings and Rodo pepper sauce with a side of their jollof rice. The jollof was surprisingly amazing. It tasted like correct Nigerian smokey jollof and you can almost forgive Pitstop for going with basmati rice. The wings, on the other hand, weren’t too spicy which was great for me, but didn’t please my friend at all. My other guest ordered Spicy seafood pasta, with tomatoes, prawns, calamari and fish. They call it “spicy” seafood pasta, but there wasn’t a hint of that. The pasta itself was perfectly al dente and I loved how crispy the calamari. The fish was forgettable, however. The service at Pitstop started off on a really high note but after the drink debacle, it all went downhill. Our waitress kept disappearing and her replacement was really rude and standoffish. They got my friend’s pasta order wrong and gave her chicken instead of seafood. My friend didn’t realize until they literally yanked it off her hands while explaining that it was a mix up.  My friends and I were not quiet about our displeasure, and asked for the manager. They brought out a supervisor who was really soft spoken and sweet. He listened to us and apologized. He tried to make it up with complimentary dessert and shots, but I’m not going to forget this experience in a hurry.   I enjoyed the free cheesecake though.  POSTSCRIPT I’ll only come back if I’m being dragged there, because I don’t have strength to be doing monitoring spirit on  all my orders VERDICT",
    "spendDetails": { "itemsBought": [], "totalSpend": 15000 },
    "link": "https://www.eatdrinklagos.com/review/2020/11/22/review-pitstop-restaurant-victoria-island-lagos",
    "single": true
  },
  {
    "restaurantName": "Oceans5 by Riviera",
    "restaurantAddress": "20 Elsie Femi Pearse Street, Victoria Island, Lagos ",
    "restaurantPhoneNumber": " Phone",
    "review": " NOSA: I didn’t have the highest of hopes for Oceans5 before we visited. It just felt like one of those restaurants in Victoria Island that followed the template. You put some hummus here and maybe a pizza there. Add a lovely backdrop for Instagram pictures, and you’re all set. Not Oceans5, however, and I’m happy they proved me wrong.  FOLLY: I didn’t have any expectations. I was just interested in going somewhere new. So I was just happy to be here. NOSA: By the way, is this the earliest I’ve said I liked a restaurant in one of our reviews? FOLLY: Probably. People think we’re haters of things. I think we’re actually mostly meh on restaurants, and then equal parts hate and like.  NOSA: To start, we opened with the Hummus Platter - a trio of hummus served with pita bread and a side salad. FOLLY: I ordered this because it was my season of intense hummus cravings - not pregnant. My desires were not met at all.  NOSA: Before I get into this, one thing that really stood out to me on the Oceans5 menu was how many vegetarian options there are. Sure, it’s Indian-owned, but still. This might be the most vegetarian-friendly restaurant in Lagos that isn’t boring.  Okay, back to the hummus.  Yeah, I didn’t like it. It wasn’t the hummus though, this one is on me. I wasn’t expecting beetroot hummus, and that was just a step too much adventure for me.  FOLLY: I definitely forgot I was not in a Lebanese restaurant because I had imagined we were getting Plain Hummus, Hummus with meat, Spicy Chilli Hummus for this trio.  I didn’t ask our server, oh; I just fully believed that’s what I was getting. Just imagine my disappointment when I didn’t get that.  I just ate the side salad and moved on because this was all me. In fact, as the waitress placed the plate down, I whispered an audible “Won ti get me”, and I think she laughed.  NOSA: That said, we liked the Fried Mac & Cheese - another vegetarian option that we had as a starter. PS: Vegetarian, not vegan. The Fried Mac & Cheese is simple, but it works, and the truffle was a welcome addition.  FOLLY: Especially if you find Mac & Cheese overwhelming, it’s such an excellent (and lighter) place alternative. It’s a small enough portion, so you get the Mac & Cheese experience without the weight. It didn’t say on the menu, so we didn’t know the filling was actually a truffle Mac & Cheese, so that was a delight.  NOSA: For a starter, it gets the job done.  FOLLY: The tomato sauce doesn’t do much for this dish, so I think they could do without. Just tasted it and didn’t eat anymore. Maybe a dot of a truffle aioli on each Mac & Cheese ball instead, for presentation.  NOSA: The Kerala Tacos - marinated beef cooked in Indian spices and served in coin paratha with a creamy yoghurt dip.  chef’s kiss FOLLY: The Kerala Tacos were all Nosa. I could have done without this starter. NOSA: Probably my favourite of the starters we got. Think Indian meets Mexican, and you’ll get the picture. I never in my life expected this, but it was oh so good.  FOLLY: It’s very distinctively Indian. I ate one taco and moved on and left the rest for Nosa. I’m not the target market. NOSA: For science, I ordered the Chicken Katsu Sushi Burger.  I knew I wasn’t going to like this, but sushi burgers were trendy on Instagram that year, and this is the first time I ever saw this on a Lagos menu. You’re not supposed to eat this like a regular burger, by the way.  FOLLY: How then? A fork and knife, I guess. NOSA: The “bun” is sticky rice moulded into a bun, and it might be a little too much sticky rice for most. Almost like Eba in texture.  FOLLY: Hehe, yes, very much almost like Eba. Nosa took the filling out of the sticky rice patties. I actually liked the sticky rice, so I ate quite a bit of it before getting tired.  NOSA: I appreciate them for being different and not having a regular burger on the menu, but yeah, this wasn’t for me. Go like the pictures on Instagram, though.  FOLLY: I initially wanted pasta as my main, particularly the Spaghetti Aglio Olio. However, I allowed Nosa to incept me into ordering the butter chicken.  NOSA: I love how the Butter Chicken is served. It’s probably shaping my bias here, but this might be the best Butter Chicken I’ve had in Lagos. It’s the right amount of sweet, and the cheese naan we got on the side was just perfect.  FOLLY: We actually got Cheese Naan as an extra, but what is truly unique is that the Butter Chicken at Oceans5, by default, comes with plain naan or white rice. They don’t make you order it separately as a side at an extra cost.  NOSA: I’m probably exaggerating because the last time we got Indian was at 343 Degrees North, and that’s fair. BUT, this was pretty good.  FOLLY: I doubt that you are. This was solid. The butter chicken was silky, sweet and smoky. 10/10. I even prefer it to Sherlaton. ",
    "spendDetails": { "itemsBought": [], "totalSpend": 34500 },
    "link": "https://www.eatdrinklagos.com/review/review-oceans5-by-riviera-victoria-island-lagos",
    "single": false
  },
  {
    "restaurantName": "343 Degrees North",
    "restaurantAddress": "237 Kofo Abayomi Street, Victoria Island, Lagos ",
    "restaurantPhoneNumber": " Phone",
    "review": " FOLLY: A few years ago, a Lebanese restaurant named Las Gidi Express was in this space. I found it odd because Las Gidi Express doesn’t sound like the name of a Lebanese restaurant. The restaurant itself was pretty good, but before it existed in that space, there was the Goodies Restaurant that I never visited.  NOSA: I think that space is jinxed. Nothing ever survived.  FOLLY: Most people remember that there was Winners Supermarket before Hartley’s, and before Winners, there was Goodies. Word on the street is that there were disagreements between the owners of Goodies, court orders were involved, some people became Goodies, and the others became Winners.  NOSA: Does Goodies still exist? Also, how did Winners become Hartley’s FOLLY: I don’t have the gist on how Winners became Hartley’s or even related. Still, I’m happy that the whole Winner’s era is behind us in Lagos. I’m sure anyone who went into Winners that year will remember how piss-poor their inventory was. Hartley’s is really so good and has an extensive inventory.  NOSA: Now that I think about it, I don’t think I ever stepped into that place when it was called Winners.  Anyway…back to 343 Degrees North. FOLLY: We were thinking about going to OX for a review. I remembered that there was another restaurant opposite that I felt would be much better. NOSA: I hear OX is pretty terrible, so I’m not mentally ready to deal with setting our money on fire. COVID has stressed our bank accounts too much.  FOLLY: On the first impression, I thought 343 Degrees was an Indian restaurant - based on the decor out front, I recall two gold sculptures and the smell of Indian food. The menu, however, has a lot more than Indian. NOSA: Tbf, their website says they’re primarily Indian fare.  “A journey of an authentic experience of Indian cuisine intertwined with culinary art, designed to bring people of all walks of life together to celebrate culture and food in an elegantly chic ambiance.” — 343° NORTH WEBSITE FOLLY: It’s Indo-Chinese, Indian, Nigerian, Indian and Continental.   NOSA: I ask again…what is “Continental”? FOLLY: I’ve always wondered what Continental food is, so I Googled it. European food is continental food. Seems like a broad way to lump all the white man’s food, but that’s it.  NOSA: Oh.  FOLLY: From our experience at 343, the Italian food is their strong point, which might explain their wine and pasta night every Wednesday. Anyway, here’s what we ordered: Salt & Pepper Calamari Wasabi Mayo Shrimp Fusili Prawn Pasta Chicken Lettuce Wraps Butter Naan Cheese Naan Butter Chicken NOSA: They had an 11k lobster roll that I really wanted to try for science, but the waitress said it wasn’t available. I’ll be back.  FOLLY: We ordered in stages because the menu was so varied. We didn’t want to dive into one area entirely without knowing which was their strong point. We started with the Salt & Pepper Calamari and Wasabi Rock Prawns, both my choice.   Salt & pepper calamari is similar to regular fried calamari. Still, there are more spices - black pepper, garlic and sometimes hot peppers. I mostly see this on Asian menus, so I guess this fulfilled the Chinese variety that 343 Degrees wants to bring to their menu.  NOSA: I wasn’t the biggest fan of the calamari. There was just something about the batter that out me off.  FOLLY: The calamari was my favourite of the initial two, very well seasoned, and I loved the heat from the sliced peppers. I’d maybe have preferred the calamari as chunks instead of slices. Nonetheless still very good.  NOSA: Not by much, but I preferred the shrimp. Chicken Lettuce Cups weren’t that great either, but when I put the leftovers in Jollof the next day, it was hitting.  FOLLY: Someone will roll their eyes at me for saying this, and I truly deserve it, but the wasabi mayo shrimp had more wasabi than I thought it would have.  NOSA: Yeah, I expected more wasabi-flavoured mayo than mayo-diluted wasabi. I don’t know if that makes any sense. FOLLY: Same. I imagined a hint of wasabi in mayo and not the other way around, i.e. wasabi with a splash of mayo. It was just a little bit jarring; I know the name said it, so please just rolls your eyes at me. The shrimp themselves were good-sized fleshy chunks, so A1 on that.  Next, we intended to move on to the Italian and Continental sections, but they didn’t have Nosa’s choice, so he started frowning.  NOSA:  On brand for me.  FOLLY: I’d be the first to admit that going into it, I wasn’t sure about the pasta from 343 Degrees given that it’s mainly an Indian restaurant, but this was really good.  NOSA: They have a dedicated pasta night, so it had to be good, right? FOLLY: The menu didn’t give much away, just that it was fusilli pasta with shrimp in a pink sauce.  NOSA: Before you even go too deep, why is it served as though it’s a side lmao. Jokes aside, it was pretty good. Like, surprisingly good. FOLLY: The sauce was very garlicky and, on the whole, very well seasoned. I hope it wasn’t a fluke, but they have a pasta and wine night every Wednesday, so you could use that discount to check first. Fusilli pasta gets snubbed for being a simple pasta shape, but that’s unfair because the tight corkscrew shape really lets pasta sauce get in all the nooks and crannies.  NOSA: Negative points for the stale garlic bread, though. NEGATIVE. FOLLY: The biggest letdown for me at 343 Degrees North was the Indian food. NOSA: I usually trust Indian places when Indians actually dine in said place. But I’m so disappointed in the Indians we saw on the day because 343 Degrees did was lie. LIESSS. FOLLY: I’ve always been aware that dishes vary widely between North Indian and South Indian cuisine. There is a much broader variety in Indian cuisine than what we know, and it is widespread. It’s mostly North Indian cuisine that is popular in the United States and worldwide. You know how Americans love spreading their Americanized version of things through media.  In fact, it was on a Disney channel high school flick where the main character had an Indian best friend that I first learned about butter chicken. Of course, when her white friends tried butter chicken for the first time, they were waxing lyrical. That stuck with me, and when I saw Butter chicken on a menu the first time, I had to have it. Knowing this, I don’t want to write off the Indian food at 343 Degrees North as not good.  NOSA: You’re very diplomatic because the cheese naan was very mid as well.  FOLLY: I just want to assume that maybe it’s another region than I know. It could also be that the person in the kitchen wasn’t hitting the recipes like they were taught. FOLLY: We ordered butter chicken at 343 Degrees, but it was much thinner and a lot spicier than every single butter chicken I’ve ever tried.  Although North and South Indian cuisine is built from the same flavour foundations, the regions favour different ingredients and cooking methods from my research. As such, the end results often come out differently. Rich and thick curries with yoghurt dominate North Indian cuisine. At the same time, instead of bread, they favour a lot of rice in the South, so the stews tend to be thinner to accompany that. Honestly, this probably explains why at 343 Degrees North, they make and serve their Biryani with the dough seal (we didn’t order it, but I saw it).  NOSA: Why is the name “North” again? FOLLY: Maybe that’s what was available at CAC. FOLLY: The Naan here wasn’t puffy either; it was just thin and bleh. I don’t know if this is down to regional differences, but I will surely not order this one again.  NOSA: The cheese naan tastes like they forgot to put the cheese until the last minute. I prefer not to speak on this anymore.  ",
    "spendDetails": { "itemsBought": [], "totalSpend": 20000 },
    "link": "https://www.eatdrinklagos.com/review/343-degrees-north-hartleys-restaurant-vi",
    "single": true
  },
  {
    "restaurantName": "Cilantro",
    "restaurantAddress": "7 Musa Yar’adua Street, Victoria Island ",
    "restaurantPhoneNumber": " Phone",
    "review": " FOLLY: Unfortunately, or fortunately for Cilantro in Lagos, their reputation precedes them. They are famed as one of the best, if not the best, Indian restaurants in Abuja and Kano.  In my opinion, the Lagos restaurant hasn’t lived up to these expectations.  NOSA: The menu is just so many things and not any thing at the same time. Please, can they focus? FOLLY:  The menu threw me off because there was pizza. I get the random Continental items that make their way on to menus at speciality cuisine. Like grilled salmon, pasta, chicken and rice but pizza! I was genuinely surprised but let’s go on.  NOSA: It’s probably the same in the other cities because I can totally see them being a one-stop restaurant in Kano or Abuja. Especially Abuja because Abuja restaurants aren’t really popping like that.  FOLLY: There’s a standard order Nosa and I usually get at Sherlaton. It’s mutton biryani, butter chicken, cheese naan, butter naan and veg samosa.  We repeated that exact same order at Cilantro just to, you know, compare and contrast.  NOSA: Just leave the samosa alone. Abort mission. FOLLY: I much prefer the veg samosas at Indian restaurants. The way the meat is cooked (it’s scorched and crumbles) has never appealed to me. I love the moistness of the filling and the curried potatoes and chickpeas. Cilantro’s was decent, but I didn’t like the extra separation between the dough and the filling; it caused a bit of a challenge in eating and enjoying it.  Moving to our mains which were the butter chicken, biryani and pizza.  The butter chicken was solid, thick and creamy and pretty much velvety smooth. It was evident that it had been slow-cooked long enough for the flavours to really meld and really develop this very slightly sweet caramelization. It was delicious, especially with the naan.  NOSA: Yeah, that “sweet” thing stood out for me. It’s not a negative or anything, but it’s just something you should note.  FOLLY: We had both the butter naan and the cheese naan. The naan at CIlantro didn’t disappoint - it was pillowy and soft. As much as I love Sherlaton, the cheese naan at CIlantro is cheaper, and they give you a lot more than Sherlaton does.   NOSA: Their cheese naan is probably the cheapest one I’ve had in Lagos so shout out to them for that. They also pack in a lot of cheese in it so if you’re greedy, this will trap you. But I wasn’t really a fan of all that cheese for some weird reason. It just felt so…inconvenient, which is weird because every time I get cheese naan elsewhere, I wish it had more cheese. Maybe too much cheese is not a good thing.  The cheese naan didn’t let me down as much as the biryani, however. It was like eating plain boiled meat and white rice.  FOLLY: Unfortunately, the biryani was not good enough. I didn’t taste many of the distinct spices you’d typically get in a biryani like clove and cinnamon. The rice even looked a little bit too orange, like Jollof rice. It really wasn’t it.  NOSA: The pizza is not any good. No need to beat about the bush here. It’s not the worst I’ve ever had in Lagos, but this is a DoubleFour-tier pizza. I expected so much more.  FOLLY: The pizza toppings might have been too much for the base. The tomato sauce was also too much; I guess that’s how it ended up soggy. I didn’t enjoy this at all.  POSTSCRIPT FOLLY:  It’s very mid but it’s always full. NOSA: Don’t waste your money. There’s better Indian elsewhere and there’s absolutely better “continental” elsewhere.  VERDICT ",
    "spendDetails": { "itemsBought": [], "totalSpend": 13000 },
    "link": "https://www.eatdrinklagos.com/review/cilantro-indian-restaurants-lagos",
    "single": true
  },
  {
    "restaurantName": "The Seetle",
    "restaurantAddress": "9 Keffi Street, Off Awolowo Road, Ikoyi. ",
    "restaurantPhoneNumber": " Phone",
    "review": " FOLLY: Do you remember the There’s Rice at Home series that we used to post way back? Well, Anu Bello, from the videos,  is now the person in charge of the kitchen at The Seetle. She has extensive experience in recipe development and if you’ve ever paid attention to the menu at Craft Gourmet, you’ve probably seen her work in there too.  NOSA: TL;DR: Anu is kinda good at this stuff.  FOLLY: Not only at the food but, but also with cocktails. NOSA: A quick glance at the menu at The Seetle and you can already see her hands all over it. Plantain Hummus? Very very on-brand for the lady that gave us plantain lasagne. Even the Italian playlist that sounds like something out of the second season of Master of None is peak Anu Bello.  FOLLY: Beyond the pasta, the theme of the menu seems to be ease and comfort. Initially, we weren’t planning on getting any starters but the waiter upsold us. I was impressed at how suave and casual he was with it, unlike the waiters, you ask “what is good on the menu?” and immediately they point to the most expensive thing. You’re not that slick, sir.  After we had placed our orders, he asked if we’d be getting any starters and I responded that I didn’t notice any on the menu then he pointed them out and we ended up ordering the Plantain Hummus to start. NOSA: Only right, tbh.  FOLLY: The hummus as the name suggests has plantain as its main base as opposed to (or together with) chickpeas. It still tasted a lot like hummus as it was rich and garlicky, and altogether very delightful.  NOSA: As far as texture goes, this was closer to pounded yam than it was to hummus. That’s not shade, by the way. I just want to give you a bit of context.  FOLLY: Yes, it wasn’t as smooth as a normal hummus expectedly because chickpeas have more water than plantain. I’m wondering though if more oil will liquefy the consistency so it’s more of a dip than a spread.  NOSA: Of everything we had, this was probably my favourite thing. I like how adventurous it is and while it might not be perfect, it’s a couple of recipe tweaks away from perfection.  FOLLY: Additionally, at the Seetle, they are so generous with the lamb on their hummus (unlike our friends at Slow) which was packed with flavour. I’d definitely order this again. FOLLY: Next, we had breakfast which was the English Breakfast for me and the Bodega Bagel for Nosa.  It’s hard to review an English Breakfast as there isn’t a technique/recipe except for maybe the quality of the eggs. For the most part, what really makes the difference between spots is the quality of the sausage, bacon, and hash browns.  Is the bacon thick cut? Is the sausage a Cumberland sausage? How are the hash browns cooked? That’s how I’d judge. At Seetle, the bacon was meh, thin, and crispy. The sausage was meh but the hash brown was great - very buttery. I wish I’d had two.  In Lagos, my money is still on Churchill for the best English breakfast, however, if you’re an aesthete then I can see why not. Especially, if you’re trying to come with your family after church on Sunday, you’re not the target market for Churchill.  NOSA: The Bodega Bagel was not as exciting as I thought it would be.  Bodega Style Bagel - Everything bagel, eggs, bacon, cheddar, hot sauce, ketchup It’s probably a “me” thing or maybe it was the absence of the cheese and the sausage out of nowhere that killed it for me. Not saying it was bad, but it just wasn’t very exciting.  NOSA: The bagel, minus the other stuff, was fantastic. I wonder if they bake it in-house or it’s outsourced. if you have any idea, please drop a line in the comments because I really want to try the bagel again. As for the sandwich, it does a serviceable job, but it’s not as good as it should be. Now that I think about it some more, I think it’s the lack of cheese that killed it for me.  The Cumin Lamb Pasta would’ve made up for it, but it was shockingly not the one for me either. I’d heard a couple of good things about the pasta at Seetle so I expected a lot.  FOLLY: I’m thankful we ordered a starter because the pasta dish was smaller in size than we imagined and we didn’t like it that much.  NOSA: What was that portion about? Maybe it’s because we went with fazzoletti and not tagliatelle. The latter is probably a larger portion or maybe I’m just greedy. It’s neither here nor there.  FOLLY: It wasn’t our initial first choice, so there was a bit of that letdown lingering.  NOSA: The Ragu was our first choice but apparently that was sold out when we visited so we had to settle for the Cumin Lamb Pasta. FOLLY: It had strong flavours as expected it’s a Cumin Lamb Pasta. Both cumin and lamb have strong flavour profiles on their own so getting a Cumin Lamb pasta you need to know what you’re getting yourself into.  NOSA: I clearly didn’t know what I was getting into because my first bite knocked me back a couple of steps. Yeah, I get it’s a cumin pasta, but Jesus, this was overwhelming.  FOLLY: There was just a lot of it that it ended up tasting like a marinade that was coating every inch of the pasta and also the consistency was grainy and pasty like a marinade. I imagine that I would have liked it a little more if there was less of the sauce in the dish, especially since I like Cilantro, which is a dominant flavour in it. The intensity was fine but there was just too much of it for the five pasta sheets.  NOSA: It reminded me a lot of the yakisoba at Koi for some reason. They don’t taste alike or anything. They just have this shared kinship in aggressive flavour. I’m a million per cent sure that the ragu would’ve been a lot better than this. The fazzoletti was perfect, but the goddamn cumin is just so much FOLLY: We got dessert, but it wasn’t what I expected. NOSA: In their defence, I warned Folly but she didn’t listen. FOLLY: It turned out it’s a Biscoff tiramisu tart and not a classic one. I likely wouldn’t have ordered it had I known.  POSTSCRIPT FOLLY:  I’d go back to try another pasta. NOSA: I like Anu and i’ve had delicious stuff from her so I'll definitely visit again to try something else.  VERDICT ",
    "spendDetails": { "itemsBought": [], "totalSpend": 1500 },
    "link": "https://www.eatdrinklagos.com/review/the-seetle-ikoyi",
    "single": true
  },
  {
    "restaurantName": "Black Pepper Steakhouse",
    "restaurantAddress": "Eko Pearl Tower, Eko Atlantic, Victoria Island, Lagos. ",
    "restaurantPhoneNumber": " Phone",
    "review": " FOLLY: Driving into Eko Atlantic took me back to EatDrinkFestival in 2016.   NOSA: Eko Atlantic doesn’t seem to be panning out as the owners expected it to in 2017. COVID plus the economy tanking has done a number on everyone’s pockets. BUT, I’m sure there’s something we can do to help each other, i.e. let’s have the Festival in the location again.  FOLLY: Eko Atlantic, please call me. Nobody has money in this economy to buy your plots or land or build all the bank HQs they told you they’ll build years ago. Let me have the festival of my dreams in Eko Atlantic, please. I promise not to be like those fashion people that messed up your space and made Chairman cancel everything that year. There aren’t many things that I’m proud of but pulling off that festival every year since 2015 has been the highlight of my life. Sometimes I’m terrified that it’ll never get to happen again in a post COVID world but I don’t know what I’d do with myself without it.  FOLLY: On Blackpepper, I’ll start with the menu and space suggest it was designed for group dining.  There are a number of things in sharing sizes that I feel will work nicely for groups of 3 or more. And even more so cause it’s so pricey, it makes sense to order and eat family style so no one gets stuck with some very expensive thing that they don’t like.  NOSA: The menu at Black Pepper is infinitely better than their previous attempt at a restaurant. Like, much much better. In fact, even the space looks like they were trying to be serious this time instead of Yahoo Boy outpost.  FOLLY: To start, we chose the Smoked Beef & Cheddar and Butterfly Shrimps.  The smoked beef and cheddar is simply thinly sliced and smoked topside with a healthy helping of cheese. This was a really easy starter and tasted great too. It could be improved with a sharper cheddar for flavour because it was bland and needed salt and pepper.  NOSA: I thought this would be some cold cut type thing and I was plenty disappointed. I think this one plate epitomizes the whole restaurant - ostentatious for no reason at all. A sizzling plate for something so bland? Jesus. I swear I made this thing during the lockdown in my house.  FOLLY: I was incredibly offended by the butterfly shrimp. In hindsight, the menu did say butterfly shrimp and not prawns but cue that Maraji meme. Just look at how tiny the shrimp are. I couldn’t even be consoled by the flavour because there was absolutely nothing going for these. NOSA: Very disrespectful, man.  FOLLY: For mains, we decided to split a short rib burger and a 1kg beef tomahawk (medium-rare).  NOSA: They do a whole fake Salt Bae song and dance for the short rib. The chef comes in to pull out the bone in the short rib to show how tender the thing is. Our chef on the night was a bit uninspired. Man didn’t even wait for us to whip out the camera. He just pulled the bone out and went on his way. He could’ve done this in the kitchen if he wasn’t about the show, to be honest.  FOLLY: A lack of seasoning seems to be a running theme here because the burger was also bland and dry. The bigger challenge for me with the burger, though,  was the dryness.  The burger was simply meat, bread, and lettuce. No sauce, no cheese, nothing. There also was really no need for the burger to arrive with a giant bone only for the chef to pull it out at the table. They could have pulled the meat, seasoned it, added a sauce or something. The meat was so desperate for seasoning, the cow called out to me.  NOSA: I think that’s what the BBQ sauce on the side is for. FOLLY: But a 12,800 burger shouldn’t rely on my resourcefulness to taste good.  NOSA: For all of Folly’s complaints, it was a very soft bun. Near perfect even. The short rib was also the most tender I’ve had in quite a while.  FOLLY: Two things can be true.  NOSA: TL;DR - The burger is not for everyone. FOLLY: The tomahawk was the only bright spot about our dinner at Blackpepper. The chef did a little show in slicing the steak and pulling the bone out for this as well.  NOSA: If there’s anything #CertainDemographics know how to do in Lagos, it is make a mean steak. This didn’t disappoint at all. Although the waiter thought I was mad when I asked for it “medium rare”. I’m not spending over 25k on meat for it to be suya hard, please. FOLLY: The steak was tender and soft but I did wish it was a bit more marbled for the price. I ended up just favouring the slices with more fat. NOSA: If you check out Black Pepper, it should be for the steak and another else. The tomahawk made up for that mess of an appetizer.  FOLLY: I feel that as a group we could have tried more things from the menu at Black Pepper without being wasteful as there’s only so much we could both eat ourselves.  POSTSCRIPT FOLLY: It’ll be a great idea for group dining. The menu is a a lot for one person or two people eating alone. NOSA: I’d visit again, but only if I’m not spending my money. They only pay me one salary so I’m not about this. VERDICT ",
    "spendDetails": { "itemsBought": [], "totalSpend": 37500 },
    "link": "https://www.eatdrinklagos.com/review/black-pepper-steak-eko-atlantic-pearl",
    "single": true
  },
  {
    "restaurantName": "KOI",
    "restaurantAddress": "3 Babatunde Jose Street, Victoria Island, Lagos. ",
    "restaurantPhoneNumber": " Phone",
    "review": " FOLLY: For all that it offers and claims to offer, of which on top of that list is an ex Nobu sushi chef, I have not been adequately whelmed by Koi on any of my visits.  NOSA: “Visits”.  In plural. Because we wanted to be really sure before we called it very mid.  FOLLY: The menu has 14 main sections but if I could summarize it’s small bites, salad, maki rolls, sashimi,  sushi and tartare, mains, and desserts. We were both really keen on Koi before visiting.  NOSA: The Koi hype machine kicked off when they started doing those “private” parties before they formally opened. Big FOMO move there. Koi is like the Clubhouse of Lagos restaurants.  FOLLY: I immediately wanted to get as many things on their menu especially their signature items that are eponymously named. On one of our visits, but not the most recent one, we also tried their nice but pricy drinks. The drinks are small in volume - very important note.  On the food, Nosa insisted on the bao, though there are many other things on the Koi menu that I’d rather spend N9,000 on than three tiny wagyu bao buns.  NOSA: If the menu has bao on it, I’m ordering it. Sorry, not sorry. FOLLY: I think Koi is too upscale of a restaurant to serve anything other than perfectly silky, smooth bao with a soft and fluffy interior. While the wagyu short rib was good, yes, just about good, the bao itself was over-proofed and overcooked.  We’ve had this bao multiple times and it was consistently mid. NOSA: I’ve had A LOT better in Lagos. You don’t even have to venture too far, Kewa’s Kitchen makes a better one. By far.  Honestly, this might be the running theme in this review. Koi has things that sound exciting, but every time, there’s always someone else in Lagos that makes a better one at the fraction of the price.  FOLLY: We ordered fewer rolls and sushi on this visit than the previous time because we wanted to also get some mains. For rolls, we tried these: Spicy Hot Roll Ura Shrimp Dynamite Ura Grilled Salmon Skin Futo Koi NOSA: They don’t have an extensive selection of rolls either. It’s RSVP-level. Just a heads up.  FOLLY: The spicy hot roll is the one with salmon chunks topped with spicy mayo on top of a plain rice roll. The description makes this sound way more exciting than it is as it is a bit of a logistical challenge to eat it.  NOSA: This is one of those things that looks better in pictures than it actually tastes. It starts exciting but you hit the peak of your marginal utility curve very early. FOLLY: We said this on Instagram and someone was all up in the comments about how sushi isn’t eaten in bites but all at once. Yawn.  Loved the salmon though. The Ura Grilled Salmon skin was by far my favourite in this lot. I think that’s because of the saltiness of the crisped salmon skill in the roll. It added a bit of texture to what is usually a mono textured experience - everything in a sushi roll is usually really soft - the fish and the rice.  FOLLY: The Futo Koi roll is truly a product of Ojukokoro (watch the film on Netflix) because it combines white fish, salmon, and crab in a single roll.  NOSA: It’s just a lot of flavour in your mouth at the same time. Definitely not worth the greed. FOLLY: Not pictured because we didn’t have it on this visit but Koi has fantastic shrimp dynamite that you just want to keep eating but it finishes in a flash because the portion is tiny.  NOSA: The Ura Shrimp Dynamite was my favourite of the lot. This is the one you should order if you do wish to burn your money at Koi. FOLLY: The thing about Koi is that they only have 5 main menu items - salmon, black cod, yakisoba, wagyu fillet, and wagyu rib eye. On another day, I might have ordered the salmon, but I felt rather noodle-y so I ordered the shrimp yakisoba. I’m actually surprised Nosa didn’t jump at the wagyu because he has a thing about ordering the most expensive item on the menu for science.   NOSA: I probably should have. The yakisoba was an utter disaster. FOLLY: It was terribly salty like someone had mixed up the teaspoon and tablespoon measurements in the kitchen. We hardly ever send anything back but if I’d eaten this I’d probably have been sick or something from having so much salt.   NOSA: I’ve had damn near the same thing at Izanagi and it wasn’t this bad. Actually, I shouldn’t be calling things “bad”. Maybe the problem is me. The yakisoba at Koi is just not for me. We had to push it back to the kitchen. FOLLY: I hope they tasted it. In any case, they brought a new one out in no time. It looked a lot paler than the pictures above and the waitress said they took all the oyster sauce out altogether. It tasted sour and I definitely preferred it reheated up for dinner later that day - there’s just something about leftover noodles.  On this final visit to Koi, we definitely ordered fewer things than before and spent less money because we were tired of disappointment.  I still ordered the matcha cheesecake though because I wanted to “check something”. Both times I’ve had this the biscuit base was always frozen, they should sort out the storage on this because it makes it so difficult to eat. I had it packed up and took it home - left it out at room temperature for a little bit and it was softened enough to be enjoyed without needing a knife to cut through a rock-solid biscuit base.  NOSA: I had not too much to complain about this one actually. It wasn’t memorable and I wouldn’t order it again, but it wasn’t the worst.  FOLLY: I’d never had a matcha cheesecake before this one. On this texture, it was very slightly powdery. Taste-wise it was very full-bodied with a nutty sour taste that lingered. I, honestly, wasn’t crazy about it. NOSA: I wonder why these “high end” restaurants in Lagos even bother with dessert. It’s almost always never any good.  FOLLY: It’s difficult for me to say Koi is about the experience because “what is the experience ?”. It’s an expensive restaurant that you’d want to go to for a special celebration that you feel you should spend a lot of money on because that occasion is the exact type of celebration where one spends money on. That’s simply capitalism, beloved.  NOSA: That’s pretty much where I stand with Koi too. It looks nice in pictures but it’s not worth the money you spend. The cocktails are passable so it’s a half-decent spot to grab drinks after work. I’d rather spend this money at The Observatory. At least, the food there was worth a revisit.  POSTSCRIPT FOLLY: It’s glam but I’d personally prefer to spend that money elsewhere on better food at another similarly priced “glam” Lagos restaurant. VERDICT ",
    "spendDetails": { "itemsBought": [], "totalSpend": 30000 },
    "link": "https://www.eatdrinklagos.com/review/koi-japanese-sushi-lagos",
    "single": true
  },
  {
    "restaurantName": "THE OBSERVATORY",
    "restaurantAddress": "15A Admiralty Way, Lekki Phase One, Lagos. ",
    "restaurantPhoneNumber": " Phone",
    "review": " FOLLY: I’m starting with the bottom line upfront. I’ve struggled personally to write this review because I didn’t like Observatory and the last time we reviewed a project Chef Obehi was involved in, it was taken as a personal attack.  NOSA:  You know what? I can understand the beef.  We visited Pitstop a week before she took over the kitchen and our review went out the week she started so perhaps it looked like a personal attack on her food and person, which it wasn’t. It’s just a bit weird that maybe she unintentionally turned her attack dogs on us. I mean, Chef Benedict took time off of owing everyone in Lagos to chime in. That hurt my feels, personally.  FOLLY:  The Observatory wasn’t terrible. It’s likely more me than them but there are some things that could be better like the table layout situation.  NOSA: I don’t feel so strongly tbh. The only thing I proper hate about Observatory is the way the tables are laid out. If you get in here, make sure you get one of the normal looking tables or you’ll find yourself staring deeply into the eyes of a stranger as you take a bite of your main. Not the worst thing if you’re into that creepy kind of thing. As much as I hate the seating, I love the space. It’s so beautiful at night once you ignore the visible A/Cs. That’s my Lagos pro-tip by the way. If a restaurant can’t be bothered to hide the A/C, then you can forget about the food.  FOLLY: Just to state the obvious, the Observatory Smokehouse isn’t just a name, it’s the cooking style that’s used in almost everything on the menu except maybe the dessert.  NOSA: Everything is smoky, breh. This is Chef Khudu’s dream restaurant. It’s nice at first but after a couple plates, you kinda want them to chill out a bit.  FOLLY: We started with Smoked Tozo Pie, Smoked Snail, and Tozo Reuben Pastrami.  NOSA: Heads up, there’s tozo all over the menu. Come prepared.  FOLLY:  You’d be wrong to think the description of the small plates on the menu is literal because the burger below is not small at all.  NOSA: The burger is a full on main. Don’t let that “small plate” thing get you carried away. It is no appetiser at all, which is a sharp contrast to the small plates at SloW. The burger is messy as it gets. It’s very Southern (like, America) style and the brisket combined with the slaw is a delight.  Of the small plates, the smoked snail was my favourite.  FOLLY:  The snails were tasty. The snails themselves were so tender, the saucy was smokey and spicy and honestly unlike anything I’ve ever tasted.  NOSA: Make sure you order this when you come here and ask for extra bread rolls as well because you’re going to need it. It sneakily packs a lot of heat so come prepared for that as well.  FOLLY: The smoked tozo pie surprised me because I imagined something much more similar to the tozo pie on the Ile Eros menu which is served as a pot pie. However, these were mini pies similar to a meat pie. NOSA: The vinaigrette with the tozo pie is a sleeper hit. Like Folly, I wasn’t expecting something empanada adjacent.  FOLLY:  It was good but I would be lying if I didn’t feel a bit let down by this. I was keen on a buttery and flaky crust with a saucy filling. I loved the vinaigrette that dressed the side salad.  NOSA: I get that it’s a smokehouse, but by the time you hit the mains, the “smokiness” of every single plate becomes tedious. Like, bring some other trick to the table.  FOLLY: On the mains, it was smoked turkey lasagne for me, mac & cheese for Nosa.  FOLLY: I had expected that the smoked turkey lasagne was going to be ground turkey instead of ground beef in a regular lasagne. It was actually pulled turkey which was a nice break from the normal way of things. That was about the things I liked because taste-wise, it was way too stewy and peppery for me to enjoy as a lasagne.  NOSA: I had to eat the lasagne the next day because I was over the “smoke” by this point, which made me appreciate the Mac n Cheese even more. It’s a side but you should definitely get it with one of your mains.   FOLLY:  If there’s one thing I’ve come to appreciate after visiting so many restaurants, I don’t like when small things come in big plates or rectangular items are served in circular plates. Let’s say shawarma in a round plate.  NOSA: Don’t think they paid too much attention to that part.  FOLLY: I would like to see the Observatory could play around with the dishes that items are served in. It could be that they inherited the serving ware from BLD but I don’t know if that’s the case.  As someone that takes A LOT of pictures of food, I don’t feel the plates being used at the restaurant lend the food to being presented, styled and photographed in the best light.  NOSA: As harsh as Folly sounds, I can’t bring myself to hate Observatory. There’s a lot that could’ve been improved, but I genuinely liked it and I’ll visit again. Maybe I’ll force Folly, but it was alright with me. A couple of friends understandably didn’t like it but that tozo pastrami burger cast a spell over me. I’m sorry, friends.  FOLLY: It’s really not personal but I am concerned that it is going to appear as though it is. I’ll definitely try it again though.  POSTSCRIPT FOLLY: It may be that Observatory isn’t for me, but I didn’t really enjoy it as an experience or find it memorable, all the food was okay.  NOSA: I can see why people won’t like it, but I liked it. They need to bin the shisha panhandlers, however. VERDICT ",
    "spendDetails": { "itemsBought": [], "totalSpend": 15000 },
    "link": "https://www.eatdrinklagos.com/review/2021/3/1/review-the-observatory-lekki-lagos",
    "single": true
  },
  {
    "restaurantName": "SLoW",
    "restaurantAddress": "2 Musa Yar' Adua Street, VI, Lagos. ",
    "restaurantPhoneNumber": " Phone",
    "review": " FOLLY: It wasn’t a long time ago that all new Lagos restaurants were following the same design aesthetic with Eames chairs, pendant lights, neon lights, and the iconic photo backdrops. In fact, restaurants optimizing for Instagram isn’t a Nigerian thing, it’s increasingly being documented that restauranteurs are more often factoring being a social media magnet into their restaurant design.  NOSA: …which is not the worst idea. Look at Ms. Denike of Tearoom and both her spaces. People still go there.  FOLLY: The first thing you notice about SLoW is the bar, unlike most other restaurants where the bar is off to the side. The bar and the drinks are the best things about SLoW and it’s right front and centre.  NOSA: There’s a Gin & Tonic section of the drinks menu with about eight different G&Ts.  FOLLY: I believe laying out the restaurant in that way and having the bar at the centre of the floor illustrates that it’s really the heart and soul of the restaurant. All other elements of the design, the tile patterns on the floor, deeper tones in the leather that are contrasted with white and cream, and the banana leaf plants are all very reminiscent of the new world.  NOSA: There’s also a “live band”, but not like the razz one at Eko Hotel. These ones are a real jazzy bunch so they actually positively contribute to the atmosphere in the place. Like a speakeasy in New York  FOLLY: It’s all very stunning, and before your food arrives, you just want to spend all your time taking pictures of everything.  NOSA: This is honestly my favourite space in Lagos right now. If there was no corona and we were all back in the office, this would be perfect to come chill after work. Maybe the first date with a girl you met at a wedding over the weekend. Both of you meet up after work and grab a couple of drinks. Nothing too deep.  FOLLY: About the bar, the first time we visited SLoW in 2020 before the lockdown when we arrived, the hostess asked us if we’d like to sit by the bar and have drinks before moving in for dinner. Over dinner, when the restaurant manager came over to our table he spoke about how that was a thing they intended to continue.  FOLLY: They didn’t make the same offer time, and we didn’t ask, however, I imagine that’s because the restaurant was busy and guests without reservations were allowed to have drinks at the bar instead. NOSA: Corona almost took SLoW from us and deprived everyone of that experience. In our Unit Economics episode with Nahi, of RSVP, he talked about how Lagos shut them down before the lockdown was announced and how he had to let go of all SLoW staff. Before they reopened about a week ago, they had to rehire the entire staff…down to the chef.  FOLLY: We eased in with drinks from the G&T menu. I had the Herby and the Floral in quick succession. Nosa reordered an old fave - Citrus & Rosemary x 2.  Our friend had the Slow and it was the best, I have no idea how they get the smokiness of the pepper into the drink. I thought they’d apply heat to the pepper and then place it into the drink but the pepper looked almost untouched. FOLLY: We ordered a lot of appetizers thinking that’s where the party was at, it’s not. From our experience, the real treat at SLoW is the mains. To start we ordered: Guacamole, Smoked salmon flatbread, Spicy lamb  flatbread, Rock shrimp tacos. Brisket tacos. Patatas bravas FOLLY: The best things were the flatbreads, the brisket tacos and the chimichurri with the patatas bravas.  NOSA: The flatbreads didn’t do too much for me. I got the same one I ordered over lockdown and it just didn’t feel the same. The lockdown one felt more like pizza’s cousin than this one did. The tacos aren’t plated like you’d expect tacos to be plated so prepare for that surprise. Oh, and don’t expect adult-sized tacos either. It’s an appetiser for a reason, but I’d order this if they ever super-sized it and made it a main. The brisket tacos, in particular, are heavenly. The shrimp, on the other hand, is a bit forgettable.  FOLLY: There must have been a thing with the bitterness of the limes in the kitchen because everything they encountered that was on our table was a bit too sour.  So this affected the guacamole and the rock shrimp tacos. NOSA: Yeah, the sour overwhelmed the guacamole. I really loved it when we ordered it before the lockdown. Same reason I ordered it on this occasion too. I’m chalking this up to a bad batch of limes.  FOLLY: The patatas bravas were just okay and were a simple side to accompany everything else we had.  NOSA: Don’t remember it lol.  FOLLY: We really should have gotten the SLoW chicken and we regret it in hindsight because we were told it’s that good. Don’t worry, we’ll go back in a week or two and report about it on Instagram.  For now, you’d have to settle on our thoughts for the Charred Seabream and the Lamb Chops which were both chef’s kiss. NOSA: At first glance, the mains don’t look too exciting on the menu. Maybe that’s why some restaurants have pictures because they know it’ll catch your attention.  Another thing, most of the mains don’t come with sides so have that in mind when you’re ordering. You don’t want a whole fish to land on your table and there’s nothing to accompany it.  FOLLY: I’m that person I judge for not reading the menu, so I didn’t know the sea bream was whole so I when it first arrived at the table. At first, we were like ehhh but when we tasted it we were excited! It’s not really a hot take if it’s the truth but most “point and kill” we eat in Nigeria is over seasoned and then all you end up tasting is Maggi and Pepper. One exception though is at Atmosphere and maybe Cubana.  FOLLY: Most fish do not need a lot of seasoning to taste good because fish takes on flavour very well. Exceptions to this are the oiliest of fish which have a very rich and dominant flavour profile. However, most white fish don’t need that much seasoning especially when you’re cooking with aromatics.  That said, the dominant flavours in the Charred Seabream were lemon, parsley, and ginger. I also know we might get a lot of this on Twitter but yes the fish looks a bit like stew, ewedu and gbegiri. When you see it, you can’t unsee it. It didn’t taste like stew, ewedu, or gbegiri though. The green stuff is chimichurri, the red bit is what we believe is the Argentinian chimere, and the rest is olive oil.  NOSA: That chimichurri did things to me. Heavenly. FOLLY: On the lamb chops, we ordered them medium rare and it was perfect.  NOSA: This is a pro tip. Make sure you tell the waiter how you want your lamb cooked. They might ask you, but I’ve seen complaints from people that they didn’t get asked. FOLLY: It wasn’t missing a beat in seasoning. I couldn’t taste all the seasoning but I feel like I got some rosemary. The potatoes had a hint of curry and turmeric and were definitely cooked in some meat fat because they were so flavourful.  FOLLY: Like RSVP the desserts on their early menu didn’t wow me, I’m confident just like RSVP this will improve in the weeks and months to come. NOSA: We got some coconut rum thing and I honestly can’t remember how it tastes.  ",
    "spendDetails": { "itemsBought": [], "totalSpend": 25000 },
    "link": "https://www.eatdrinklagos.com/review/slow-restaurant-victoria-island",
    "single": true
  },
  {
    "restaurantName": "WOKS",
    "restaurantAddress": "17 Oju Olobun Street, Victoria Island, Lagos. ",
    "restaurantPhoneNumber": " Phone",
    "review": " NOSA: I thinking about it the other day and I actually can’t remember what life was like before the Blowfish restaurants. It almost feels like they’ve been here since forever. Sometimes they lose member like Picolo Mondo (sp?) that year, but another fills up that slot in no time.   FOLLY: I don’t know whether it’s interesting of fascinating the way they always have a minimum of two restaurants in a single property. They know rent is expensive so why not do more with less. NOSA: They’ve figured out this Lagos hospitality thing.  Hospitality is undoubtedly one of the industries hardest- hit by the COVID-19 pandemic globally as the first and second quarters of 2020 saw grounded flights... NOSA: Over the summer, if you can call it that, Blowfish did some rejigging again. Out went Purple, their Asian fusion property, and in came Woks…their new Asian fusion property.  Yeah, I don’t know what’s going on either. FOLLY: I think we can call it “over corona”.  I didn’t find that they changed much to be quite honest, except maybe the number of seats in the restaurant and the positioning of the door.  “Our vision is simple, bringing you “the world in one place”. Woks is a journey through Asia. A fusion concept, which brings together the wonders of Thai spices with Indian tandoor and Chinese wok cooking techniques. ” — WOKS, AS DESCRIBED BY THE MENU NOSA: Sooooo…  it’s still Purple? FOLLY: Yes, but they printed new menus. NOSA: Like Purple, Woks is Asian fusion with basically just Indian. If we’re keeping it buck, it was just a renovation and change of name. The menu has a sprinkling of Chinese and Thai, but it’s largely dominated by Indian. Not like I mind or anything because Indian food is great. I just don’t get why Woks is going the same route Purple went when they couldn’t just honed in on the Indian stuff.  FOLLY: They should have rebranded as an Indian restaurant and stopped making everything else because they aren’t very good at it. NOSA: Running through the menu, I spotted spring rolls for N10,500 and, of course, I had to order it. Stupidly expensive things on Lagos menus are my kryptonite. I just have to find out why it’s so expensive. I can’t stop myself.  FOLLY: I usually try to convince Nosa against it so we don’t waste money but he doesn’t listen.  NOSA: Was it worth it? Nope.  FOLLY: Not even a little bit.  First of all, vegetable spring rolls are the best type of spring rolls. I don’t even think it’s worth it to pay an extra N100 for chicken or beef spring roll. And now, these are N2,625 per spring roll, just absolutely terrible.  I particularly didn’t like them because they were dry. It was a steamed spring roll encased in a very crispy spring roll wrapper. The roof of my mouth was yelling.  NOSA: Woks didn’t even pretend and give us the shrimp + mayo combo you get at weddings. This one was dry as hell and to make things worse, our waitress forgot the dipping sauce it came with just like she forgot (we forgot too tbh) our takeout at the end of the meal.  FOLLY: Funny, not really funny but I said to Nosa that they didn’t even give us a dipping sauce the waitress emerged with a dipping sauce that was to accompany the spring rolls. She said she had forgotten it in the kitchen. We were actually already on the main course when she remembered so it was quite a long time and we had eaten all the spring rolls.  NOSA: I know corona has hit everyone hard, but this is not the choking I signed up for.  FOLLY: I even doubt every much the dipping sauce would have rescued these though because, at the very least, the spring rolls needed mayo. NOSA: The chicken satay wasn’t much better. Sure, it was cheaper but it might have been a bigger waste of money than the prawn roll. The chef made the daring decision not brine the chicken at all.  FOLLY: Or season it or even microwave it properly. One of the skewers was still cold. Lagos restaurants like Woks need to do a whole lot better in terms of value for money. NOSA: If you hate us, just say it, chef.  The Indian is where Woks excelled, as expected. The portion is smaller than what you’d get at a Sherlaton, but the Butter Chicken was divine. FOLLY: I mean I won’t go as far as calling it divine. It was good but it had a slightly bitter taste so I believe they might have burnt the dry herbs. The naan was good, and it would have been pretty tough to screw that up.  NOSA: The less said about the Pad Thai, the better. Chef Fregz was way too nice in his review. The Pad Thai was bad BAD.  FOLLY: It was an okay onion and noodle stir-fry but a Pad Thai it was not.  NOSA: Why all the onions, mate? FOLLY: I think that Woks is good for Indian food with ambience. If you don’t care about ambience, or you’re planning to takeaway. I strongly advise you to quietly drive out of Idejo street and back on to Adeola Odeku so you can make the 2 minute trip to Sherlaton instead.  POSTSCRIPT FOLLY: I was very disappointed as we were leaving. I felt like I wasted money.  We did order champagne though so that was nice. No thanks to Woks for that though, that was all Moët. VERDICT ",
    "spendDetails": { "itemsBought": [], "totalSpend": 12000 },
    "link": "https://www.eatdrinklagos.com/review/woks-blowfish-victoria-island-lagos",
    "single": true
  },
  {
    "restaurantName": "CAFE DE FLORE",
    "restaurantAddress": "12 Glover Road, Ikoyi, Lagos ",
    "restaurantPhoneNumber": " Email",
    "review": " FOLLY:  So that hiatus was definitely unplanned, and so coming back to writing reviews was a bit challenging. That said, if we go AWOL like that again, y’all should just take it as an unannounced retirement.  NOSA: Corona really tried to stop us from flourishing. SMH. FOLLY: In the past few months, we started a podcast and we got a chance to speak to some amazing chefs and business owners about how the pandemic affected their business. They also got to speak to us off-air about all the things they hate about restaurant review blogs and Instagram pages, and the culture we have created, and they absolutely hate it.  Soz, restaurants. NOSA: Corona made us kumbaya for a bit. Nobody was banning me from their space. Good times.  FOLLY: Anyway, they said we have a responsibility, which to be honest they’ve always said. I disagreed then, but I see it now.  Again, soz restaurants. NOSA: Yeah, we’re going to be more responsible now and whatnot.  FOLLY: There are quite a few restaurants that have opened since we’ve been away. Nosa picked Cafe de Flore, so off we went. I blame Nosa for everything that happened afterward.  NOSA: Cafe de Flore is the perfect place to come back with. I mean, look at the Google reviews. Last year, we probably wouldn’t have checked it out but things are different this year.  Cafe de Flore sits in the same space Sophomore Cafe, of blessed memory, used to be in. On a mildly related note, we should probably do a recap of restaurants that COVID took away from us. FOLLY: I had seen a tweet or two that people were disappointed with Cafe de Flore but it looked okay on Instagram. Chef Fregz also recently posted that he’s the chef there, so I assumed it couldn’t be that bad because Fregz wouldn’t associate his good name with a disaster, I was wrong.  NOSA: I honestly don’t get why Fregz let his name touch this. It’s run by the same person/team behind the infamous Tea Room in Lekki. Small due diligence and you know these are the vibes to avoid.  On Cafe de Flore, the name rips off a famous Parisian coffee shop. A bit like how Tea Room is a blatant copy of Elan Cafe, so I guess it’s all on-brand for the establishment. This is enough to avoid it, to be honest. Any business that runs “I’m in Nigeria, they won’t catch me” is one you should avoid on GP.  FOLLY: We didn’t get any starters because the restaurant is ridiculously expensive.  NOSA:  Like Tea Room, it’s great for Instagram pictures so maybe that’s what you’re really paying for. The owner knows Lagosians don’t care too much about the food, so Cafe de Flore is fully optimised for Instagram. 100 likes guaranteed.  FOLLY: Actually, not fully true on starters. Nosa tried to order the lamb sliders and it wasn’t available. We weren’t going to pay N5500 for chicken lollipops so we ordered mains only. Anyway, I don’t want to complain too much about the price because it’s insult that will follow next.  “WHy dIdN’t yOU leAvE iF iT wAS toO exPenSIve fOR You” NOSA: Our order: Fried Chicken Burger for me, Blueberry Pancakes for Folly, the Lamb Ragu and White Fish for our dates.  FOLLY: Another thing that was downright criminal about Cafe De Flore is how they replace the duck in their Duck & Waffle with chicken main and still charge N10800 for it. NOSA: That duck is never going to be available so it’s time for everyone to be honest with themselves.  Don’t waste your money in Cafe De Flore btw x. No be by foreign name 😷 — D.E (@DD_Eto) December 31, 2020 So a restaurant in lagos denied some ladies entry because of “indecent dressing” .  Cafedeflore ..  Wtf is that? Indecent dressing? — Yemoja (@pam_E_chic) January 14, 2021 FOLLY:  The pricing at Cafe de Flore is not commensurate with the value.  NOSA: Not worth the wait either. And it’s a VERY long wait for your food. FOLLY: As you might tell from the pictures, the pancakes were a cross between a crepe and fluffy pancakes that didn’t rise properly. NOSA: They tasted like plastic to me.  FOLLY: That would be an accurate description, it was very dense on the inside. Due to a clear imbalance in the recipe, the pancakes didn’t rise, were dense and chewy on the inside. And the presence of baking soda announced itself in a very bitter way.  The eggs were eggs, not overcooked but good enough. The sausage notably wasn’t a smoked Russian as the menu advertised. However, much offense wasn’t taken because at least it wasn’t a frankfurter.  NOSA: Let me not lie, I had no idea Russian sausages were a thing so shouts to you, Cafe de Flore. FOLLY: The berry compote was the standout. Perhaps, Chef Fregz made it for them before taking his leave so they had no opportunity to mess that up.  NOSA: Maybe he should have helped a bit more with the chicken burger. The fried chicken had more batter than actual chicken. If I knew this was what I was paying for, I could’ve put Pringles in a bun at home.  Beyond that, I guess It was as pleasant as eating a fried batter sandwich can get. There is a lot to like about the Fried Chicken Burger in theory. From the fried egg to the arugula, it should work, right? Unfortunately, it just doesn’t.  FOLLY: The waiter, though clueless (he said he was new), was charming and funny, so we couldn’t even vex too much in real-time. NOSA: The cocktails, too, were a bright spot. If you’re about to set up a restaurant and you’re reading this, you should definitely steal their female bartender.  But, back to terrible things about Cafe de Flore.  The Lamb Ragu, which I have no picture of, was something I could have made myself. No shade to them, but this thing tasted like a TV dinner. Like, those ones you ate when you were a broke college student. For 8k, you’d probably get better from elsewhere. La Taverna, for example, has better pasta at a fraction of the price.  Speaking of TV dinners, did you know that Deli‘s has them for N4000? Which is insane because pasta, pasta sauce, and ground beef will probably cost you less than N4000. Why do they think people will spend that much money on a TV dinner? The rice and stew, I mean “white fish”, wasn’t actually bad. This is something your cook at home can serve you when he’s in a good mood. It wouldn’t be out of place if you ordered it at Traffic or your Cotonou chef brought it to you for dinner. But for almost nine thousand Nigerian nairas, you really have to look inwards if you choose to order this. A bit of self-reflection is in order. Why would you make such a terrible decision in the middle of a recession? POSTSCRIPT NOSA: More like Cafe de Flop, amirite? FOLLY: The wait time for the food was long so you might want to consider that if you choose to visit,  not that I advise that you do, though.  NOSA: Don’t waste your money. Love yourself.  VERDICT ",
    "spendDetails": { "itemsBought": [], "totalSpend": 20000 },
    "link": "https://www.eatdrinklagos.com/review/2021/1/18/review-cafe-de-flore-ikoyi-lagos",
    "single": true
  },
  {
    "restaurantName": "CREPAWAY",
    "restaurantAddress": "1089B Adeola Odeku Street, Victoria Island, Lagos ",
    "review": " NOSA: The other day, we were at RSVP and we were talking between ourselves about how incredible it is that RSVP is still fully reserved five years after launch.  FOLLY: I had tried to get a table for dinner on the same day and all they had were the high tables. NOSA: For a town as fickle as Lagos, that’s something to applaud. Now, this isn’t a review of RSVP but they’re noteworthy in this story because they pretty much kicked off this trend of American fast-casual fare (think Applebee’s or TGI Friday’s) you see at most restaurants in Lagos.  FOLLY: Erm, RSVP is New American and not fast-casual, far from fast-casual.  NOSA: Back then, by virtue of no competition, even the banalest of plates looked otherworldly and exciting. RSVP stepped it up as soon as it became obvious that all new openings were following the same template, but it doesn’t look like everyone got the memo. That’s how you end up with something like Crepaway.  Impressive decor. Check. Well trained staff. Check.  Boring food. Check.  FOLLY: In summary, Crepaway is one of those restaurants that’s not memorable in any way aside of the building. NOSA: Is it perfect for team bonding dinners? Absolutely. You’re expensing it so nobody is really looking out for the quality of the food here. It’s accessible and that all that matters. But you, dear EatDrinkLagos reader, are definitely not spending your own money here. Well, I hope you don’t. FOLLY: I mean, you can. We’re not inside your wallet.  NOSA:  Crepaway is a big franchise in Lebanon according to the Google and rumour has it that the owner of the property saw how successful the franchise is in Lebanon that he felt it necessary to force Casper & Gambini out to the next building. That’s the gist we heard, oh.  FOLLY: The menu is one of those multi-page ones where you know they can’t be good at everything.  NOSA:  We keep saying it, but no one restaurant’s good at that many things. We’ve been doing this for 5/6 years and we haven’t stumbled on a restaurant in Lagos that’s been able to pull it off. FOLLY: If your food menu exceeds four pages for your starters, mains, and desserts then I’m confident that you cannot be good at all of those things.  Kim Chick Fries from @crepawaynigeria. Basically their take on loaded fries. Had better in my lifetime, but not the worst. Welcome back to Instagram. Sign in to check out what your friends, family & interests have been capturing & sharing around the world. NOSA: We started with the Kim Chick Fries, a Korean-inspired take on loaded fries. Maybe we should’ve gone with the quesadillas instead because these types of restaurants always have nice quesadillas. The buyer’s remorse set in as soon as they brought the plate to our table.  FOLLY: Honestly, I would have settled for the chicken tenders because I didn’t really have faith in the Kim Chick fries. However, Nosa said we should order one of the signature dishes so I said sure.  NOSA: Tastewise, it’s not the worst thing I’ve had. It’s definitely better than the nonsense at The Metaphor, that’s for sure. The Bang Bang sauce is something I’d love to have bottled also. Unfortunately, that’s all the good things I can say. The chicken was dry and tasteless. For N4500, it’s such a forgettable appetizer. FOLLY: Honestly, it’s so unmemorable that even though I have notes from the experience I can’t even remember it.  The Deep Sea Baby from @crepawaynigeria. Not the best looking thing, but the pesto sauce on the side was great. Yeah, that's about it. Welcome back to Instagram. Sign in to check out what your friends, family & interests have been capturing & sharing around the world. NOSA: For our mains, we got the Deep Sea Baby and the Italian Job Burger.  NOSA: The Deep Sea Baby is a fish fillet served with vegetables, mashed potatoes and the most delicious pesto sauce. But as you can see from the picture, it was the most pitiful thing we ordered.  FOLLY: The plating of this didn’t bring me joy, I don’t get why they sent out a plate that looks so uninspiring. NOSA: That’s what Folly gets for trying to be healthier than me. FOLLY: The fish was largely bland as were the vegetables but thankfully neither was overcooked.  I remember a Twitter thread that was viral earlier this month about seasoning your vegetables especially your salad, I would like to cc Crepaway on that thread. While Nosa had high praise for the pesto sauce, I couldn’t just pour it all over my fish and use that to add flavour because of my intolerances but I think that must have been what they were going for. The garlic smashed potatoes were the only decent thing on the plate but it’s definitely not a good thing for the side to steal the show.  The Italian Job at @crepawaynigeria. There was supposed to be pepperoni in it and pesto mayo, but both were missing in ours. Welcome back to Instagram. Sign in to check out what your friends, family & interests have been capturing & sharing around the world. NOSA: It wasn’t any better for me because I didn’t like my burger either. There was way too much bun and that’s always a quick way to tell that a burger won’t be worth shit. This was the most vanilla chicken burger/sandwich I’ve had in Lagos and I’ve had the Chicken Republic burger a couple of times.  The burger fell apart easily, but it didn’t fall apart in the same way nice burgers do. It fell apart like the even the elements of the burger didn’t want to be there either and I don’t blame them because I ate half of it and gave up.  FOLLY: I insisted on getting a crepe even though everything hadn’t gone so well so far cause I was certain they’d be better at the thing after which they were named.  I was wrong. The Italian Job at @crepawaynigeria. There was supposed to be pepperoni in it and pesto mayo, but both were missing in ours. Welcome back to Instagram. Sign in to check out what your friends, family & interests have been capturing & sharing around the world. NOSA: The crepe was so tough that we needed a steak knife to cut through. Ok, I exaggerate a little. FOLLY: Yeah, that part is a lie but the crepes were incredibly rubbery. From making pancakes, I know two things could cause crepes to be rubbery - too much flour or cooking too slow. Considering how bad these were, I’d say it was a combination of the two.  NOSA: Just like the burger, it didn’t get much eating done to it. Neither of us was about to waste our calorie allocation to this. POSTSCRIPT FOLLY: Very mid. The pictures of the food look way better than they actually taste.  VERDICT ",
    "spendDetails": { "itemsBought": [], "totalSpend": 15000 },
    "link": "https://www.eatdrinklagos.com/review/2020/2/9/review-crepaway-victoria-island-lagos",
    "single": true
  },
  {
    "restaurantName": "ILÉ EROS ",
    "restaurantAddress": "14 Kafayat Abdulrasaq, off Fola Osibo Rd, Lekki Phase I, Lagos ",
    "restaurantPhoneNumber": "   0909 646 0675",
    "review": " NOSA: For the last three or four years, Eros isn’t a name I have associated with anything good. Harsh, I know, but that’s what disappointment after disappointment will do to you. There was the first time I tried Cookie Jar. Then, there was an event at the Polo Club.  FOLLY: Cookie Jar cake really let me down. I had seen it all over Instagram in 2014 - 2015 and I was really looking forward to tasting that purple rain flavour. The first time I tasted it, I actually pretended to like it. I felt I had to pretend because I had talked at length about how this cake was so good (based on Instagram) and I couldn’t admit that I didn’t like it. I chested it and never ate a Cookie Jar cake again except one cupcake in 2017.  24 Likes, 1 Comments - Eat.Drink.Lagos ™ (@eat.drink.lagos) on Instagram: \"Pumpkin Peppersoup with Goat Meat from @ile.eros\" NOSA: For me, the final straw was a dinner at Miele. That was it for me and when I saw the Ilé Eros announcement, there was no way in hell I was falling for it again.  But, look at me here: a clown.   You really have to give it Eros for sticking it out. He hasn’t shied away from the risk and he has pushed the Nigerian-fusion agenda despite some Lagos chefs talking down on his jollof risotto. Ilé Eros feels and tastes like a last-minute triumph over the naysayers.  FOLLY: I might have been one of the naysayers. This is why I also don’t believe ‘cancel culture’ has any real implications. Nosa and I both cancelled Eros but yet, here we are. 250 Likes, 5 Comments - Eat.Drink.Lagos ™ (@eat.drink.lagos) on Instagram: \"The Dabunama Roll at @ile.eros. Time to replace every spring roll in every small chops pack....\"  NOSA: Nigerian-fusion, too, is catching on and almost every Lagos chef is getting on it. I guess debts have to be paid somehow.  Maybe these naysayers could learn a thing or two from Eros. Put your head down, put the work in and meet your obligations. FOLLY: On the actual experience at Ilé Eros. In summary, it was delightful but that won’t suffice so we’ll work through all the details and courses. NOSA: Ilé Eros has a three, five and a seven-course tasting menu. A very sighting in Lagos restaurant menus. The only other place with something similar is Tarragon. You check out the full menu HERE. This is way too fancy for Lekki. All Lekki deserves is Blackbell and Foodies Hot n Spicy.  Not tasting menus.  FOLLY: They are going to have to move out of Lekki before they can add a tasting menu with wine pairings. NOSA: Folly and I went with both the five-course tasting menus - 5a and 5b. There’s an à la carte menu if you’re interested, but we couldn’t pass up N15,000 for five courses. For context, that’s exactly how much it cost us to get that utterly worthless platter at Pit Stop.   PS: A tasting menu is a bunch of small plates so don’t be alarmed when you see the portions. That’s how it works.  188 Likes, 4 Comments - Eat.Drink.Lagos ™ (@eat.drink.lagos) on Instagram: \"Ewa Agoyin with Crispy Beans from @ile.eros . We had the tasting menu at Ile Eros and there's so...\" FOLLY: Every time I’ve had a tasting menu, I’ve ended up stuffed. So even if it looks unassuming, it ends up being a good amount of food that will not leave you hungry.  NOSA: The dabunama roll, the first starter, is the only type of roll I want to eat for the rest of my life. Put it in every single small chops pack until I die. Both in concept and reality, this worked so well. Much much better than Nok’s snail samosa, for example.   FOLLY: The second starter was also very reminiscent of a small chops pack as it served puff puff and chicken, beef and prawn skewers. In comparison to the dambunama roll, this was a lot less impressive. The puff puff was stuffed with the Ilé Eros signature rodo jam and the zobo sauce. The puff puff tasted a little bit undercooked.  NOSA: Another thing that stands out at Ilé Eros is the quality of service. Our waitress was incredibly pleasant and well versed on the menu. Very necessary because if you’re going to play around with Nigerian food, your waitstaff will have to bring their ‘A’ game at every point.  FOLLY: The second starter was the Pumpkin Peppersoup for Nosa and the Ewa Agoyin for me.  I absolutely adored the plate on which the ewa agoyin was served; it was very fitting as it quite literally looks like a bean.  Inside of the garri croquet had the traditional boiled beans (ewa) that we’re used to and underneath the croquette is the famous agoyin sauce. What’s special about Eros’ take on Ewa Agoyin is the crispy beans which lends a sweetness to the entire dish while still retaining the dignity of Ewa Agoyin. It wasn’t served with bread and I didn’t miss it.  16 Likes, 1 Comments - Eat.Drink.Lagos ™ (@eat.drink.lagos) on Instagram: \"Asaro with Beef Short Rib from @ile.eros. The third course in our 5-course tasting menu we got at...\" NOSA: The bean croquet had a garri crust and that thing blew my mind. Take that garri crust and put it on a country fried steak. I really need one of you Lagos chefs to take me up on this. Lowkey, I should be a creative director, but for food. I can’t cook for shit, but I have these ideas like Virgil Abloh lol.   My soup? Eh, nothing to see here. You read soup on the menu and something this thick isn’t what you’re expecting. It’s closer to custard than it is to pepper soup. Not complaining, however. FOLLY: It was fragrant (thanks to the basil) and flavour-wise did have hints of pepper soup but as Nosa said would have left you offended if you were seriously craving pepper soup. I don’t agree with them calling it pepper soup, though, it seems like it could cause more confusion that it’s worth with guests.  NOSA: The Asaro was easily the highlight of our dinner, for me.  FOLLY: Interesting, then why did you steal so much of my yaji pasta? 143 Likes, 1 Comments - Eat.Drink.Lagos ™ (@eat.drink.lagos) on Instagram: \"Yaji Pasta with Seared Grouper and White Wine Sauce from @ile.eros' tasting menu. The pasta is on...\" NOSA: This is not the asaro your mother makes, but all the elements are in there. The asaro is like an asaro-flavoured paste with yam cubes drizzled on it. I was never the biggest fan of asaro as a child because the yam was just a bit too heavy for me. I like the other things and I always wished I could isolate them, but never could. That’s exactly what Ilé Eros has done with this plate. I think it was at this point I conceded and gave it up for Ilé Eros. I’m still in shock at how good all of it was. FOLLY: I didn’t taste this because Nosa didn’t share. NOSA: Soz, b. FOLLY: My next course was the Yaji pasta with seared grouper and white wine sauce. NOSA: The Yaji pasta was tacked in there like an afterthought, but you should definitely order this as an à la carte main. It’s also their Wednesday meal deal.  FOLLY: The fish was outstanding. The white wine sauce was buttery and delicate and not laden with cream. NOSA: The truffle Jollof feels like it was done to appease the “where’s the food?” crowd. The portion in unusually large versus the other plates. It’s like Eros is patting you on the back for being a good sport and playing with him so he’s rewarding you with an accessible plate to close it out. Definitely the most meh of the courses, but I get why it’s there.  Welcome back to Instagram. Sign in to check out what your friends, family & interests have been capturing & sharing around the world. FOLLY: I don’t usually agree with Nosa on his theories but he does have a point on this portion size of this course. We nearly didn’t finish it too. I also agree that it was the least well-executed dish. For example, the prawn was significantly overcooked. Fortunately, the shelled part of the prawn was preserved and wasn’t as overcooked as the exposed sides. On the flip side, the truffle Jollof was delicious. I believe the layered and complex flavour profile and scent of truffles is a perfect pair (and elevates) a full bodied dish like smoky Nigerian Jollof.  NOSA: Overall, this was a proper experience.  FOLLY: I think the word he’s looking for is excellent. For those wondering, dessert was a choice from the regular menu. NOSA: Maybe the guys spamming our Restaurant of the Year vote had a point. Nok finally has competition. POSTSCRIPT NOSA: Very very good. Not an everyday restaurant, so keep this for special occasions  VERDICT ",
    "spendDetails": { "itemsBought": [], "totalSpend": 18000 },
    "link": "https://www.eatdrinklagos.com/review/2020/2/9/review-ile-eros-lekki-lagos",
    "single": true
  },

  {
    "restaurantName": "After my article “Date Night in Lagos: The Most Romantic Restaurants in the City” was published, we got more than a few mentions on Twitter wondering why a notably romantic restaurant was absent from the list; The House Lagos. After careful consideration — which is ‘Denise Code’ for looking up the restaurant on Instagram and making sure it’s Instagrammable enough for her vain agenda — I decided The House  was ripe for the reviewing. ",
    "restaurantAddress": "---",
    "restaurantPhoneNumber": "---",
    "review": " Given the lack of concrete romance in my life, I opted to visit The House with a few close friends. On getting to The House, I realised — a no brainer, honestly — that the restaurant was actually a house. I mean, it’s literally called The House. What did I expect?  The House is extremely cosy and I think that’s where it gets its rep as the ‘Most Romantic Restaurant in Lagos’ from. Restaurateurs in Lagos are notorious for turning old residences to restaurants. In some cases, it’s a massive fail — and we trying not to name names — but with The House, it’s different. The House isn’t trying to convince you that it’s not a house.  You know it’s a house but it’s also a restaurant. It can be a bit difficult balancing both sides of this equation but I think they’re doing a pretty good job so far. Let’s get to the food. The House’s menu sports fusion foods, traditional Nigerian classics and so much more. I settled in with a the Faux Buzz With a Buzz and Akara Shrimp Tempura. The cocktail was mix of ginger ale with a shot of whiskey mixed with lychee and raspberry syrup. It was a pretty refreshing cocktail; if you have a sweet tooth for alcohol like I do, this is definitely a top recommendation from me. I finished my drink looooooong before my salad bowl or main course was here.  I’m totally in love with the Akara Shrimp Tempura. Man, it was BEYOND amazing. Beans and shrimps are never something I’d combine on my own but honestly, The House is on to something with this. The texture, the flavour and pretty much everything in between works pretty well. It’s so good! The akara batter didn’t feel soggy or weird, instead, it kept a nice crunch against the soft shrimp. If I didn’t have other stuff to try, I’d have had another serving of this and honestly gone home a happy baby.  Next, I had the Salad Bowl. It was a Build-Your-Own bowl and creating the ‘perfect’ salad had to be one of the highlights of my evening. The House lets you pick six (6) items off the salad menu but I went with seven (7) because why not? Adding extra items will cost you extra but honestly, it’s worth it.  For my salad, I had; Kale; Tomatoes; Cucumbers; Parmesan Cheese; Parsley; Chicken; Prawns and; Honey Mustard (for dressing). The salad was very fresh. All the veggies were fresh, firm and evenly coloured and the Kale was not bitter. I’ve had more than a few salads with nasty Kale in recent times so honestly, I was beyond grateful this was better. I did have issues with the chicken and the dressing, though. The chicken was a bit bland and quite dry. The dressing on the other hand just wasn’t enough for the bowl. Asides that, I rate this salad pretty highly. Moving on! Next, for my main, I had Grilled Lamb Chops. The lamb chops were served with rosemary potatoes and a side of gravy. Anytime I have Lamb, I feel like I understand why the Hebrew God demanded this as sacrifice in the Old Testament. Lamb is such a premium meat. The lamb was soft, intensely flavourful and came right of the bone with no extra hassle; as it should be. Frankly speaking, I wasn’t feeling the potatoes. I thought they were a bit too oily and really, it that overshadowed any bit of flavour they could’ve had. Overall, I think it was pretty good but just good.  Finally, I had the Baileys Cookies and Cream Parfait for dessert. I’ve made it pretty clear about my love for combining sweets and alcohol. Sadly, this parfait didn’t make my good books. Why? It was almost all cream and no cookie! I wish there was a bit more cookie in the parfait, that way, it wouldn’t have felt like I was simply swallowing whipped cream while having it.  This does make me really sad because I’d been having such a good time so far. Sigh. ",
    "spendDetails": {
      "itemsBought": [
        { "itemName": "Akara Shrimp Tempura", "itemPrice": "4,500 " },
        {
          "itemName": "Salad Bowl (Build Your Own Bowl)",
          "itemPrice": "4,000"
        },
        { "itemName": "Grilled Lamb Chops", "itemPrice": "14,000" },
        {
          "itemName": "Baileys Cookies and Cream Parfait",
          "itemPrice": "4,200"
        },
        { "itemName": "Faux Buzz with a Buzz", "itemPrice": "4,000" }
      ],
      "totalSpend": 30000
    },
    "link": "https://www.eatdrinklagos.com/review/the-house-cozy-restaurant-romantic-in-lagos",
    "single": true
  },
  {
    "restaurantName": "Black Olive",
    "restaurantAddress": "63 Awolowo Road, Ikoyi, Lagos",
    "review": " FOLLY: Welcome to 2019!  It’s our first review for the year and it’s coming on January 7 because we took a break after #EatDrinkFestival5. This was my favourite festival to date after the first one in 2014. The first one will always be my favourite because I was completely blown away that we pulled it off and then we were on CNN African Voices for it the month after. Horn tooting aside, we have a lot planned for content this year and we look forward to making some big announcement towards the end of the week but until then let’s explore the pasta-abilities of Black Olive.  NOSA: Do Nigerians like their spaghetti cooked past al dente?  Like, noodle soft?  FOLLY: They do. The spaghetti was so overcooked that some strings split and appeared flat - almost like linguini. I think most people also prefer their rice to err on the side of soft and fluffy as opposed to firm. I ordered the Spaghetti & Meatballs at Black Olive and the pasta was “baby food soft”. NOSA: After looking through the restaurant’s Instagram account, it looks a bit intentional. Something similar happened during our initial visit to BL Restaurant on Sinari Daranijo. When we sent the plate back to the kitchen, the chef insisted that most of the customers liked their spaghetti on the “soft” side. There was no returning of plates at Black Olive, just a perplexed waiter for us. The chef did come out to apologize so I guess that’s fair.    FOLLY: The waiter was very perceptive because when I requested he remove my plate even though it was less than half eaten and still had a meat ball (I only ate one and Nosa had the second), he asked what I didn’t like because I’d barely touched it. He probably relayed my complaints to the chef who then came out to apologise. No do over of the over cooked pasta though. NOSA: The Creamy Penne was a bit better. Not soft enough to offend, but enough for the penne to split in multiple pieces. Again, maybe it’s a Nigerian thing and I’m the one with the problem here.  The pasta sauce was a positive, however. Very rich and creamy with a heavy helping of pepper. There’s definitely a clientele that this menu is built for.   FOLLY: Nosa’s order was infinitely better than mine but I could only taste it because of the heavy cream and my allergies. Mushroom also makes everything infinitely better, but obviously on a lower scale when you use canned mushrooms. I forgive canned mushrooms on pasta because the sauce coats the mushroom and you can almost forgive the mushroom’s rubbery texture, but I don’t forgive canned mushrooms on pizza. NOSA: Our favorite thing on the day was the starter - Tempura Shrimp.  FOLLY: The tempura was great for the simplest of reasons, clean oil and fried at the perfect temperature so it didn’t become soggy or dirty. The batter wasn’t too heavy on the shrimp so we got just the right amount of crisp and crunch. NOSA: I only wished the portion was larger because I loved it so much. Probably a foreshadowing of what was to come. I don’t mean to take us back, but why was the spaghetti so soft? Just look at it..  NOSA: Lol, I just can’t get over it. I’m sorry. Anyway, on to positive things - the service was excellent. The restaurant wasn’t packed. Actually, it was just us, but the attention received was commendable. The waiter was patient and attentive. That’s all you can ask for.  Oh, and it’s reasonably priced.  FOLLY: It’s very budget friendly but the food didn’t blow me away. POSTSCRIPT NOSA: Good try, good effort. Not for me, however.  FOLLY: They space is very nice. The menu prices are very casual while the space is tastefully upscale. VERDICT",
    "spendDetails": { "itemsBought": [], "totalSpend": 10000 },
    "link": "https://www.eatdrinklagos.com/review/black-olive-ikoyi-review",
    "single": true
  }
]
